#pragma once

// Fortnite (3.1) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "../SDK.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass DefenderAnimBlueprint.DefenderAnimBlueprint_C
// 0xD238 (0xD678 - 0x0440)
class UDefenderAnimBlueprint_C : public UFortDefenderAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0440(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_E4821AB8460C74A015E048AC7FB95025;      // 0x0448(0x0070)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5247C0274B74F5A70D5B4D90F93C298E;// 0x04B8(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_46899C8A4071A64C578BF7BA97266ADA;      // 0x0508(0x0070)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_7D8E45344E65A98F79E681B042F9E17D;// 0x0578(0x0088)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_22E1D22C42568E0972F39BAE1E5E33E5;// 0x0600(0x0088)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_AB4AB208467F7D29A279CA91CA6023A4;      // 0x0688(0x0070)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_EAC4932A4AC24598BF90648CF705453C;// 0x06F8(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9272F66D4C68A1443AD504A3F02283EE;// 0x07D8(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1C83663348D3D5F404F7CB968CCAC4E2;// 0x0860(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A1E42B64344DC0706EF7E80F6CF8B0E;// 0x08E8(0x0088)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_9B9A24B2420550D897F311BB18D49416;// 0x0970(0x0158)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0FCEB35644D6A6651CD406A77EFEF7E0;// 0x0AC8(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C7A6B07042E3C3BA70EF50BC14DF129F;// 0x0B50(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4936AE9549A5191CBA506DB8B9D05033;// 0x0C20(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2B4BD57A4993B57B65A5BE934E6E15AB;// 0x0CA8(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5400D46C4FBF199084E0F885A62F2B32;// 0x0D30(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B26602764D2432DCCA5693A0E85CFA71;// 0x0E00(0x0088)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_4263B903410C4398B56EE6AF1994DF06;// 0x0E88(0x0158)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_2D2CAC4A45A9CF60D811A293207C5053;// 0x0FE0(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_386E812149CEF2471E5B05965F58F571;// 0x10C0(0x00D0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_8FF2009248F2380315A92588D5A447C7;// 0x1190(0x0158)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_33B69BAE4B3D7456B99B75892ACD2321;// 0x12E8(0x0158)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_DC507E8949BB87805925508612E0AA8A;// 0x1440(0x0158)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_720A725A4CAEA0D63B2967BE1BEC3670;// 0x1598(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A0C6C5F24A195D583358AEB0636E52CD;// 0x1620(0x00D0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_55E4DA7247D94565762B31966C36CFE3;// 0x16F0(0x0158)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D2DBF6C64E89883E4AC65489AA087159;// 0x1848(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5466ECAA40FA6E70563D9B8815667860;// 0x18D0(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9ACA3991431F18255B92BCBA2A1E1808;// 0x1958(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B782E6BD4C22FF34D25F96AADF9668DA;// 0x1A28(0x0088)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_3516BA294727816B09C89BA10296BCE3;// 0x1AB0(0x0158)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_AFBBE7EA4BA7DC0F5D0C8EAF062D287C;// 0x1C08(0x0158)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_04EA61A246C908281C6CAEAD96529DFE;// 0x1D60(0x0158)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4D3359F9473E45CE1B3223AFA6D4DC38;// 0x1EB8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_996004E84186147D43474AB22E3164D9;// 0x1F88(0x0088)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_98CFFF0B474FF0257566E2B511686766;// 0x2010(0x0158)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7EFA228747025E718E19EF853128003D;// 0x2168(0x0088)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_8242DD424ADB68469C357F8DF3140B6E;// 0x21F0(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_42E700CC494BB38E4516ED97DBEDF8CB;// 0x22D0(0x0088)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_E84DF8774064A40B46FE01B2A68B7A1C;// 0x2358(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3338313448369EA3432A6BACD1FEDB88;// 0x2438(0x0088)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_EA5E9EA046CD57DFCD107BA7A608AC8E;// 0x24C0(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_46DDBAC94BCC95E7110F05B21F72EFAA;// 0x25A0(0x0088)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_0CD474CF480BB89ED8A3D89BE84171B3;// 0x2628(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C4CCE61145CDBE7E610A7B806FEE36A7;// 0x2708(0x0088)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_56CAE17E4BB2117A40F9048E40DB3BEE;// 0x2790(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5456ED134B19612137A640980525D45A;// 0x2870(0x0088)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_FC4496644D1D40C403D8499F1B5EBB99;// 0x28F8(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5C444A78407A98AC016F87A47BFBC7AD;// 0x29D8(0x0088)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_4EAB7D20443813E8B01564ABC04EE2E2;// 0x2A60(0x00E0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_79145F7C4D7250B0AA47C892F9833422;// 0x2B40(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2EAE3F4B4AE4BF5D028F4BA030A792D3;// 0x2C20(0x0088)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_BA1EF9514D430B1D9A7F3AA2E2B4BCCC;// 0x2CA8(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1F7909624B51C5890A0763B7FC2D4D5F;// 0x2D88(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A1515DC54009EB02415166A31123682E;// 0x2E10(0x0088)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_6EAB95544A11C31A9F2F57905EBFD2A2;// 0x2E98(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7E608C024897F4EF3EE1399F08081D96;// 0x2F78(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_41AFB34D42CE6DCFDF7AB8B3A3689277;// 0x3000(0x0088)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_574B16AA47EA353AFF3FA3B21A4126BE;// 0x3088(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A0444A694A6F8813A1FB118AD54D1B80;// 0x3168(0x00D0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_284A68AC48313F793D7DFBB6BAE32425;// 0x3238(0x0158)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_0D004768442B9EB9A7A85392CACBF0C1;// 0x3390(0x0158)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_DE66842943E7F43263D14CAD4C462414;// 0x34E8(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8A8F2E11466B71BB825D0EAC9505028E;// 0x35C8(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_10580C064829B50EA49A059E3032197A;// 0x3650(0x0088)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_84524DF446A65113722220AB0AE87DEA;// 0x36D8(0x0158)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_19F5863C43771519D9F838B1C3EEE0DD;// 0x3830(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5123296C43A032350A0F48A686132492;// 0x38B8(0x00D0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_6ED2F2D443041209C7705DA831D3C86E;// 0x3988(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8CF0AACD4C4E053AD3745AB597E788C3;// 0x3A68(0x0088)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_94503E074AB4DE3AB6784699A25B80B1;// 0x3AF0(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D390CDD3458060EA152E59AB633763CA;// 0x3BD0(0x00D0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_9338008D4738FD27633F16A3BCE48594;// 0x3CA0(0x0158)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_49E140784345752B6ECACEAE2CADF6F0;// 0x3DF8(0x0158)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_5F4422C74973C098E9EF1F89E26392BC;// 0x3F50(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3A35DD794C78215C0A80B2A5455FCF6A;// 0x4030(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_347361AB496D557B98B159B899C2D674;// 0x40B8(0x0088)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_E854FECB41C08BA0D24DF7B12DE7EDE7;// 0x4140(0x0158)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DAA069474D3DD4FEE87930A1F57C1ED5;// 0x4298(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1D7AEB02454EEA1222C20BA80F1CDBE9;// 0x4320(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_03F43764472B3F3F324022BAC4A1682B;// 0x43A8(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_24869B5540C2DBCEBD3A8AAF0504B147;// 0x4478(0x00D0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_57D0C8C84D75430E7390E99B40B09A52;// 0x4548(0x0158)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_7BC989E34C6E469D8B7945AB2345763F;// 0x46A0(0x0158)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_7164659543DC0BAE79F5B39B54B618E4;// 0x47F8(0x0158)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_3C780E6B4BE82BA917FFCCB6A3B87D99;// 0x4950(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4C662CCA47D7C9C7D7214190553DFE42;// 0x4A30(0x0088)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_25206C0249138D7DD6D3A093FE2CE670;// 0x4AB8(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9EDA510641BB83025A6852B836562182;// 0x4B98(0x0088)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_699397DF42DB0AACD5F68F85EA096FB7;// 0x4C20(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_51E608D34E398234FF098F96C7034D0C;// 0x4D00(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4BD9E8794DC207E531867A936A164FB9;// 0x4D88(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C29CA8FF4A89C5ED7157CD8C986B6070;// 0x4E10(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9995E3624B8CA55ED4DAF6A00FDE8B12;// 0x4E98(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7F38884E4E3949219A78C3A7C982253E;// 0x4F20(0x0088)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_71577BC84E7CFAD85C6F1EA4C39C50D4;// 0x4FA8(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F49BA6FB457B29226F839C83EACB5796;// 0x5088(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_91D2B2364A4D3176816B8AAEA1E06E7C;// 0x5110(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C8BC3E5648486AC12DA7C8BF19312A63;// 0x5198(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4963E76B46A491DC6E88C2BA4BCE52E9;// 0x5268(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D8D4A10142FA9C5945D3AB9A06CC8FF5;// 0x5338(0x0088)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_815AFD5C46ECDA1056954FAE0EDB35D6;// 0x53C0(0x0158)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_A83E844E42AC5795CBA094B0A8320D6F;// 0x5518(0x0158)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_5686DDE741D6697D4660EE99EFEB244F;// 0x5670(0x0158)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_C814EDB54FED508DAAD1FBAA308D60C9;// 0x57C8(0x00E0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_F08DA6EC409973A5B54F16A97BD61F16;// 0x58A8(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_AC9B873444063E7CBF406FBC2022182D;// 0x5988(0x0088)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_BD77C8B6413355EA7B38EEAA7291E8E4;// 0x5A10(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_26CAF04B40A5BCCBAD0878AB3823B31E;// 0x5AF0(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_96A1B4D64BEBCDDD4F54499601E062AF;// 0x5B78(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3E7BFACD4935DFA19CC48293869B3879;// 0x5C00(0x0088)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_BA737C0A4D814E76D28D78BC54086F26;      // 0x5C88(0x0070)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_D4E55C474449D68FDC8C969BE33EF85C;// 0x5CF8(0x00F0)
	unsigned char                                      UnknownData00[0x8];                                       // 0x5DE8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C6401F084373D4E9928F768C3C2B258E;// 0x5DF0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_77BF818D4C8628C2272CE18A6C2FCF35;// 0x5E70(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0E6A0717442BF4E2F42B33AFC5D7E2B0;// 0x5EF0(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E8824EF042E82E591AAF0CB29FA283BF;// 0x5F78(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_F31D1DCE480926B42E93E2A1871581F4;// 0x5FC0(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_02935E184F0DEE836FFCFF9F004DFED1;// 0x5FF8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C9B2D31F43E91FD1B7D5C49134B72C00;// 0x6040(0x00E0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_25B937894E92710F5D1C15BB4F78FF8B;// 0x6120(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3A9274F14C40865199C376B31470F683;// 0x61A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F851C53242DACDD4D9B8E7AB7527FFF9;// 0x6220(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6E0D273E4AC5DFD9A30B94B2A3187A89;// 0x62A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_69BE4369452243F17EF4B597D6DB38CE;// 0x6320(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_355D0FB047A80A18E42751AC21CA7060;// 0x63A0(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_60186E8C400E35B84D6B10B2C4C20CE8;// 0x6428(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8B9003B34E8730C933196B9F1B2F14C0;// 0x6470(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C161CE95478EE553D81BA184B80C007C;// 0x64F8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EEE07CC549A98207679D108503AFC567;// 0x6540(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D094129E4F21541904FB63BB12A2AF56;// 0x65C8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_364F640948A37DFAD7FC4FA5C63192A9;// 0x6610(0x0050)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_F5277C8242246485EDEAC48305259863;// 0x6660(0x00F0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AD70D7D041F4A4C0FEADB3860443BEBE;// 0x6750(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6FE2194E4F584DF4538FE5AFC617B028;// 0x67D0(0x0080)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4885A9CD403F21E1D7AC5F803B280764;// 0x6850(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E2AA29464E39950F6C2A3FBF0E45BF3F;// 0x6978(0x00D0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_6C32C1544C8DB31AC96E809FA1044A25;// 0x6A48(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_6FD9DE354ECB321D8FE9778A46322CF8;// 0x6B28(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3CCDEC6841D17DC8A4C1EF97EEC9ABB2;// 0x6C50(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_29C130784245B3678DDEC697A5A90ECB;// 0x6D78(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_89CC7293447DE1BAE2F39BA12496032E;// 0x6E58(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5EE9CDC3496081C8B7597C97B11FAB7D;// 0x6F80(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_040D92EF439F83069DE89285CF252E09;// 0x70A8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_464DC4EF452C07179424EC8261FAD143;// 0x71D0(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_994D7C6F498DFFFA0DE3DAB7ECF55822;// 0x72F8(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7A0120324A22ACAF4D7875A1473A7CED;// 0x73D8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_82254ACA40257EB5E7B70FA3DF5150DE;// 0x7500(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9C4FD02D43E207039A2CD9B40541D822;// 0x7628(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E292576C487B01AD541F9CA3816C4B11;// 0x7750(0x00D0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_0F6FD2B44A2E6CD8A5C802B80285281B;// 0x7820(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_842028F9451194FB4F5A959650AF08BF;// 0x7900(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_ABBC866742CAE084DDD2239718C5A50C;// 0x79D0(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_7462F2904A72DD814DC69A9BA33A0C52;// 0x7AF8(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_6E7D31514EEE4DD85FF69F8666AA9540;// 0x7BD8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_DE9A840346BA9FE6286900B9F315163E;// 0x7D00(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_EED9E8A9450AE8D605F3869B1E8BCFB3;// 0x7E28(0x00E0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_1F234A3A4408B0ABF1182E8272C6DF73;// 0x7F08(0x00E0)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_9C2DC2A0489673116347D8AC51389872;// 0x7FE8(0x0038)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C13064284C333BA929FC2A9C74644198;// 0x8020(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7BA98C6A4780766CB0EF29B00BC53CB4;// 0x8148(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_669A835742B461C044ED64A4024247E1;// 0x8270(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_707AC2504F7287ED2E747EA8981C3063;// 0x8350(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_15F6CE14417411456FFD87AB1298115E;// 0x8478(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_C14D54A74CC0E6681FA3C395AB7392B2;// 0x85A0(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_328FBC69418D4E1054E82AA0C05016B1;// 0x8680(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5F3C4F434FCE6D29189E1385AAB888B1;// 0x87A8(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_9C216EDD4FB0324AFEF7A68367A251CF;// 0x88D0(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C4FCB1F64F146313B5DE79A08CD032DD;// 0x89B0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2FB7F76745B788155A4B579D632E5CDF;// 0x8AD8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_49A6AF0646C8485D615B9A8D54F792C6;// 0x8C00(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7A71176C417E04DBB47024ACE9717092;// 0x8D28(0x00D0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_57F0DA9847C014EBDBBFF6A953FC7684;// 0x8DF8(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D083052A45A027CE297EEF8A86602FC0;// 0x8ED8(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_E474A0A1443788298702BBB8575952F3;// 0x8FA8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_60A93C0847A5CF88A5097DB839DA0904;// 0x90D0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_00CD180E4E30AF49AA0BA0BFE7FF2078;// 0x91F8(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0884A01C466DEAFDE62A24B416D9D3A9;// 0x9320(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_279DCAF944D85F63548BCC9E0C3CDA4A;// 0x9448(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4C7E6DF0489101080622FCACEABAFCDB;// 0x9570(0x00D0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_38A36A54457E509ECAA2228F71DCDEC9;// 0x9640(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_ED0ABA254F4A85BF1DEAB68D735ED10D;// 0x9720(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2B5C656C418841EDCE1A28BEC0A1EF94;// 0x97F0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_17D2B64E4CFF47B406F28ABCC5CF51DE;// 0x9918(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2B4DFDD54750B55CFDDFA09352092C7D;// 0x9A40(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_1A7A81504F9CE878D0A0BBAE57502F79;// 0x9B68(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_CF6F59B1496B4376E00458AA97AAEEE3;// 0x9C48(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_92F107004BBE007116F926B82BA3FE6B;// 0x9D18(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_AA2CDEEE4BAB4FF8114527BBC03A0036;// 0x9E40(0x00E0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_BAF51C674FB0C5A13F4A438BF8AD0A69;// 0x9F20(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7D7633DA46854FBA3CA41AB799FAA756;// 0xA000(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9BE61A9140B52D0205ECFD9729D95958;// 0xA128(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_E47BC4504BDBDC80D1709E90064E6A56;// 0xA250(0x00E0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_C7CCB27C44692FC1451DCDA4D4DC9EF9;// 0xA330(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_FBE51B534962FFDE5B6275AF5A72E0F6;// 0xA410(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_DFB337314C87660F56DE55A5BBB8A56A;// 0xA538(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9BF68F154892081249B193A9C2A7E256;// 0xA660(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3330FB6E470385E0A3EE62B7FC10C66B;// 0xA730(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D40E753347E5C5E9AD046AA529504BCF;// 0xA800(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_692EA1894729174294BFB6A6C5502488;// 0xA928(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_88450C10465A6358ACE0E398FB970170;// 0xAA50(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_20A1AF9E40E5D4F4DA96DC88C8D6A9B7;// 0xAB78(0x00E0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_9C0FAFE043D8DC5493669EAFA998B49E;// 0xAC58(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8FED2CF44AE97D2DF5E621BEB3332813;// 0xAD38(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_FA6A693E491D87A31F4AC68583C13537;// 0xAE60(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4F98DBE84EFBF28B843D7CBB3785B744;// 0xAF88(0x00D0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_10735CF943D8DDED5EEB9AA1C7D6F081;// 0xB058(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3612D25D4F5D5CD300E9A68E4E4C17EF;// 0xB138(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D210183143BFD04EF36617BAD8E5E316;// 0xB208(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A0D6BEE342755C81B72936B17794F5AC;// 0xB330(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_FEEFB1D949EFFD3058B92A943C5B3021;// 0xB458(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_545E303946E72AB151D13A9FFEBD1DD4;// 0xB580(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_62A42DCA4131C437C8B680B6643EF60E;// 0xB650(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_17A5DC934B64B4C6000E72B42C246964;// 0xB778(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_FABB814A400F79371C55D182B998C0B0;// 0xB8A0(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C29E0A2244C332927843E5B4F4DA7631;// 0xB980(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D414B6B44CE69FD59DC724966C7A590D;// 0xBAA8(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E83FE3914831C01D06726D99FB750EB5;// 0xBAF0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_61C2A86449B2EBB0570814A53C8FCE94;// 0xBBC0(0x0088)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A9BA95664D924EDB4C3AC5B7EF30872A;// 0xBC48(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AA6858004214FCB018D24981C0E68137;// 0xBCD0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_953E3C534C9947E985762E9ECC6E423D;// 0xBD18(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_532FBBE34D5936503CB9FC9E42BE4C87;// 0xBDF8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_D0974B09470E33B2ED3C8996CA75C623;// 0xBE40(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_Root_9B61E3BF44D1412D66489C9841A3052F;      // 0xBF20(0x0048)
	unsigned char                                      UnknownData01[0x8];                                       // 0xBF68(0x0008) MISSED OFFSET
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_58AD4F1248E216F909017BBB6A0E05FC; // 0xBF70(0x0240)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_0F7CBD0A4363B72214D9B384BA67A08D; // 0xC1B0(0x0240)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_4F356367429578831BF12B94AA1BC1C6;// 0xC3F0(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_2240A35641D5919737AA00806F59FCB3;// 0xC438(0x0048)
	struct FAnimNode_HandIKRetargeting                 AnimGraphNode_HandIKRetargeting_F656435C474CE7FCB541719C0710CC16;// 0xC480(0x0168)
	unsigned char                                      UnknownData02[0x8];                                       // 0xC5E8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_07B816674FF367032B2132A0D018DCB8;// 0xC5F0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_98DCE54045120EE00B0B62AE90667F09;// 0xC670(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_391C8E4F44658315F7E14D8C1A56D794;// 0xC6F0(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_262BB9C84B947CD2376FFBA48BEC00D2;// 0xC7C0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_07FF21F941FB36A4CB3083AC6CA13652;// 0xC8E8(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_E7EA18E24F6984E7668291820BE9CACE;// 0xCA10(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B66EA98342A46F8B38C81087594FD274;// 0xCAF0(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B7744C404201B1929E8B3BA659DD49D0;// 0xCBC0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_887D845044A0452DEDCF0AA2C25CC9D2;// 0xCCE8(0x0128)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_BF1B2F81425ACC47151E98AB9238FB34;// 0xCE10(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_36C8F60A47731136BE1315981E50E8AA;// 0xCEF0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D744BB5341210375D4604881339DC006;// 0xD018(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_891140BB4A21C481E02389978A370C1A;// 0xD060(0x0050)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0736BB67463CFF84B4609BB1D21C9F35;// 0xD0B0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6298208C4D1D2EC77992D4B94DDCB26F;// 0xD0F8(0x00E0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_64C5CBB341FE64EDE3C417AD1EB4B4DB;// 0xD1D8(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_8DD4BEBD40F6B8104BB0559E51652DA1;// 0xD2B8(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_111560AA47EF76A8C953F0A6891482AC;// 0xD398(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_038C2B0F4FDBAE18752B5781905EE67F;// 0xD468(0x0088)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_7D36B7164E8C7550648204998F30DA9E;// 0xD4F0(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3D6E708742C9A9363D8E38B3361F0B0E;// 0xD5D0(0x0088)
	struct FGameplayTagContainer                       TC_SurvivorTags;                                          // 0xD658(0x0020) (Edit, BlueprintVisible, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass DefenderAnimBlueprint.DefenderAnimBlueprint_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_BlendSpacePlayer_E474A0A1443788298702BBB8575952F3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_BlendSpacePlayer_60A93C0847A5CF88A5097DB839DA0904();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_BlendSpacePlayer_00CD180E4E30AF49AA0BA0BFE7FF2078();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_BlendSpacePlayer_0884A01C466DEAFDE62A24B416D9D3A9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_BlendSpacePlayer_279DCAF944D85F63548BCC9E0C3CDA4A();
