#pragma once

// Fortnite (3.1) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "../SDK.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Engine.Engine
// 0x0DD8 (0x0E00 - 0x0028)
class UEngine : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	class UFont*                                       TinyFont;                                                 // 0x0030(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             TinyFontName;                                             // 0x0038(0x0018) (Edit, Config, GlobalConfig)
	class UFont*                                       SmallFont;                                                // 0x0050(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             SmallFontName;                                            // 0x0058(0x0018) (Edit, Config, GlobalConfig)
	class UFont*                                       MediumFont;                                               // 0x0070(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             MediumFontName;                                           // 0x0078(0x0018) (Edit, Config, GlobalConfig)
	class UFont*                                       LargeFont;                                                // 0x0090(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             LargeFontName;                                            // 0x0098(0x0018) (Edit, Config, GlobalConfig)
	class UFont*                                       SubtitleFont;                                             // 0x00B0(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             SubtitleFontName;                                         // 0x00B8(0x0018) (Edit, Config, GlobalConfig)
	TArray<class UFont*>                               AdditionalFonts;                                          // 0x00D0(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData01[0x8];                                       // 0x00E0(0x0008) MISSED OFFSET
	TArray<struct FString>                             AdditionalFontNames;                                      // 0x00E8(0x0010) (Edit, ZeroConstructor, Config, GlobalConfig)
	class UClass*                                      ConsoleClass;                                             // 0x00F8(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftClassPath                              ConsoleClassName;                                         // 0x0100(0x0018) (Edit, Config, GlobalConfig, NoClear)
	class UClass*                                      GameViewportClientClass;                                  // 0x0118(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftClassPath                              GameViewportClientClassName;                              // 0x0120(0x0018) (Edit, Config, GlobalConfig, NoClear)
	class UClass*                                      LocalPlayerClass;                                         // 0x0138(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftClassPath                              LocalPlayerClassName;                                     // 0x0140(0x0018) (Edit, Config, GlobalConfig, NoClear)
	class UClass*                                      WorldSettingsClass;                                       // 0x0158(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftClassPath                              WorldSettingsClassName;                                   // 0x0160(0x0018) (Edit, Config, GlobalConfig, NoClear)
	struct FSoftClassPath                              NavigationSystemClassName;                                // 0x0178(0x0018) (Config, GlobalConfig, NoClear)
	class UClass*                                      NavigationSystemClass;                                    // 0x0190(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftClassPath                              AvoidanceManagerClassName;                                // 0x0198(0x0018) (Config, GlobalConfig, NoClear)
	class UClass*                                      AvoidanceManagerClass;                                    // 0x01B0(0x0008) (ZeroConstructor, IsPlainOldData)
	class UClass*                                      PhysicsCollisionHandlerClass;                             // 0x01B8(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftClassPath                              PhysicsCollisionHandlerClassName;                         // 0x01C0(0x0018) (Edit, Config, GlobalConfig, NoClear)
	struct FSoftClassPath                              GameUserSettingsClassName;                                // 0x01D8(0x0018) (Config, GlobalConfig, NoClear)
	class UClass*                                      GameUserSettingsClass;                                    // 0x01F0(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftClassPath                              AIControllerClassName;                                    // 0x01F8(0x0018) (Config, GlobalConfig, NoClear)
	class UGameUserSettings*                           GameUserSettings;                                         // 0x0210(0x0008) (ZeroConstructor, IsPlainOldData)
	class UClass*                                      LevelScriptActorClass;                                    // 0x0218(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftClassPath                              LevelScriptActorClassName;                                // 0x0220(0x0018) (Edit, Config, GlobalConfig, NoClear)
	struct FSoftClassPath                              DefaultBlueprintBaseClassName;                            // 0x0238(0x0018) (Edit, Config, GlobalConfig, NoClear)
	struct FSoftClassPath                              GameSingletonClassName;                                   // 0x0250(0x0018) (Edit, Config, GlobalConfig, NoClear)
	class UObject*                                     GameSingleton;                                            // 0x0268(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftClassPath                              AssetManagerClassName;                                    // 0x0270(0x0018) (Edit, Config, GlobalConfig, NoClear)
	class UAssetManager*                               AssetManager;                                             // 0x0288(0x0008) (ZeroConstructor, IsPlainOldData)
	class UTexture2D*                                  DefaultTexture;                                           // 0x0290(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             DefaultTextureName;                                       // 0x0298(0x0018) (Config, GlobalConfig)
	class UTexture*                                    DefaultDiffuseTexture;                                    // 0x02B0(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             DefaultDiffuseTextureName;                                // 0x02B8(0x0018) (Config, GlobalConfig)
	class UTexture2D*                                  DefaultBSPVertexTexture;                                  // 0x02D0(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             DefaultBSPVertexTextureName;                              // 0x02D8(0x0018) (Config, GlobalConfig)
	class UTexture2D*                                  HighFrequencyNoiseTexture;                                // 0x02F0(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             HighFrequencyNoiseTextureName;                            // 0x02F8(0x0018) (Config, GlobalConfig)
	class UTexture2D*                                  DefaultBokehTexture;                                      // 0x0310(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             DefaultBokehTextureName;                                  // 0x0318(0x0018) (Config, GlobalConfig)
	class UTexture2D*                                  DefaultBloomKernelTexture;                                // 0x0330(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             DefaultBloomKernelTextureName;                            // 0x0338(0x0018) (Config, GlobalConfig)
	class UMaterial*                                   WireframeMaterial;                                        // 0x0350(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     WireframeMaterialName;                                    // 0x0358(0x0010) (ZeroConstructor, Config, GlobalConfig)
	class UMaterial*                                   DebugMeshMaterial;                                        // 0x0368(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             DebugMeshMaterialName;                                    // 0x0370(0x0018) (Config, GlobalConfig)
	class UMaterial*                                   LevelColorationLitMaterial;                               // 0x0388(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     LevelColorationLitMaterialName;                           // 0x0390(0x0010) (ZeroConstructor, Config, GlobalConfig)
	class UMaterial*                                   LevelColorationUnlitMaterial;                             // 0x03A0(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     LevelColorationUnlitMaterialName;                         // 0x03A8(0x0010) (ZeroConstructor, Config, GlobalConfig)
	class UMaterial*                                   LightingTexelDensityMaterial;                             // 0x03B8(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     LightingTexelDensityName;                                 // 0x03C0(0x0010) (ZeroConstructor, Config, GlobalConfig)
	class UMaterial*                                   ShadedLevelColorationLitMaterial;                         // 0x03D0(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     ShadedLevelColorationLitMaterialName;                     // 0x03D8(0x0010) (ZeroConstructor, Config, GlobalConfig)
	class UMaterial*                                   ShadedLevelColorationUnlitMaterial;                       // 0x03E8(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     ShadedLevelColorationUnlitMaterialName;                   // 0x03F0(0x0010) (ZeroConstructor, Config, GlobalConfig)
	class UMaterial*                                   RemoveSurfaceMaterial;                                    // 0x0400(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             RemoveSurfaceMaterialName;                                // 0x0408(0x0018) (Config, GlobalConfig)
	class UMaterial*                                   VertexColorMaterial;                                      // 0x0420(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     VertexColorMaterialName;                                  // 0x0428(0x0010) (ZeroConstructor, Config, GlobalConfig)
	class UMaterial*                                   VertexColorViewModeMaterial_ColorOnly;                    // 0x0438(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     VertexColorViewModeMaterialName_ColorOnly;                // 0x0440(0x0010) (ZeroConstructor, Config, GlobalConfig)
	class UMaterial*                                   VertexColorViewModeMaterial_AlphaAsColor;                 // 0x0450(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     VertexColorViewModeMaterialName_AlphaAsColor;             // 0x0458(0x0010) (ZeroConstructor, Config, GlobalConfig)
	class UMaterial*                                   VertexColorViewModeMaterial_RedOnly;                      // 0x0468(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     VertexColorViewModeMaterialName_RedOnly;                  // 0x0470(0x0010) (ZeroConstructor, Config, GlobalConfig)
	class UMaterial*                                   VertexColorViewModeMaterial_GreenOnly;                    // 0x0480(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     VertexColorViewModeMaterialName_GreenOnly;                // 0x0488(0x0010) (ZeroConstructor, Config, GlobalConfig)
	class UMaterial*                                   VertexColorViewModeMaterial_BlueOnly;                     // 0x0498(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FString                                     VertexColorViewModeMaterialName_BlueOnly;                 // 0x04A0(0x0010) (ZeroConstructor, Config, GlobalConfig)
	struct FSoftObjectPath                             DebugEditorMaterialName;                                  // 0x04B0(0x0018) (Config, GlobalConfig)
	class UMaterial*                                   ConstraintLimitMaterial;                                  // 0x04C8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    ConstraintLimitMaterialX;                                 // 0x04D0(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    ConstraintLimitMaterialXAxis;                             // 0x04D8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    ConstraintLimitMaterialY;                                 // 0x04E0(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    ConstraintLimitMaterialYAxis;                             // 0x04E8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    ConstraintLimitMaterialZ;                                 // 0x04F0(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    ConstraintLimitMaterialZAxis;                             // 0x04F8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMaterialInstanceDynamic*                    ConstraintLimitMaterialPrismatic;                         // 0x0500(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMaterial*                                   InvalidLightmapSettingsMaterial;                          // 0x0508(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             InvalidLightmapSettingsMaterialName;                      // 0x0510(0x0018) (Config, GlobalConfig)
	class UMaterial*                                   PreviewShadowsIndicatorMaterial;                          // 0x0528(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             PreviewShadowsIndicatorMaterialName;                      // 0x0530(0x0018) (Edit, Config, GlobalConfig)
	class UMaterial*                                   ArrowMaterial;                                            // 0x0548(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             ArrowMaterialName;                                        // 0x0550(0x0018) (Config, GlobalConfig)
	struct FLinearColor                                LightingOnlyBrightness;                                   // 0x0568(0x0010) (Config, GlobalConfig, IsPlainOldData)
	TArray<struct FLinearColor>                        ShaderComplexityColors;                                   // 0x0578(0x0010) (ZeroConstructor, Config, GlobalConfig)
	TArray<struct FLinearColor>                        QuadComplexityColors;                                     // 0x0588(0x0010) (ZeroConstructor, Config, GlobalConfig)
	TArray<struct FLinearColor>                        LightComplexityColors;                                    // 0x0598(0x0010) (ZeroConstructor, Config, GlobalConfig)
	TArray<struct FLinearColor>                        StationaryLightOverlapColors;                             // 0x05A8(0x0010) (ZeroConstructor, Config, GlobalConfig)
	TArray<struct FLinearColor>                        LODColorationColors;                                      // 0x05B8(0x0010) (ZeroConstructor, Config, GlobalConfig)
	TArray<struct FLinearColor>                        HLODColorationColors;                                     // 0x05C8(0x0010) (ZeroConstructor, Config, GlobalConfig)
	TArray<struct FLinearColor>                        StreamingAccuracyColors;                                  // 0x05D8(0x0010) (ZeroConstructor, Config, GlobalConfig)
	float                                              MaxPixelShaderAdditiveComplexityCount;                    // 0x05E8(0x0004) (ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	float                                              MaxES2PixelShaderAdditiveComplexityCount;                 // 0x05EC(0x0004) (ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	float                                              MaxES3PixelShaderAdditiveComplexityCount;                 // 0x05F0(0x0004) (ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	float                                              MinLightMapDensity;                                       // 0x05F4(0x0004) (ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	float                                              IdealLightMapDensity;                                     // 0x05F8(0x0004) (ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	float                                              MaxLightMapDensity;                                       // 0x05FC(0x0004) (ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	unsigned char                                      bRenderLightMapDensityGrayscale : 1;                      // 0x0600(0x0001) (Config, GlobalConfig)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0601(0x0003) MISSED OFFSET
	float                                              RenderLightMapDensityGrayscaleScale;                      // 0x0604(0x0004) (ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	float                                              RenderLightMapDensityColorScale;                          // 0x0608(0x0004) (ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	struct FLinearColor                                LightMapDensityVertexMappedColor;                         // 0x060C(0x0010) (Config, GlobalConfig, IsPlainOldData)
	struct FLinearColor                                LightMapDensitySelectedColor;                             // 0x061C(0x0010) (Config, GlobalConfig, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x062C(0x0004) MISSED OFFSET
	TArray<struct FStatColorMapping>                   StatColorMappings;                                        // 0x0630(0x0010) (ZeroConstructor, Config, GlobalConfig)
	class UPhysicalMaterial*                           DefaultPhysMaterial;                                      // 0x0640(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             DefaultPhysMaterialName;                                  // 0x0648(0x0018) (Config, GlobalConfig)
	TArray<struct FGameNameRedirect>                   ActiveGameNameRedirects;                                  // 0x0660(0x0010) (ZeroConstructor, Config)
	TArray<struct FClassRedirect>                      ActiveClassRedirects;                                     // 0x0670(0x0010) (ZeroConstructor, Config)
	TArray<struct FPluginRedirect>                     ActivePluginRedirects;                                    // 0x0680(0x0010) (ZeroConstructor, Config)
	TArray<struct FStructRedirect>                     ActiveStructRedirects;                                    // 0x0690(0x0010) (ZeroConstructor, Config)
	class UTexture2D*                                  PreIntegratedSkinBRDFTexture;                             // 0x06A0(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             PreIntegratedSkinBRDFTextureName;                         // 0x06A8(0x0018) (Config, GlobalConfig)
	class UTexture2D*                                  MiniFontTexture;                                          // 0x06C0(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             MiniFontTextureName;                                      // 0x06C8(0x0018) (Config, GlobalConfig)
	class UTexture*                                    WeightMapPlaceholderTexture;                              // 0x06E0(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             WeightMapPlaceholderTextureName;                          // 0x06E8(0x0018) (Config, GlobalConfig)
	class UTexture2D*                                  LightMapDensityTexture;                                   // 0x0700(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FSoftObjectPath                             LightMapDensityTextureName;                               // 0x0708(0x0018) (Config, GlobalConfig)
	unsigned char                                      UnknownData04[0x8];                                       // 0x0720(0x0008) MISSED OFFSET
	class UGameViewportClient*                         GameViewport;                                             // 0x0728(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<struct FString>                             DeferredCommands;                                         // 0x0730(0x0010) (ZeroConstructor)
	int                                                TickCycles;                                               // 0x0740(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                GameCycles;                                               // 0x0744(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ClientCycles;                                             // 0x0748(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              NearClipPlane;                                            // 0x074C(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      bHardwareSurveyEnabled : 1;                               // 0x0750(0x0001) (Deprecated)
	unsigned char                                      bSubtitlesEnabled : 1;                                    // 0x0750(0x0001) (Edit, Config)
	unsigned char                                      bSubtitlesForcedOff : 1;                                  // 0x0750(0x0001) (Edit, Config)
	unsigned char                                      UnknownData05[0x3];                                       // 0x0751(0x0003) MISSED OFFSET
	int                                                MaximumLoopIterationCount;                                // 0x0754(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      bCanBlueprintsTickByDefault : 1;                          // 0x0758(0x0001) (Edit, Config)
	unsigned char                                      bOptimizeAnimBlueprintMemberVariableAccess : 1;           // 0x0758(0x0001) (Edit, Config)
	unsigned char                                      bAllowMultiThreadedAnimationUpdate : 1;                   // 0x0758(0x0001) (Edit, Config)
	unsigned char                                      bEnableEditorPSysRealtimeLOD : 1;                         // 0x0758(0x0001) (Config)
	unsigned char                                      UnknownData06 : 1;                                        // 0x0758(0x0001)
	unsigned char                                      bSmoothFrameRate : 1;                                     // 0x0758(0x0001) (Edit, Config)
	unsigned char                                      bUseFixedFrameRate : 1;                                   // 0x0758(0x0001) (Edit, Config)
	unsigned char                                      UnknownData07[0x3];                                       // 0x0759(0x0003) MISSED OFFSET
	float                                              FixedFrameRate;                                           // 0x075C(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	struct FFloatRange                                 SmoothedFrameRateRange;                                   // 0x0760(0x0010) (Edit, Config)
	unsigned char                                      bCheckForMultiplePawnsSpawnedInAFrame : 1;                // 0x0770(0x0001) (Config)
	unsigned char                                      UnknownData08[0x3];                                       // 0x0771(0x0003) MISSED OFFSET
	int                                                NumPawnsAllowedToBeSpawnedInAFrame;                       // 0x0774(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      bShouldGenerateLowQualityLightmaps : 1;                   // 0x0778(0x0001) (Config, GlobalConfig, Deprecated)
	unsigned char                                      UnknownData09[0x3];                                       // 0x0779(0x0003) MISSED OFFSET
	struct FColor                                      C_WorldBox;                                               // 0x077C(0x0004) (IsPlainOldData)
	struct FColor                                      C_BrushWire;                                              // 0x0780(0x0004) (IsPlainOldData)
	struct FColor                                      C_AddWire;                                                // 0x0784(0x0004) (IsPlainOldData)
	struct FColor                                      C_SubtractWire;                                           // 0x0788(0x0004) (IsPlainOldData)
	struct FColor                                      C_SemiSolidWire;                                          // 0x078C(0x0004) (IsPlainOldData)
	struct FColor                                      C_NonSolidWire;                                           // 0x0790(0x0004) (IsPlainOldData)
	struct FColor                                      C_WireBackground;                                         // 0x0794(0x0004) (IsPlainOldData)
	struct FColor                                      C_ScaleBoxHi;                                             // 0x0798(0x0004) (IsPlainOldData)
	struct FColor                                      C_VolumeCollision;                                        // 0x079C(0x0004) (IsPlainOldData)
	struct FColor                                      C_BSPCollision;                                           // 0x07A0(0x0004) (IsPlainOldData)
	struct FColor                                      C_OrthoBackground;                                        // 0x07A4(0x0004) (IsPlainOldData)
	struct FColor                                      C_Volume;                                                 // 0x07A8(0x0004) (IsPlainOldData)
	struct FColor                                      C_BrushShape;                                             // 0x07AC(0x0004) (IsPlainOldData)
	float                                              StreamingDistanceFactor;                                  // 0x07B0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData10[0x4];                                       // 0x07B4(0x0004) MISSED OFFSET
	struct FDirectoryPath                              GameScreenshotSaveDirectory;                              // 0x07B8(0x0010) (Edit, Config)
	TEnumAsByte<ETransitionType>                       TransitionType;                                           // 0x07C8(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData11[0x7];                                       // 0x07C9(0x0007) MISSED OFFSET
	struct FString                                     TransitionDescription;                                    // 0x07D0(0x0010) (ZeroConstructor)
	struct FString                                     TransitionGameMode;                                       // 0x07E0(0x0010) (ZeroConstructor)
	float                                              MeshLODRange;                                             // 0x07F0(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      bAllowMatureLanguage : 1;                                 // 0x07F4(0x0001) (Config)
	unsigned char                                      UnknownData12[0x3];                                       // 0x07F5(0x0003) MISSED OFFSET
	float                                              CameraRotationThreshold;                                  // 0x07F8(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              CameraTranslationThreshold;                               // 0x07FC(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              PrimitiveProbablyVisibleTime;                             // 0x0800(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              MaxOcclusionPixelsFraction;                               // 0x0804(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      bPauseOnLossOfFocus : 1;                                  // 0x0808(0x0001) (Config)
	unsigned char                                      UnknownData13[0x3];                                       // 0x0809(0x0003) MISSED OFFSET
	int                                                MaxParticleResize;                                        // 0x080C(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	int                                                MaxParticleResizeWarn;                                    // 0x0810(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData14[0x4];                                       // 0x0814(0x0004) MISSED OFFSET
	TArray<struct FDropNoteInfo>                       PendingDroppedNotes;                                      // 0x0818(0x0010) (ZeroConstructor, Transient)
	float                                              NetClientTicksPerSecond;                                  // 0x0828(0x0004) (ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	float                                              DisplayGamma;                                             // 0x082C(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              MinDesiredFrameRate;                                      // 0x0830(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	struct FLinearColor                                DefaultSelectedMaterialColor;                             // 0x0834(0x0010) (Config, GlobalConfig, IsPlainOldData)
	struct FLinearColor                                SelectedMaterialColor;                                    // 0x0844(0x0010) (Transient, IsPlainOldData)
	struct FLinearColor                                SelectionOutlineColor;                                    // 0x0854(0x0010) (Transient, IsPlainOldData)
	struct FLinearColor                                SubduedSelectionOutlineColor;                             // 0x0864(0x0010) (Transient, IsPlainOldData)
	struct FLinearColor                                SelectedMaterialColorOverride;                            // 0x0874(0x0010) (Transient, IsPlainOldData)
	bool                                               bIsOverridingSelectedColor;                               // 0x0884(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData15[0x3];                                       // 0x0885(0x0003) MISSED OFFSET
	unsigned char                                      bEnableOnScreenDebugMessages : 1;                         // 0x0888(0x0001) (Config, GlobalConfig)
	unsigned char                                      bEnableOnScreenDebugMessagesDisplay : 1;                  // 0x0888(0x0001) (Transient)
	unsigned char                                      bSuppressMapWarnings : 1;                                 // 0x0888(0x0001) (Config, GlobalConfig)
	unsigned char                                      bDisableAILogging : 1;                                    // 0x0888(0x0001) (Config, GlobalConfig)
	unsigned char                                      UnknownData16[0x3];                                       // 0x0889(0x0003) MISSED OFFSET
	uint32_t                                           bEnableVisualLogRecordingOnStart;                         // 0x088C(0x0004) (ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	unsigned char                                      UnknownData17[0x4];                                       // 0x0890(0x0004) MISSED OFFSET
	int                                                ScreenSaverInhibitorSemaphore;                            // 0x0894(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      bLockReadOnlyLevels : 1;                                  // 0x0898(0x0001) (Transient)
	unsigned char                                      UnknownData18[0x7];                                       // 0x0899(0x0007) MISSED OFFSET
	struct FString                                     ParticleEventManagerClassPath;                            // 0x08A0(0x0010) (ZeroConstructor, Config, GlobalConfig)
	unsigned char                                      UnknownData19[0x10];                                      // 0x08B0(0x0010) MISSED OFFSET
	float                                              SelectionHighlightIntensity;                              // 0x08C0(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              SelectionMeshSectionHighlightIntensity;                   // 0x08C4(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              BSPSelectionHighlightIntensity;                           // 0x08C8(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              HoverHighlightIntensity;                                  // 0x08CC(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              SelectionHighlightIntensityBillboards;                    // 0x08D0(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData20[0x40C];                                     // 0x08D4(0x040C) MISSED OFFSET
	TArray<struct FNetDriverDefinition>                NetDriverDefinitions;                                     // 0x0CE0(0x0010) (ZeroConstructor, Transient, Config)
	TArray<struct FString>                             ServerActors;                                             // 0x0CF0(0x0010) (ZeroConstructor, Config)
	TArray<struct FString>                             RuntimeServerActors;                                      // 0x0D00(0x0010) (ZeroConstructor)
	unsigned char                                      bStartedLoadMapMovie : 1;                                 // 0x0D10(0x0001) (Transient)
	unsigned char                                      UnknownData21[0x17];                                      // 0x0D11(0x0017) MISSED OFFSET
	int                                                NextWorldContextHandle;                                   // 0x0D28(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData22[0xD4];                                      // 0x0D2C(0x00D4) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Engine");
		return ptr;
	}

};


// Class Engine.Player
// 0x0020 (0x0048 - 0x0028)
class UPlayer : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	class APlayerController*                           PlayerController;                                         // 0x0030(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                CurrentNetSpeed;                                          // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ConfiguredInternetSpeed;                                  // 0x003C(0x0004) (ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	int                                                ConfiguredLanSpeed;                                       // 0x0040(0x0004) (ZeroConstructor, Config, GlobalConfig, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0044(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Player");
		return ptr;
	}

};


// Class Engine.LocalPlayer
// 0x0180 (0x01C8 - 0x0048)
class ULocalPlayer : public UPlayer
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0048(0x0028) MISSED OFFSET
	class UGameViewportClient*                         ViewportClient;                                           // 0x0070(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1C];                                      // 0x0078(0x001C) MISSED OFFSET
	TEnumAsByte<EAspectRatioAxisConstraint>            AspectRatioAxisConstraint;                                // 0x0094(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0095(0x0003) MISSED OFFSET
	class UClass*                                      PendingLevelPlayerControllerClass;                        // 0x0098(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      bSentSplitJoin : 1;                                       // 0x00A0(0x0001) (Edit, Transient, EditConst)
	unsigned char                                      UnknownData03[0x67];                                      // 0x00A1(0x0067) MISSED OFFSET
	int                                                ControllerId;                                             // 0x0108(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0xBC];                                      // 0x010C(0x00BC) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.LocalPlayer");
		return ptr;
	}

};


// Class Engine.BlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBlueprintFunctionLibrary : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.BlueprintFunctionLibrary");
		return ptr;
	}

};


// Class Engine.OnlineBlueprintCallProxyBase
// 0x0000 (0x0028 - 0x0028)
class UOnlineBlueprintCallProxyBase : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.OnlineBlueprintCallProxyBase");
		return ptr;
	}


	void Activate();
};


// Class Engine.NetConnection
// 0x1890 (0x18D8 - 0x0048)
class UNetConnection : public UPlayer
{
public:
    TArray<class UChildConnection*>                    Children;                                                 // 0x0048(0x0010) (ZeroConstructor, Transient)
    class UNetDriver*                                  Driver;                                                   // 0x0058(0x0008) (ZeroConstructor, IsPlainOldData)
    class UClass*                                      PackageMapClass;                                          // 0x0060(0x0008) (ZeroConstructor, IsPlainOldData)
    class UPackageMap*                                 PackageMap;                                               // 0x0068(0x0008) (ZeroConstructor, IsPlainOldData)
    TArray<class UChannel*>                            OpenChannels;                                             // 0x0070(0x0010) (ZeroConstructor)
    TArray<class AActor*>                              SentTemporaries;                                          // 0x0080(0x0010) (ZeroConstructor)
    class AActor*                                      ViewTarget;                                               // 0x0090(0x0008) (ZeroConstructor, IsPlainOldData)
    class AActor*                                      OwningActor;                                              // 0x0098(0x0008) (ZeroConstructor, IsPlainOldData)
    int                                                MaxPacket;                                                // 0x00A0(0x0004) (ZeroConstructor, IsPlainOldData)
    unsigned char                                      InternalAck : 1;                                          // 0x00A4(0x0001)
    unsigned char                                      UnknownData00[0xB3];                                      // 0x00A5(0x00B3) MISSED OFFSET
    struct	FUniqueNetIdRepl                           PlayerID;                                                 // 0x0158(0x0028)
    int												   PacketOverhead;
    FString											   Challenge;
    FString											   ClientResponse;
    int												   ResponseId;
    FString											   RequestURL;
    int												   ClientLoginState;
    char										       ExpectedClientLoginMsgType; 
    FString											   CDKeyHash;
    FString											   CDKeyResponse; 
	double                                             LastReceiveTime;                                          // 0x01E8(0x0008) (ZeroConstructor, IsPlainOldData)
    unsigned char                                      UnknownData02[0x15A0];                                    // 0x01F0(0x15A0) MISSED OFFSET
    TArray<class UChannel*>                            ChannelsToTick;                                           // 0x1790(0x0010) (ZeroConstructor)
    unsigned char                                      UnknownData03[0x138];                                     // 0x17A0(0x0138) MISSED OFFSET

    static UClass* StaticClass()
    {
        static auto ptr = UObject::FindClass("Class Engine.NetConnection");
        return ptr;
    }

};


// Class Engine.NetDriver
// 0x04F8 (0x0520 - 0x0028)
class UNetDriver : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	struct FString                                     NetConnectionClassName;                                   // 0x0030(0x0010) (ZeroConstructor, Config)
	int                                                MaxDownloadSize;                                          // 0x0040(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      bClampListenServerTickRate : 1;                           // 0x0044(0x0001) (Config)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0045(0x0003) MISSED OFFSET
	int                                                NetServerMaxTickRate;                                     // 0x0048(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	int                                                MaxInternetClientRate;                                    // 0x004C(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	int                                                MaxClientRate;                                            // 0x0050(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              ServerTravelPause;                                        // 0x0054(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              SpawnPrioritySeconds;                                     // 0x0058(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              RelevantTimeout;                                          // 0x005C(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              KeepAliveTime;                                            // 0x0060(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              InitialConnectTimeout;                                    // 0x0064(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              ConnectionTimeout;                                        // 0x0068(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              TimeoutMultiplierForUnoptimizedBuilds;                    // 0x006C(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	bool                                               bNoTimeouts;                                              // 0x0070(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0071(0x0007) MISSED OFFSET
	class UNetConnection*                              ServerConnection;                                         // 0x0078(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<class UNetConnection*>                      ClientConnections;                                        // 0x0080(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData03[0x28];                                      // 0x0090(0x0028) MISSED OFFSET
	class UWorld*                                      World;                                                    // 0x00B8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UPackage*                                    WorldPackage;                                             // 0x00C0(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x20];                                      // 0x00C8(0x0020) MISSED OFFSET
	class UClass*                                      NetConnectionClass;                                       // 0x00E8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UProperty*                                   RoleProperty;                                             // 0x00F0(0x0008) (ZeroConstructor, IsPlainOldData)
	class UProperty*                                   RemoteRoleProperty;                                       // 0x00F8(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FName                                       NetDriverName;                                            // 0x0100(0x0008) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData05[0x48];                                      // 0x0108(0x0048) MISSED OFFSET
	float                                              Time;                                                     // 0x0150(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3AC];                                     // 0x0154(0x03AC) MISSED OFFSET
	class UReplicationDriver*                          ReplicationDriver;                                        // 0x0500(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData07[0x18];                                      // 0x0508(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.NetDriver");
		return ptr;
	}

};


// Class Engine.BlueprintAsyncActionBase
// 0x0000 (0x0028 - 0x0028)
class UBlueprintAsyncActionBase : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.BlueprintAsyncActionBase");
		return ptr;
	}


	void Activate();
};


// Class Engine.Actor
// 0x02F0 (0x0318 - 0x0028)
class AActor : public UObject
{
public:
	struct FActorTickFunction                          PrimaryActorTick;                                         // 0x0028(0x0058) (Edit, DisableEditOnInstance)
	unsigned char                                      bHidden : 1;                                              // 0x0080(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, Net)
	unsigned char                                      bNetTemporary : 1;                                        // 0x0080(0x0001)
	unsigned char                                      bNetStartup : 1;                                          // 0x0080(0x0001)
	unsigned char                                      bOnlyRelevantToOwner : 1;                                 // 0x0080(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      bAlwaysRelevant : 1;                                      // 0x0080(0x0001) (Edit, BlueprintVisible, DisableEditOnInstance)
	unsigned char                                      bReplicateMovement : 1;                                   // 0x0080(0x0001) (Edit, Net, DisableEditOnInstance)
	unsigned char                                      bTearOff : 1;                                             // 0x0080(0x0001) (Net)
	unsigned char                                      bExchangedRoles : 1;                                      // 0x0080(0x0001) (Transient)
	unsigned char                                      bNetLoadOnClient : 1;                                     // 0x0081(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bNetUseOwnerRelevancy : 1;                                // 0x0081(0x0001) (Edit, BlueprintVisible, DisableEditOnInstance)
	unsigned char                                      bRelevantForNetworkReplays : 1;                           // 0x0081(0x0001)
	unsigned char                                      bReplayRewindable : 1;                                    // 0x0081(0x0001)
	unsigned char                                      bAllowTickBeforeBeginPlay : 1;                            // 0x0081(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bAutoDestroyWhenFinished : 1;                             // 0x0081(0x0001) (BlueprintVisible)
	unsigned char                                      bBlockInput : 1;                                          // 0x0081(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bCanBeDamaged : 1;                                        // 0x0081(0x0001) (Edit, BlueprintVisible, Net, SaveGame)
	unsigned char                                      bCollideWhenPlacing : 1;                                  // 0x0082(0x0001)
	unsigned char                                      bFindCameraComponentWhenViewTarget : 1;                   // 0x0082(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bGenerateOverlapEventsDuringLevelStreaming : 1;           // 0x0082(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bIgnoresOriginShifting : 1;                               // 0x0082(0x0001) (Edit)
	unsigned char                                      bEnableAutoLODGeneration : 1;                             // 0x0082(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bIsEditorOnlyActor : 1;                                   // 0x0082(0x0001) (Edit)
	unsigned char                                      bActorSeamlessTraveled : 1;                               // 0x0082(0x0001)
	unsigned char                                      bReplicates : 1;                                          // 0x0082(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      bCanBeInCluster : 1;                                      // 0x0083(0x0001) (Edit)
	unsigned char                                      bAllowReceiveTickEventOnDedicatedServer : 1;              // 0x0083(0x0001)
	unsigned char                                      UnknownData00 : 5;                                        // 0x0083(0x0001)
	unsigned char                                      bActorEnableCollision : 1;                                // 0x0083(0x0001)
	unsigned char                                      bActorIsBeingDestroyed : 1;                               // 0x0084(0x0001) (Transient, DuplicateTransient)
	TEnumAsByte<ENetRole>                              RemoteRole;                                               // 0x0085(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0086(0x0002) MISSED OFFSET
	struct FRepMovement                                ReplicatedMovement;                                       // 0x0088(0x0034) (Edit, Net, DisableEditOnInstance)
	float                                              InitialLifeSpan;                                          // 0x00BC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CustomTimeDilation;                                       // 0x00C0(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x00C4(0x0004) MISSED OFFSET
	struct FRepAttachment                              AttachmentReplication;                                    // 0x00C8(0x0040) (Net, Transient)
	class AActor*                                      Owner;                                                    // 0x0108(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	struct FName                                       NetDriverName;                                            // 0x0110(0x0008) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ENetRole>                              Role;                                                     // 0x0118(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<ENetDormancy>                          NetDormancy;                                              // 0x0119(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	ESpawnActorCollisionHandlingMethod                 SpawnCollisionHandlingMethod;                             // 0x011A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EAutoReceiveInput>                     AutoReceiveInput;                                         // 0x011B(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                InputPriority;                                            // 0x011C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	class UInputComponent*                             InputComponent;                                           // 0x0120(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              NetCullDistanceSquared;                                   // 0x0128(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                NetTag;                                                   // 0x012C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              NetUpdateFrequency;                                       // 0x0130(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MinNetUpdateFrequency;                                    // 0x0134(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              NetPriority;                                              // 0x0138(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x013C(0x0004) MISSED OFFSET
	class APawn*                                       Instigator;                                               // 0x0140(0x0008) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	TArray<class AActor*>                              Children;                                                 // 0x0148(0x0010) (ZeroConstructor, Transient)
	class USceneComponent*                             RootComponent;                                            // 0x0158(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	TArray<class AMatineeActor*>                       ControllingMatineeActors;                                 // 0x0160(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData04[0x8];                                       // 0x0170(0x0008) MISSED OFFSET
	TArray<struct FName>                               Layers;                                                   // 0x0178(0x0010) (ZeroConstructor)
	TWeakObjectPtr<class UChildActorComponent>         ParentComponent;                                          // 0x0188(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TArray<struct FName>                               Tags;                                                     // 0x0190(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FScriptMulticastDelegate                    OnTakeAnyDamage;                                          // 0x01A0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnTakePointDamage;                                        // 0x01B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnActorBeginOverlap;                                      // 0x01C0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnActorEndOverlap;                                        // 0x01D0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnBeginCursorOver;                                        // 0x01E0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnEndCursorOver;                                          // 0x01F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnClicked;                                                // 0x0200(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnReleased;                                               // 0x0210(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnInputTouchBegin;                                        // 0x0220(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnInputTouchEnd;                                          // 0x0230(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
