#pragma once

// Fortnite (3.1) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "../SDK.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum FortniteGame.EFortAIDirectorEvent
enum class EFortAIDirectorEvent : uint8_t
{
	PlayerAIEnemies                = 0,
	PlayerTakeDamage               = 1,
	PlayerHealth                   = 2,
	PlayerDeath                    = 3,
	PlayerLookAtAIEnemy            = 4,
	PlayerDamageAIEnemy            = 5,
	PlayerKillAIEnemy              = 6,
	PlayerHealingPotential         = 7,
	PlayerAmmoLight                = 8,
	PlayerAmmoMedium               = 9,
	PlayerAmmoHeavy                = 10,
	PlayerAmmoShells               = 11,
	PlayerAmmoEnergy               = 12,
	PlayerAINear                   = 13,
	PlayerMovement                 = 14,
	ObjectiveTakeDamage            = 15,
	ObjectiveHealth                = 16,
	ObjectiveDestroyed             = 17,
	TrapFired                      = 18,
	TrapDamagedAIEnemy             = 19,
	ObjectivePathCost              = 20,
	PlayerPathCost                 = 21,
	ObjectiveNearbyBuildingDamaged = 22,
	Max_None                       = 23,
	EFortAIDirectorEvent_MAX       = 24
};


// Enum FortniteGame.EKeepDefenseState
enum class EKeepDefenseState : uint8_t
{
	Inactive                       = 0,
	Warmup                         = 1,
	Defense                        = 2,
	LastAlive                      = 3,
	Max                            = 4
};


// Enum FortniteGame.EFortDayPhase
enum class EFortDayPhase : uint8_t
{
	Morning                        = 0,
	Day                            = 1,
	Evening                        = 2,
	Night                          = 3,
	NumPhases                      = 4,
	EFortDayPhase_MAX              = 5
};


// Enum FortniteGame.EFortInventoryType
enum class EFortInventoryType : uint8_t
{
	World                          = 0,
	Account                        = 1,
	Outpost                        = 2,
	MAX                            = 3
};


// Enum FortniteGame.EOfferPurchaseError
enum class EOfferPurchaseError : uint8_t
{
	NoError                        = 0,
	PendingServerConfirmation      = 1,
	CannotAffordItem               = 2,
	InvalidOfferID                 = 3,
	InvalidPriceIndex              = 4,
	NoneLeft                       = 5,
	PurchaseAlreadyPending         = 6,
	NoConnection                   = 7,
	AccountNotEligible             = 8,
	CannotGiftItem                 = 9,
	EOfferPurchaseError_MAX        = 10
};


// Enum FortniteGame.EFortAlteration
enum class EFortAlteration : uint8_t
{
	AttributeSlot                  = 0,
	GameplaySlot                   = 1,
	ComplexCosmeticSlot            = 2,
	ColorSlot                      = 3,
	HeroSpecializationTier1Slot    = 4,
	HeroSpecializationTier2Slot    = 5,
	HeroSpecializationTier3Slot    = 6,
	HeroSpecializationTier4Slot    = 7,
	HeroSpecializationTier5Slot    = 8,
	EFortAlteration_MAX            = 9
};


// Enum FortniteGame.EFortItemType
enum class EFortItemType : uint8_t
{
	WorldItem                      = 0,
	Ammo                           = 1,
	Badge                          = 2,
	BackpackPickup                 = 3,
	BuildingPiece                  = 4,
	CharacterPart                  = 5,
	Consumable                     = 6,
	Deco                           = 7,
	EditTool                       = 8,
	Ingredient                     = 9,
	Food                           = 10,
	Gadget                         = 11,
	AthenaGadget                   = 12,
	HomebaseGadget                 = 13,
	HeroAbility                    = 14,
	MissionItem                    = 15,
	Trap                           = 16,
	Weapon                         = 17,
	WeaponMelee                    = 18,
	WeaponRanged                   = 19,
	WeaponHarvest                  = 20,
	WorldResource                  = 21,
	AccountItem                    = 22,
	AccountResource                = 23,
	CollectedResource              = 24,
	Alteration                     = 25,
	CardPack                       = 26,
	CharacterCosmetic              = 27,
	Currency                       = 28,
	Hero                           = 29,
	Schematic                      = 30,
	Worker                         = 31,
	Token                          = 32,
	DailyRewardScheduleToken       = 33,
	CodeToken                      = 34,
	Buff                           = 35,
	BuffCredit                     = 36,
	Quest                          = 37,
	ChallengeBundle                = 38,
	ChallengeBundleSchedule        = 39,
	GameplayModifier               = 40,
	Outpost                        = 41,
	HomebaseNode                   = 42,
	Defender                       = 43,
	ConversionControl              = 44,
	DeployableBaseCloudSave        = 45,
	ConsumableAccountItem          = 46,
	Quota                          = 47,
	Expedition                     = 48,
	HomebaseBannerIcon             = 49,
	HomebaseBannerColor            = 50,
	AthenaSkyDiveContrail          = 51,
	PersonalVehicle                = 52,
	AthenaGlider                   = 53,
	AthenaPickaxe                  = 54,
	AthenaHat                      = 55,
	AthenaBackpack                 = 56,
	AthenaCharacter                = 57,
	AthenaDance                    = 58,
	AthenaConsumableEmote          = 59,
	AthenaLoadingScreen            = 60,
	AthenaBattleBus                = 61,
	AthenaVictoryPose              = 62,
	AthenaSpray                    = 63,
	AthenaSeasonTreasure           = 64,
	AthenaSeason                   = 65,
	EventDescription               = 66,
	MatchAward                     = 67,
	AthenaEventToken               = 68,
	EventPurchaseTracker           = 69,
	SpecialItem                    = 70,
	Emote                          = 71,
	Stack                          = 72,
	CollectionBookPage             = 73,
	BGAConsumableWrapper           = 74,
	GiftBox                        = 75,
	Profile                        = 76,
	Max_None                       = 77,
	EFortItemType_MAX              = 78
};


// Enum FortniteGame.EFortTeam
enum class EFortTeam : uint8_t
{
	HumanCampaign                  = 0,
	Monster                        = 1,
	HumanPvP_Team1                 = 2,
	HumanPvP_Team2                 = 3,
	HumanPvP_Team3                 = 4,
	HumanPvP_Team4                 = 5,
	HumanPvP_Team5                 = 6,
	HumanPvP_Team6                 = 7,
	HumanPvP_Team7                 = 8,
	HumanPvP_Team8                 = 9,
	HumanPvP_Team9                 = 10,
	HumanPvP_Team10                = 11,
	HumanPvP_Team11                = 12,
	HumanPvP_Team12                = 13,
	HumanPvP_Team13                = 14,
	HumanPvP_Team14                = 15,
	HumanPvP_Team15                = 16,
	HumanPvP_Team16                = 17,
	HumanPvP_Team17                = 18,
	HumanPvP_Team18                = 19,
	HumanPvP_Team19                = 20,
	HumanPvP_Team20                = 21,
	HumanPvP_Team21                = 22,
	HumanPvP_Team22                = 23,
	HumanPvP_Team23                = 24,
	HumanPvP_Team24                = 25,
	HumanPvP_Team25                = 26,
	HumanPvP_Team26                = 27,
	HumanPvP_Team27                = 28,
	HumanPvP_Team28                = 29,
	HumanPvP_Team29                = 30,
	HumanPvP_Team30                = 31,
	HumanPvP_Team31                = 32,
	HumanPvP_Team32                = 33,
	HumanPvP_Team33                = 34,
	HumanPvP_Team34                = 35,
	HumanPvP_Team35                = 36,
	HumanPvP_Team36                = 37,
	HumanPvP_Team37                = 38,
	HumanPvP_Team38                = 39,
	HumanPvP_Team39                = 40,
	HumanPvP_Team40                = 41,
	HumanPvP_Team41                = 42,
	HumanPvP_Team42                = 43,
	HumanPvP_Team43                = 44,
	HumanPvP_Team44                = 45,
	HumanPvP_Team45                = 46,
	HumanPvP_Team46                = 47,
	HumanPvP_Team47                = 48,
	HumanPvP_Team48                = 49,
	HumanPvP_Team49                = 50,
	HumanPvP_Team50                = 51,
	HumanPvP_Team51                = 52,
	HumanPvP_Team52                = 53,
	HumanPvP_Team53                = 54,
	HumanPvP_Team54                = 55,
	HumanPvP_Team55                = 56,
	HumanPvP_Team56                = 57,
	HumanPvP_Team57                = 58,
	HumanPvP_Team58                = 59,
	HumanPvP_Team59                = 60,
	HumanPvP_Team60                = 61,
	HumanPvP_Team61                = 62,
	HumanPvP_Team62                = 63,
	HumanPvP_Team63                = 64,
	HumanPvP_Team64                = 65,
	HumanPvP_Team65                = 66,
	HumanPvP_Team66                = 67,
	HumanPvP_Team67                = 68,
	HumanPvP_Team68                = 69,
	HumanPvP_Team69                = 70,
	HumanPvP_Team70                = 71,
	HumanPvP_Team71                = 72,
	HumanPvP_Team72                = 73,
	HumanPvP_Team73                = 74,
	HumanPvP_Team74                = 75,
	HumanPvP_Team75                = 76,
	HumanPvP_Team76                = 77,
	HumanPvP_Team77                = 78,
	HumanPvP_Team78                = 79,
	HumanPvP_Team79                = 80,
	HumanPvP_Team80                = 81,
	HumanPvP_Team81                = 82,
	HumanPvP_Team82                = 83,
	HumanPvP_Team83                = 84,
	HumanPvP_Team84                = 85,
	HumanPvP_Team85                = 86,
	HumanPvP_Team86                = 87,
	HumanPvP_Team87                = 88,
	HumanPvP_Team88                = 89,
	HumanPvP_Team89                = 90,
	HumanPvP_Team90                = 91,
	HumanPvP_Team91                = 92,
	HumanPvP_Team92                = 93,
	HumanPvP_Team93                = 94,
	HumanPvP_Team94                = 95,
	HumanPvP_Team95                = 96,
	HumanPvP_Team96                = 97,
	HumanPvP_Team97                = 98,
	HumanPvP_Team98                = 99,
	HumanPvP_Team99                = 100,
	HumanPvP_Team100               = 101,
	HumanPvP_Team101               = 102,
	Spectator                      = 103,
	MAX                            = 104
};


// Enum FortniteGame.EFortCustomPartType
enum class EFortCustomPartType : uint8_t
{
	Head                           = 0,
	Body                           = 1,
	Hat                            = 2,
	Backpack                       = 3,
	Charm                          = 4,
	Face                           = 5,
	NumTypes                       = 6,
	EFortCustomPartType_MAX        = 7
};


// Enum FortniteGame.EFortReportDayPhase
enum class EFortReportDayPhase : uint8_t
{
	Dawn                           = 0,
	Dusk                           = 1,
	ZoneFinished                   = 2,
	PlayerLogout                   = 3,
	EFortReportDayPhase_MAX        = 4
};


// Enum FortniteGame.EAthenaTravelEventType
enum class EAthenaTravelEventType : uint8_t
{
	None                           = 0,
	GroundMove                     = 1,
	AirMove                        = 2,
	BattleBusJump                  = 3,
	LaunchJump                     = 4,
	Landed                         = 5,
	OpenChest                      = 6,
	OpenAmmo                       = 7,
	GotAssist                      = 8,
	GotKnockdown                   = 9,
	GotKill                        = 10,
	PlayerDowned                   = 11,
	PlayerDied                     = 12,
	Won                            = 13,
	EAthenaTravelEventType_MAX     = 14
};


// Enum FortniteGame.ERewardSource
enum class ERewardSource : uint8_t
{
	Invalid                        = 0,
	MinutesPlayed                  = 1,
	FirstKill                      = 2,
	TeamKills                      = 3,
	Placement                      = 4,
	Medals                         = 5,
	FirstWin                       = 6,
	SeasonLevelUp                  = 7,
	BookLevelUp                    = 8,
	MAX_COUNT                      = 9,
	ERewardSource_MAX              = 10
};


// Enum FortniteGame.EAthenaMatchXpMultiplierSource
enum class EAthenaMatchXpMultiplierSource : uint8_t
{
	Invalid                        = 0,
	BattlePassSelf                 = 1,
	BattlePassFriends              = 2,
	CosmeticSet                    = 3,
	AntiAddictionPenalty           = 4,
	MAX_COUNT                      = 5,
	EAthenaMatchXpMultiplierSource_MAX = 6
};


// Enum FortniteGame.EAthenaGamePhase
enum class EAthenaGamePhase : uint8_t
{
	None                           = 0,
	Setup                          = 1,
	Warmup                         = 2,
	Aircraft                       = 3,
	SafeZones                      = 4,
	EndGame                        = 5,
	Count                          = 6,
	EAthenaGamePhase_MAX           = 7
};


// Enum FortniteGame.EAthenaGamePhaseStep
enum class EAthenaGamePhaseStep : uint8_t
{
	None                           = 0,
	Setup                          = 1,
	Warmup                         = 2,
	GetReady                       = 3,
	BusLocked                      = 4,
	BusFlying                      = 5,
	StormForming                   = 6,
	StormHolding                   = 7,
	StormShrinking                 = 8,
	EndGame                        = 9,
	Count                          = 10,
	EAthenaGamePhaseStep_MAX       = 11
};


// Enum FortniteGame.EHudVisibilityState
enum class EHudVisibilityState : uint8_t
{
	FullyVisible                   = 0,
	FullyHidden                    = 1,
	GameOnly                       = 2,
	ReplayOnly                     = 3,
	MAX                            = 4
};


// Enum FortniteGame.ESpectatorCameraType
enum class ESpectatorCameraType : uint8_t
{
	ThirdPerson                    = 0,
	DroneFree                      = 1,
	Gameplay                       = 2,
	Arena                          = 3,
	Free                           = 4,
	ReverseShot                    = 5,
	FollowShot                     = 6,
	DroneFollow                    = 7,
	DroneAttach                    = 8,
	Projectile                     = 9,
	MAX                            = 10
};


// Enum FortniteGame.ECaptureState
enum class ECaptureState : uint8_t
{
	CS_Idle                        = 0,
	CS_Capturing                   = 1,
	CS_Contested                   = 2,
	CS_Resetting                   = 3,
	CS_Captured                    = 4,
	CS_Reset                       = 5,
	CS_MAX                         = 6
};


// Enum FortniteGame.EFOBIOStatus
enum class EFOBIOStatus : uint8_t
{
	Saving                         = 0,
	Loading                        = 1,
	Free                           = 2,
	EFOBIOStatus_MAX               = 3
};


// Enum FortniteGame.ECollectionBookRewardType
enum class ECollectionBookRewardType : uint8_t
{
	Uninitialized                  = 0,
	Book                           = 1,
	Page                           = 2,
	Section                        = 3,
	ECollectionBookRewardType_MAX  = 4
};


// Enum FortniteGame.EFortObjectiveStatus
enum class EFortObjectiveStatus : uint8_t
{
	Created                        = 0,
	InProgress                     = 1,
	Succeeded                      = 2,
	Failed                         = 3,
	NeutralCompletion              = 4,
	Max_None                       = 5,
	EFortObjectiveStatus_MAX       = 6
};


// Enum FortniteGame.EFortMissionVisibilityOverride
enum class EFortMissionVisibilityOverride : uint8_t
{
	Visible                        = 0,
	Invisible                      = 1,
	Max_None                       = 2,
	EFortMissionVisibilityOverride_MAX = 3
};


// Enum FortniteGame.EFortPrototypingStatus
enum class EFortPrototypingStatus : uint8_t
{
	Unknown                        = 0,
	Disabled                       = 1,
	Enabled                        = 2,
	EFortPrototypingStatus_MAX     = 3
};


// Enum FortniteGame.EMatchmakingCompleteResult
enum class EMatchmakingCompleteResult : uint8_t
{
	NotStarted                     = 0,
	UpdateNeeded                   = 1,
	OutpostNotFound                = 2,
	Cancelled                      = 3,
	NoResults                      = 4,
	Failure                        = 5,
	CreateFailure                  = 6,
	Success                        = 7,
	EMatchmakingCompleteResult_MAX = 8
};


// Enum FortniteGame.EMatchmakingState
enum class EMatchmakingState : uint8_t
{
	NotMatchmaking                 = 0,
	CancelingMatchmaking           = 1,
	ReleasingLock                  = 2,
	AcquiringLock                  = 3,
	LockAcquistionFailure          = 4,
	FindingEmptyServer             = 5,
	FindingExistingSession         = 6,
	TestingEmptyServers            = 7,
	TestingExistingSessions        = 8,
	JoiningExistingSession         = 9,
	NoMatchesAvailable             = 10,
	CleaningUpExisting             = 11,
	HandlingFailure                = 12,
	JoinSuccess                    = 13,
	EMatchmakingState_MAX          = 14
};


// Enum FortniteGame.EFortPartyRestriction
enum class EFortPartyRestriction : uint8_t
{
	Invalid                        = 0,
	PartyCreatePending             = 1,
	AlreadyInParty                 = 2,
	PartyFull                      = 3,
	GameFull                       = 4,
	Private                        = 5,
	CurrentlyNotAvailable          = 6,
	NotPlayingThisGame             = 7,
	GameModeRestricted             = 8,
	Max                            = 9
};


// Enum FortniteGame.EFortFriendRequestStatus
enum class EFortFriendRequestStatus : uint8_t
{
	None                           = 0,
	Accepted                       = 1,
	PendingReceived                = 2,
	PendingSent                    = 3,
	EFortFriendRequestStatus_MAX   = 4
};


// Enum FortniteGame.EFortPartyMemberLocation
enum class EFortPartyMemberLocation : uint8_t
{
	PreLobby                       = 0,
	ConnectingToLobby              = 1,
	Lobby                          = 2,
	JoiningGame                    = 3,
	ProcessingRejoin               = 4,
	InGame                         = 5,
	ReturningToFrontEnd            = 6,
	EFortPartyMemberLocation_MAX   = 7
};


// Enum FortniteGame.EFortPartyState
enum class EFortPartyState : uint8_t
{
	Undetermined                   = 0,
	WorldView                      = 1,
	TheaterView                    = 2,
	Matchmaking                    = 3,
	PostMatchmaking                = 4,
	ReturningToFrontEnd            = 5,
	BattleRoyaleView               = 6,
	BattleRoyalePreloading         = 7,
	BattleRoyaleMatchmaking        = 8,
	BattleRoyalePostMatchmaking    = 9,
	EFortPartyState_MAX            = 10
};


// Enum FortniteGame.EFortPartyMemberDisplayState
enum class EFortPartyMemberDisplayState : uint8_t
{
	Open                           = 0,
	Connecting                     = 1,
	Connected                      = 2,
	Max                            = 3
};


// Enum FortniteGame.EFortPartyTransition
enum class EFortPartyTransition : uint8_t
{
	Idle                           = 0,
	Joining                        = 1,
	Leaving                        = 2,
	Max                            = 3
};


// Enum FortniteGame.EFortSocialItemHeaderType
enum class EFortSocialItemHeaderType : uint8_t
{
	PartyInvites                   = 0,
	Friends                        = 1,
	PlatformOnlyFriends            = 2,
	None                           = 3,
	EFortSocialItemHeaderType_MAX  = 4
};


// Enum FortniteGame.EFortDialogFeedbackType
enum class EFortDialogFeedbackType : uint8_t
{
	FriendRequestSent              = 0,
	FriendRequestReceived          = 1,
	FriendRequestAccepted          = 2,
	Default                        = 3,
	EFortDialogFeedbackType_MAX    = 4
};


// Enum FortniteGame.EFortEncounterDirection
enum class EFortEncounterDirection : uint8_t
{
	North                          = 0,
	NorthEast                      = 1,
	East                           = 2,
	SouthEast                      = 3,
	South                          = 4,
	SouthWest                      = 5,
	West                           = 6,
	NorthWest                      = 7,
	Max_None                       = 8,
	EFortEncounterDirection_MAX    = 9
};


// Enum FortniteGame.EAIHotSpotAssignmentFilter
enum class EAIHotSpotAssignmentFilter : uint8_t
{
	All                            = 0,
	WithSlots                      = 1,
	WaitingList                    = 2,
	EAIHotSpotAssignmentFilter_MAX = 3
};


// Enum FortniteGame.EAIHotSpotSlotFilter
enum class EAIHotSpotSlotFilter : uint8_t
{
	All                            = 0,
	AvailableOnly                  = 1,
	UnavailableOnly                = 2,
	EAIHotSpotSlotFilter_MAX       = 3
};


// Enum FortniteGame.EAIHotSpotSlot
enum class EAIHotSpotSlot : uint8_t
{
	Free                           = 0,
	Claimed                        = 1,
	Occupied                       = 2,
	Blocked                        = 3,
	Disabled                       = 4,
	EAIHotSpotSlot_MAX             = 5
};


// Enum FortniteGame.EBoundingBoxSlotDirectionCalculation
enum class EBoundingBoxSlotDirectionCalculation : uint8_t
{
	Auto                           = 0,
	FaceWall                       = 1,
	FaceAwayFromWall               = 2,
	FaceCenter                     = 3,
	EBoundingBoxSlotDirectionCalculation_MAX = 4
};


// Enum FortniteGame.EAthenaPlaylistFillType
enum class EAthenaPlaylistFillType : uint8_t
{
	NoFill                         = 0,
	OptionalFill_DefaultOff        = 1,
	OptionalFill_DefaultOn         = 2,
	MandatoryFill                  = 3,
	EAthenaPlaylistFillType_MAX    = 4
};


// Enum FortniteGame.EEventTokenType
enum class EEventTokenType : uint8_t
{
	Invite                         = 0,
	Creation                       = 1,
	EEventTokenType_MAX            = 2
};


// Enum FortniteGame.EAthenaQuickChatFilteringType
enum class EAthenaQuickChatFilteringType : uint8_t
{
	AlwaysVisible                  = 0,
	ActiveMaterial                 = 1,
	FacingPickup                   = 2,
	ActiveHotbarItem               = 3,
	ActiveHotbarItemAmmo           = 4,
	FacingPickupOrActiveHotbarItem = 5,
	NoWeaponEquippedRequiringAmmo  = 6,
	WeaponEquippedOfAmmoType       = 7,
	EAthenaQuickChatFilteringType_MAX = 8
};


// Enum FortniteGame.EAthenaSeasonRewardTrack
enum class EAthenaSeasonRewardTrack : uint8_t
{
	Invalid                        = 0,
	SeasonProgressionTrack         = 1,
	CompendiumFreeTrack            = 2,
	CompendiumPaidTrack            = 3,
	EAthenaSeasonRewardTrack_MAX   = 4
};


// Enum FortniteGame.EAthenaChallengeTabVisibility
enum class EAthenaChallengeTabVisibility : uint8_t
{
	Hide                           = 0,
	ShowAlways                     = 1,
	EAthenaChallengeTabVisibility_MAX = 2
};


// Enum FortniteGame.EAthenaSeasonShopVisibility
enum class EAthenaSeasonShopVisibility : uint8_t
{
	Hide                           = 0,
	ShowIfOffersAvailable          = 1,
	ShowAlways                     = 2,
	EAthenaSeasonShopVisibility_MAX = 3
};


// Enum FortniteGame.EScoreboardState
enum class EScoreboardState : uint8_t
{
	Default                        = 0,
	Irrelevant                     = 1,
	Dead                           = 2,
	Count                          = 3,
	EScoreboardState_MAX           = 4
};


// Enum FortniteGame.EAbilitySystemComponentCreationPolicy
enum class EAbilitySystemComponentCreationPolicy : uint8_t
{
	Never                          = 0,
	Lazy                           = 1,
	Always                         = 2,
	EAbilitySystemComponentCreationPolicy_MAX = 3
};


// Enum FortniteGame.EAttributeInitLevelSource
enum class EAttributeInitLevelSource : uint8_t
{
	WorldDifficulty                = 0,
	PlayerBuildingSkill            = 1,
	EAttributeInitLevelSource_MAX  = 2
};


// Enum FortniteGame.EDynamicBuildingPlacementType
enum class EDynamicBuildingPlacementType : uint8_t
{
	CountsTowardsBounds            = 0,
	DestroyIfColliding             = 1,
	DestroyAnythingThatCollides    = 2,
	EDynamicBuildingPlacementType_MAX = 3
};


// Enum FortniteGame.EUnlockRules
enum class EUnlockRules : uint8_t
{
	UR_Reset                       = 0,
	UR_MaintainState               = 1,
	UR_ResetDeactivate             = 2,
	UR_MAX                         = 3
};


// Enum FortniteGame.EContentionRules
enum class EContentionRules : uint8_t
{
	CR_MajorityWins                = 0,
	CR_OneTeamOnlyWins             = 1,
	CR_MAX                         = 2
};


// Enum FortniteGame.EBinaryToggleValues
enum class EBinaryToggleValues : uint8_t
{
	BTV_Active                     = 0,
	BTV_Inactive                   = 1,
	BTV_Either                     = 2,
	BTV_MAX                        = 3
};


// Enum FortniteGame.EAuxIndicatorStates
enum class EAuxIndicatorStates : uint8_t
{
	AIS_GuidingArrow               = 0,
	AIS_ConfirmedArrow             = 1,
	AIS_Inactive                   = 2,
	AIS_Active                     = 3,
	AIS_MAX                        = 4
};


// Enum FortniteGame.EFOBFileHeaderStatus
enum class EFOBFileHeaderStatus : uint8_t
{
	NoExistingFile                 = 0,
	HasExistingFile                = 1,
	UnableToDetermine              = 2,
	EFOBFileHeaderStatus_MAX       = 3
};


// Enum FortniteGame.EFOBInitStatus
enum class EFOBInitStatus : uint8_t
{
	Successful                     = 0,
	Failure_CloudStorageDisabled   = 1,
	Failure_PreviouslyInitialized  = 2,
	Failure_DataOwner              = 3,
	Failure_CloudStorageError      = 4,
	Failure_MissingFileName        = 5,
	Failure_Generic                = 6,
	EFOBInitStatus_MAX             = 7
};


// Enum FortniteGame.EFOBMode
enum class EFOBMode : uint8_t
{
	Uninitialized                  = 0,
	Creation                       = 1,
	Deployment                     = 2,
	EFOBMode_MAX                   = 3
};


// Enum FortniteGame.EBuildingFoundationType
enum class EBuildingFoundationType : uint8_t
{
	BFT_3x3                        = 0,
	BFT_5x5                        = 1,
	BFT_5x10                       = 2,
	BFT_None                       = 3,
	BFT_MAX                        = 4
};


// Enum FortniteGame.EFortItemCollectorTrackingType
enum class EFortItemCollectorTrackingType : uint8_t
{
	Player                         = 0,
	Team                           = 1,
	EFortItemCollectorTrackingType_MAX = 2
};


// Enum FortniteGame.EFortItemCollectorBehavior
enum class EFortItemCollectorBehavior : uint8_t
{
	FirstToGoal                    = 0,
	FreeForAll                     = 1,
	EFortItemCollectorBehavior_MAX = 2
};


// Enum FortniteGame.EFortItemCollectorState
enum class EFortItemCollectorState : uint8_t
{
	CanInteract                    = 0,
	Active                         = 1,
	Inactive                       = 2,
	Captured                       = 3,
	Invalid                        = 4,
	EFortItemCollectorState_MAX    = 5
};


// Enum FortniteGame.ELayoutRequirementStatus
enum class ELayoutRequirementStatus : uint8_t
{
	Inactive_Invisible             = 0,
	Active_Invisible               = 1,
	Active_Visible                 = 2,
	ELayoutRequirementStatus_MAX   = 3
};


// Enum FortniteGame.EFortRiftSlotStatus
enum class EFortRiftSlotStatus : uint8_t
{
	Reserved                       = 0,
	Occupied                       = 1,
	Max_None                       = 2,
	EFortRiftSlotStatus_MAX        = 3
};


// Enum FortniteGame.EBuildingNavObstacleType
enum class EBuildingNavObstacleType : uint8_t
{
	UnwalkableAll                  = 0,
	UnwalkableHuskOnly             = 1,
	SmashWhenLowHeight             = 2,
	SmashOnlyLowHeight             = 3,
	SmashSmasherOnly               = 4,
	SmashAll                       = 5,
	EBuildingNavObstacleType_MAX   = 6
};


// Enum FortniteGame.EFortDamageVisualsState
enum class EFortDamageVisualsState : uint8_t
{
	UnDamaged                      = 0,
	DamagedAndAnimating            = 1,
	DamagedAndStatic               = 2,
	EFortDamageVisualsState_MAX    = 3
};


// Enum FortniteGame.EStructuralSupportCheck
enum class EStructuralSupportCheck : uint8_t
{
	Stable                         = 0,
	Unstable                       = 1,
	Max_None                       = 2,
	EStructuralSupportCheck_MAX    = 3
};


// Enum FortniteGame.EBuildingReplacementType
enum class EBuildingReplacementType : uint8_t
{
	BRT_None                       = 0,
	BRT_Edited                     = 1,
	BRT_Conversion                 = 2,
	BRT_MAX                        = 3
};


// Enum FortniteGame.EPlacementType
enum class EPlacementType : uint8_t
{
	Free                           = 0,
	Grid                           = 1,
	None                           = 2,
	EPlacementType_MAX             = 3
};


// Enum FortniteGame.EBuildingAttachmentSide
enum class EBuildingAttachmentSide : uint8_t
{
	Front                          = 0,
	Back                           = 1,
	Any                            = 2,
	EBuildingAttachmentSide_MAX    = 3
};


// Enum FortniteGame.EBuildingAttachmentSlot
enum class EBuildingAttachmentSlot : uint8_t
{
	SLOT_Floor                     = 0,
	SLOT_Wall                      = 1,
	SLOT_Ceiling                   = 2,
	SLOT_None                      = 3,
	SLOT_MAX                       = 4
};


// Enum FortniteGame.EBuildingAnim
enum class EBuildingAnim : uint8_t
{
	EBA_None                       = 0,
	EBA_Building                   = 1,
	EBA_Breaking                   = 2,
	EBA_Destruction                = 3,
	EBA_Placement                  = 4,
	EBA_DynamicLOD                 = 5,
	EBA_DynamicShrink              = 6,
	EBA_MAX                        = 7
};


// Enum FortniteGame.EStructuralFloorPosition
enum class EStructuralFloorPosition : uint8_t
{
	Top                            = 0,
	Bottom                         = 1,
	EStructuralFloorPosition_MAX   = 2
};


// Enum FortniteGame.EStructuralWallPosition
enum class EStructuralWallPosition : uint8_t
{
	Left                           = 0,
	Right                          = 1,
	Front                          = 2,
	Back                           = 3,
	EStructuralWallPosition_MAX    = 4
};


// Enum FortniteGame.EFortDefenderInteractionError
enum class EFortDefenderInteractionError : uint8_t
{
	None                           = 0,
	Obstructed                     = 1,
	NoEditPermission               = 2,
	UsedByAnotherPlayer            = 3,
	EFortDefenderInteractionError_MAX = 4
};


// Enum FortniteGame.EFortBounceType
enum class EFortBounceType : uint8_t
{
	Hit                            = 0,
	Interact                       = 1,
	EditPlaced                     = 2,
	EFortBounceType_MAX            = 3
};


// Enum FortniteGame.EBuildingHighlightType
enum class EBuildingHighlightType : uint8_t
{
	Primary                        = 0,
	Interact                       = 1,
	WillBeDestroyed                = 2,
	Quest                          = 3,
	MAX_None                       = 4,
	EBuildingHighlightType_MAX     = 5
};


// Enum FortniteGame.EFortConnectivityCubeFace
enum class EFortConnectivityCubeFace : uint8_t
{
	Front                          = 0,
	Left                           = 1,
	Back                           = 2,
	Right                          = 3,
	Upper                          = 4,
	Lower                          = 5,
	MAX                            = 6
};


// Enum FortniteGame.EFortDecoPlacementQueryResults
enum class EFortDecoPlacementQueryResults : uint8_t
{
	CanAdd                         = 0,
	ExistingTrap                   = 1,
	ExistingObject                 = 2,
	Obstructed                     = 3,
	NoLocation                     = 4,
	WrongType                      = 5,
	WrongShape                     = 6,
	BeingModified                  = 7,
	WrongTeam                      = 8,
	BlueprintFailure               = 9,
	AbilityFailure                 = 10,
	RequiresPlayerBuildableActor   = 11,
	NoEditPermission               = 12,
	EFortDecoPlacementQueryResults_MAX = 13
};


// Enum FortniteGame.EFortStructuralGridQueryResults
enum class EFortStructuralGridQueryResults : uint8_t
{
	CanAdd                         = 0,
	ExistingActor                  = 1,
	Obstructed                     = 2,
	NoStructuralSupport            = 3,
	InvalidActor                   = 4,
	ReachedLimit                   = 5,
	NoEditPermission               = 6,
	PatternNotPermittedByLayoutRequirement = 7,
	ResourceTypeNotPermittedByLayoutRequirement = 8,
	BuildingAtRequirementsDisabled = 9,
	BuildingOtherThanRequirementsDisabled = 10,
	EFortStructuralGridQueryResults_MAX = 11
};


// Enum FortniteGame.EFortCostInfoTypes
enum class EFortCostInfoTypes : uint8_t
{
	Placement                      = 0,
	Repair                         = 1,
	Conversion                     = 2,
	Ability                        = 3,
	None                           = 4,
	EFortCostInfoTypes_MAX         = 5
};


// Enum FortniteGame.EFortBuildingInitializationReason
enum class EFortBuildingInitializationReason : uint8_t
{
	StaticallyPlaced               = 0,
	Spawned                        = 1,
	Replaced                       = 2,
	LoadedFromSave                 = 3,
	DynamicBuilderPlaced           = 4,
	PlacementTool                  = 5,
	TrapTool                       = 6,
	Replay                         = 7,
	None                           = 8,
	EFortBuildingInitializationReason_MAX = 9
};


// Enum FortniteGame.EFortBuildingPersistentState
enum class EFortBuildingPersistentState : uint8_t
{
	Default                        = 0,
	New                            = 1,
	Constructed                    = 2,
	Destroyed                      = 3,
	Searched                       = 4,
	None                           = 5,
	EFortBuildingPersistentState_MAX = 6
};


// Enum FortniteGame.EFortBuildingState
enum class EFortBuildingState : uint8_t
{
	Placement                      = 0,
	EditMode                       = 1,
	None                           = 2,
	EFortBuildingState_MAX         = 3
};


// Enum FortniteGame.EFortResourceLevel
enum class EFortResourceLevel : uint8_t
{
	First                          = 0,
	Second                         = 1,
	Third                          = 2,
	Fourth                         = 3,
	Fifth                          = 4,
	Sixth                          = 5,
	NumLevels                      = 6,
	Invalid                        = 7,
	EFortResourceLevel_MAX         = 8
};


// Enum FortniteGame.EFortResourceType
enum class EFortResourceType : uint8_t
{
	Wood                           = 0,
	Stone                          = 1,
	Metal                          = 2,
	Permanite                      = 3,
	None                           = 4,
	EFortResourceType_MAX          = 5
};


// Enum FortniteGame.EFortTextureDataSlot
enum class EFortTextureDataSlot : uint8_t
{
	Primary                        = 0,
	Secondary                      = 1,
	Tertiary                       = 2,
	Fourth                         = 3,
	NumSlots                       = 4,
	EFortTextureDataSlot_MAX       = 5
};


// Enum FortniteGame.EFortTextureDataType
enum class EFortTextureDataType : uint8_t
{
	Any                            = 0,
	OuterWall                      = 1,
	InnerWall                      = 2,
	Corner                         = 3,
	Floor                          = 4,
	Ceiling                        = 5,
	Trim                           = 6,
	Roof                           = 7,
	Pillar                         = 8,
	Shingle                        = 9,
	None                           = 10,
	EFortTextureDataType_MAX       = 11
};


// Enum FortniteGame.EBuildingAttachmentType
enum class EBuildingAttachmentType : uint8_t
{
	ATTACH_Floor                   = 0,
	ATTACH_Wall                    = 1,
	ATTACH_Ceiling                 = 2,
	ATTACH_Corner                  = 3,
	ATTACH_All                     = 4,
	ATTACH_WallThenFloor           = 5,
	ATTACH_None                    = 6,
	ATTACH_MAX                     = 7
};


// Enum FortniteGame.EFortBuildingType
enum class EFortBuildingType : uint8_t
{
	Wall                           = 0,
	Floor                          = 1,
	Corner                         = 2,
	Deco                           = 3,
	Prop                           = 4,
	Stairs                         = 5,
	Roof                           = 6,
	Pillar                         = 7,
	SpawnedItem                    = 8,
	Container                      = 9,
	Trap                           = 10,
	GenericCenterCellActor         = 11,
	None                           = 12,
	EFortBuildingType_MAX          = 13
};


// Enum FortniteGame.EAccessoryColorName
enum class EAccessoryColorName : uint8_t
{
	EAccessoryColorName_AccessoryColor1 = 0,
	EAccessoryColorName_AccessoryColor2 = 1,
	EAccessoryColorName_AccessoryColor3 = 2,
	EAccessoryColorName_NumTypes   = 3,
	EAccessoryColorName_MAX        = 4
};


// Enum FortniteGame.ECustomHatType
enum class ECustomHatType : uint8_t
{
	ECustomHatType_None            = 0,
	ECustomHatType_Cap             = 1,
	ECustomHatType_Helmet          = 2,
	ECustomHatType_Mask            = 3,
	ECustomHatType_Hat             = 4,
	ECustomHatType_HeadReplacement = 5,
	ECustomHatType_MAX             = 6
};


// Enum FortniteGame.EClothingColorName
enum class EClothingColorName : uint8_t
{
	EClothingColorName_AccessoryColor1 = 0,
	EClothingColorName_AccessoryColor2 = 1,
	EClothingColorName_NumTypes    = 2,
	EClothingColorName_MAX         = 3
};


// Enum FortniteGame.EColorSwatchType
enum class EColorSwatchType : uint8_t
{
	EColorSwatchType_Skin          = 0,
	EColorSwatchType_Hair          = 1,
	EColorSwatchType_BodyAccessory = 2,
	EColorSwatchType_Accessory     = 3,
	EColorSwatchType_NumTypes      = 4,
	EColorSwatchType_MAX           = 5
};


// Enum FortniteGame.ECharacterColorSwatchType
enum class ECharacterColorSwatchType : uint8_t
{
	ECharacterColorSwatchType_Skin = 0,
	ECharacterColorSwatchType_Hair = 1,
	ECharacterColorSwatchType_NumTypes = 2,
	ECharacterColorSwatchType_MAX  = 3
};


// Enum FortniteGame.EDeployableBaseConstructionStatus
enum class EDeployableBaseConstructionStatus : uint8_t
{
	Constructing                   = 0,
	Destroying                     = 1,
	Finished                       = 2,
	EDeployableBaseConstructionStatus_MAX = 3
};


// Enum FortniteGame.EDeployableBaseBuildingState
enum class EDeployableBaseBuildingState : uint8_t
{
	Empty                          = 0,
	Built                          = 1,
	Unoccupied                     = 2,
	WaitingToBuild                 = 3,
	Building                       = 4,
	WaitingToDestroy               = 5,
	Destroying                     = 6,
	WaitingToReset                 = 7,
	Resetting                      = 8,
	EDeployableBaseBuildingState_MAX = 9
};


// Enum FortniteGame.EDeployableBaseBoxType
enum class EDeployableBaseBoxType : uint8_t
{
	BuildSpace                     = 0,
	SaveSpace                      = 1,
	PlotSpace                      = 2,
	NumSpaceTypes                  = 3,
	EDeployableBaseBoxType_MAX     = 4
};


// Enum FortniteGame.EFortStatDisplayType
enum class EFortStatDisplayType : uint8_t
{
	Category                       = 0,
	Buff                           = 1,
	Debuff                         = 2,
	Neutral                        = 3,
	DoNotDisplay                   = 4,
	EFortStatDisplayType_MAX       = 5
};


// Enum FortniteGame.EFortAbilityTargetSelectionUsage
enum class EFortAbilityTargetSelectionUsage : uint8_t
{
	BothTargetingAndCanHit         = 0,
	OnlyTargeting                  = 1,
	OnlyCanHit                     = 2,
	EFortAbilityTargetSelectionUsage_MAX = 3
};


// Enum FortniteGame.EFortDirectedMovementSpace
enum class EFortDirectedMovementSpace : uint8_t
{
	WorldSpace                     = 0,
	ActorLocRelative               = 1,
	ActorLocRotRelative            = 2,
	CameraRelative                 = 3,
	EFortDirectedMovementSpace_MAX = 4
};


// Enum FortniteGame.EFortProximityBasedGEApplicationType
enum class EFortProximityBasedGEApplicationType : uint8_t
{
	ApplyOnProximityPulse          = 0,
	ApplyOnProximityTouch          = 1,
	ApplyOnlyDuringProximityTouch  = 2,
	EFortProximityBasedGEApplicationType_MAX = 3
};


// Enum FortniteGame.EFortDeliveryInfoBuildingActorSpecification
enum class EFortDeliveryInfoBuildingActorSpecification : uint8_t
{
	All                            = 0,
	PlayerBuildable                = 1,
	NonPlayerBuildable             = 2,
	EFortDeliveryInfoBuildingActorSpecification_MAX = 3
};


// Enum FortniteGame.EFortEncounterUtilityDesire
enum class EFortEncounterUtilityDesire : uint8_t
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	VeryHigh                       = 3,
	Max_None                       = 4,
	EFortEncounterUtilityDesire_MAX = 5
};


// Enum FortniteGame.EFortAIDirectorFactorContribution
enum class EFortAIDirectorFactorContribution : uint8_t
{
	Direct                         = 0,
	Inverse                        = 1,
	EFortAIDirectorFactorContribution_MAX = 2
};


// Enum FortniteGame.EFortAIDirectorEventContribution
enum class EFortAIDirectorEventContribution : uint8_t
{
	Increment                      = 0,
	Set                            = 1,
	EFortAIDirectorEventContribution_MAX = 2
};


// Enum FortniteGame.EFortAIWaveProgressSection
enum class EFortAIWaveProgressSection : uint8_t
{
	SectionOne                     = 0,
	SectionTwo                     = 1,
	Max_None                       = 2,
	EFortAIWaveProgressSection_MAX = 3
};


// Enum FortniteGame.EFortEncounterState
enum class EFortEncounterState : uint8_t
{
	Uninitialized                  = 0,
	InitializingProperties         = 1,
	InitializingRiftManager        = 2,
	AwaitingActivation             = 3,
	Active                         = 4,
	Max_None                       = 5,
	EFortEncounterState_MAX        = 6
};


// Enum FortniteGame.EFortEncounterPacingState
enum class EFortEncounterPacingState : uint8_t
{
	Ramp                           = 0,
	Peak                           = 1,
	Fade                           = 2,
	Rest                           = 3,
	Max_None                       = 4,
	EFortEncounterPacingState_MAX  = 5
};


// Enum FortniteGame.EFortEncounterSequenceResult
enum class EFortEncounterSequenceResult : uint8_t
{
	Success                        = 0,
	FailedEncounterInProgress      = 1,
	EFortEncounterSequenceResult_MAX = 2
};


// Enum FortniteGame.EAssignmentCreationResult
enum class EAssignmentCreationResult : uint8_t
{
	AssignmentNotFoundOrCreated    = 0,
	AssignmentCreated              = 1,
	AssignmentFound                = 2,
	EAssignmentCreationResult_MAX  = 3
};


// Enum FortniteGame.ETagGoalScoringCategory
enum class ETagGoalScoringCategory : uint8_t
{
	Ignore                         = 0,
	HighInterest                   = 1,
	NumCategories                  = 2,
	ETagGoalScoringCategory_MAX    = 3
};


// Enum FortniteGame.EFortAIPawnGender
enum class EFortAIPawnGender : uint8_t
{
	FAPG_Default                   = 0,
	FAPG_Female                    = 1,
	FAPG_Male                      = 2,
	FAPG_MAX                       = 3
};


// Enum FortniteGame.EFortAILevelRatingDisplayType
enum class EFortAILevelRatingDisplayType : uint8_t
{
	DisplayRatingBasedOnDifficulty = 0,
	DisplayAIDifficultyAsRating    = 1,
	DontDisplayRating              = 2,
	EFortAILevelRatingDisplayType_MAX = 3
};


// Enum FortniteGame.EFortressAIType
enum class EFortressAIType : uint8_t
{
	FAT_Dormant                    = 0,
	FAT_Cleaner                    = 1,
	FAT_DayWanderer                = 2,
	FAT_NightWanderer              = 3,
	FAT_DebugOnly                  = 4,
	FAT_Encounter                  = 5,
	FAT_MAX                        = 6
};


// Enum FortniteGame.ECorePerceptionTypes
enum class ECorePerceptionTypes : uint8_t
{
	Sight                          = 0,
	Hearing                        = 1,
	Damage                         = 2,
	Touch                          = 3,
	Team                           = 4,
	Prediction                     = 5,
	MAX                            = 6
};


// Enum FortniteGame.ENavigationObstacleOverride
enum class ENavigationObstacleOverride : uint8_t
{
	UseMeshSettings                = 0,
	ForceEnabled                   = 1,
	ForceDisabled                  = 2,
	ENavigationObstacleOverride_MAX = 3
};


// Enum FortniteGame.EFortPartialPathUsage
enum class EFortPartialPathUsage : uint8_t
{
	Always                         = 0,
	OnlyGoalsOnDestructible        = 1,
	Never                          = 2,
	EFortPartialPathUsage_MAX      = 3
};


// Enum FortniteGame.EHotspotTypeConfigMode
enum class EHotspotTypeConfigMode : uint8_t
{
	AlwaysAdd                      = 0,
	WhenNotDefined                 = 1,
	WhenNotValid                   = 2,
	EHotspotTypeConfigMode_MAX     = 3
};


// Enum FortniteGame.EFortHotSpotPreview
enum class EFortHotSpotPreview : uint8_t
{
	None                           = 0,
	Smashing                       = 1,
	Shooting                       = 2,
	EFortHotSpotPreview_MAX        = 3
};


// Enum FortniteGame.EFortHotSpotDirection
enum class EFortHotSpotDirection : uint8_t
{
	PositiveX                      = 0,
	NegativeX                      = 1,
	PositiveY                      = 2,
	NegativeY                      = 3,
	PositiveZ                      = 4,
	NegativeZ                      = 5,
	Any                            = 6,
	EFortHotSpotDirection_MAX      = 7
};


// Enum FortniteGame.EFortHotSpotSlot
enum class EFortHotSpotSlot : uint8_t
{
	Melee                          = 0,
	MeleeHuge                      = 1,
	Ranged                         = 2,
	None                           = 3,
	EFortHotSpotSlot_MAX           = 4
};


// Enum FortniteGame.EBuildingFloorRailing
enum class EBuildingFloorRailing : uint8_t
{
	None                           = 0,
	Balcony                        = 1,
	EBuildingFloorRailing_MAX      = 2
};


// Enum FortniteGame.EBuildingStairsRailing
enum class EBuildingStairsRailing : uint8_t
{
	None                           = 0,
	Partial                        = 1,
	Full                           = 2,
	EBuildingStairsRailing_MAX     = 3
};


// Enum FortniteGame.EBuildingWallArea
enum class EBuildingWallArea : uint8_t
{
	Regular                        = 0,
	Flat                           = 1,
	Special                        = 2,
	EBuildingWallArea_MAX          = 3
};


// Enum FortniteGame.EAssignmentType
enum class EAssignmentType : uint8_t
{
	Invalid                        = 0,
	Encounter                      = 1,
	World                          = 2,
	Enemy                          = 3,
	NumAssignmentTypes             = 4,
	EAssignmentType_MAX            = 5
};


// Enum FortniteGame.EFortAILODLevel
enum class EFortAILODLevel : uint8_t
{
	Invalid                        = 0,
	Lowest                         = 1,
	Lower                          = 2,
	BelowNormal                    = 3,
	Normal                         = 4,
	AboveNormal                    = 5,
	EFortAILODLevel_MAX            = 6
};


// Enum FortniteGame.ESkydivingDirection
enum class ESkydivingDirection : uint8_t
{
	Center                         = 0,
	Right                          = 1,
	Left                           = 2,
	Forward                        = 3,
	Back                           = 4,
	ESkydivingDirection_MAX        = 5
};


// Enum FortniteGame.ESpeedWarpingAxisMode
enum class ESpeedWarpingAxisMode : uint8_t
{
	IKFootRootLocalX               = 0,
	IKFootRootLocalY               = 1,
	IKFootRootLocalZ               = 2,
	WorldSpaceVectorInput          = 3,
	ComponentSpaceVectorInput      = 4,
	ActorSpaceVectorInput          = 5,
	ESpeedWarpingAxisMode_MAX      = 6
};


// Enum FortniteGame.EMontageInterrupt
enum class EMontageInterrupt : uint8_t
{
	Any                            = 0,
	RootMotionOnly                 = 1,
	None                           = 2,
	EMontageInterrupt_MAX          = 3
};


// Enum FortniteGame.EFortAttributeDisplay
enum class EFortAttributeDisplay : uint8_t
{
	BasicInt                       = 0,
	NegativeImpliesInfiniteInt     = 1,
	BasicFloat                     = 2,
	NegativeImpliesInfiniteFloat   = 3,
	BasicString                    = 4,
	NormalizedPercentage           = 5,
	StringArray                    = 6,
	SlateBrush                     = 7,
	DoNotDisplay                   = 8,
	None_Max                       = 9,
	EFortAttributeDisplay_MAX      = 10
};


// Enum FortniteGame.ETargetDistanceComparisonType
enum class ETargetDistanceComparisonType : uint8_t
{
	TwoDimensions                  = 0,
	ThreeDimensions                = 1,
	CollisionHalfHeightMultiplier  = 2,
	ETargetDistanceComparisonType_MAX = 3
};


// Enum FortniteGame.ECameraOrigin
enum class ECameraOrigin : uint8_t
{
	ViewTargetTransform            = 0,
	BoneTransform                  = 1,
	ECameraOrigin_MAX              = 2
};


// Enum FortniteGame.EChallengeBundleVisualStyle
enum class EChallengeBundleVisualStyle : uint8_t
{
	Normal                         = 0,
	BattlePassFree                 = 1,
	BattlePassPaid                 = 2,
	BattlePassWeekly               = 3,
	EChallengeBundleVisualStyle_MAX = 4
};


// Enum FortniteGame.EChallengeScheduleUnlockType
enum class EChallengeScheduleUnlockType : uint8_t
{
	Manually                       = 0,
	OnScheduleGranted              = 1,
	DaysSinceEventStart            = 2,
	EChallengeScheduleUnlockType_MAX = 3
};


// Enum FortniteGame.EFortCharacterCosmetic
enum class EFortCharacterCosmetic : uint8_t
{
	Head                           = 0,
	Texture                        = 1,
	Color                          = 2,
	Trinket                        = 3,
	Face                           = 4,
	Gadget                         = 5,
	Body                           = 6,
	ClassFlair                     = 7,
	Max_Invalid                    = 8,
	EFortCharacterCosmetic_MAX     = 9
};


// Enum FortniteGame.EFortCustomMovement
enum class EFortCustomMovement : uint8_t
{
	Default                        = 0,
	Driving                        = 1,
	Passenger                      = 2,
	Parachuting                    = 3,
	Skydiving                      = 4,
	Hover                          = 5,
	RemoteControl_Flying           = 6,
	EFortCustomMovement_MAX        = 7
};


// Enum FortniteGame.EFortAnnouncementDisplayPreference
enum class EFortAnnouncementDisplayPreference : uint8_t
{
	Default_HUD                    = 0,
	QuestIntroduction              = 1,
	QuestJournal                   = 2,
	EFortAnnouncementDisplayPreference_MAX = 3
};


// Enum FortniteGame.EFortAnnouncementChannel
enum class EFortAnnouncementChannel : uint8_t
{
	Primary                        = 0,
	Conversation                   = 1,
	Tutorial                       = 2,
	Max_None                       = 3,
	EFortAnnouncementChannel_MAX   = 4
};


// Enum FortniteGame.EFortAnnouncementDelivery
enum class EFortAnnouncementDelivery : uint8_t
{
	Created                        = 0,
	Received                       = 1,
	Ignored                        = 2,
	Active                         = 3,
	Stopped                        = 4,
	Max_None                       = 5,
	EFortAnnouncementDelivery_MAX  = 6
};


// Enum FortniteGame.EColorBlindMode
enum class EColorBlindMode : uint8_t
{
	Off                            = 0,
	Deuteranope                    = 1,
	Protanope                      = 2,
	Tritanope                      = 3,
	EColorBlindMode_MAX            = 4
};


// Enum FortniteGame.ECloudFileState
enum class ECloudFileState : uint8_t
{
	Unitialized                    = 0,
	Saving                         = 1,
	Loading                        = 2,
	Idle                           = 3,
	ECloudFileState_MAX            = 4
};


// Enum FortniteGame.ECodeTokenPlatform
enum class ECodeTokenPlatform : uint8_t
{
	PC                             = 0,
	PS4                            = 1,
	XBOX                           = 2,
	ECodeTokenPlatform_MAX         = 3
};


// Enum FortniteGame.EFortCollectionBookState
enum class EFortCollectionBookState : uint8_t
{
	Active                         = 0,
	Completed                      = 1,
	Claimed                        = 2,
	EFortCollectionBookState_MAX   = 3
};


// Enum FortniteGame.EFortPIDValueGraphElements
enum class EFortPIDValueGraphElements : uint8_t
{
	Proportional                   = 0,
	Integral                       = 1,
	Max_None                       = 2,
	EFortPIDValueGraphElements_MAX = 3
};


// Enum FortniteGame.EFortIntensityGraphElements
enum class EFortIntensityGraphElements : uint8_t
{
	ActualIntensity                = 0,
	DesiredIntensity               = 1,
	Max_None                       = 2,
	EFortIntensityGraphElements_MAX = 3
};


// Enum FortniteGame.EFortContributionGraphElements
enum class EFortContributionGraphElements : uint8_t
{
	ProportionalLine               = 0,
	IntegralLine                   = 1,
	TotalLine                      = 2,
	PendingLine                    = 3,
	ActionLine                     = 4,
	Max_None                       = 5,
	EFortContributionGraphElements_MAX = 6
};


// Enum FortniteGame.EFortFactorContributionType
enum class EFortFactorContributionType : uint8_t
{
	CurrentValue_Direct            = 0,
	CurrentValue_Inverse           = 1,
	AverageValue_Direct            = 2,
	AverageValue_Inverse           = 3,
	EFortFactorContributionType_MAX = 4
};


// Enum FortniteGame.EFortAIDirectorFactor
enum class EFortAIDirectorFactor : uint8_t
{
	PlayerDamageThreat             = 0,
	ObjectiveDamageThreat          = 1,
	ObjectivePathCost              = 2,
	PlayerPathCost                 = 3,
	PlayerMovement                 = 4,
	TrapsEffective                 = 5,
	PlayerWander                   = 6,
	NearbyEnemyPresence            = 7,
	OffensiveResources             = 8,
	DefensiveResources             = 9,
	Boredom                        = 10,
	ArtilleryVulnerability         = 11,
	Max_None                       = 12,
	EFortAIDirectorFactor_MAX      = 13
};


// Enum FortniteGame.EFortCombatFactors
enum class EFortCombatFactors : uint8_t
{
	PlayerDamageThreat             = 0,
	ObjectiveDamageThreat          = 1,
	ObjectivePathCost              = 2,
	PlayerPathCost                 = 3,
	PlayerMovement                 = 4,
	TrapsEffective                 = 5,
	PlayerWander                   = 6,
	NearbyEnemyPresence            = 7,
	OffensiveResources             = 8,
	DefensiveResources             = 9,
	Boredom                        = 10,
	ArtilleryVulnerability         = 11,
	Max_None                       = 12,
	EFortCombatFactors_MAX         = 13
};


// Enum FortniteGame.EFortCombatEvents
enum class EFortCombatEvents : uint8_t
{
	HuskFollowing                  = 0,
	SmasherFollowing               = 1,
	TrollFollowing                 = 2,
	TakerFollowing                 = 3,
	PlayerTakeDamage               = 4,
	PlayerHealth                   = 5,
	PlayerLookAtEnemy              = 6,
	PlayerDamageEnemy              = 7,
	PlayerKilledEnemy              = 8,
	AtlasTakeDamage                = 9,
	AtlasHealth                    = 10,
	AtlasDestroyed                 = 11,
	TrapFiring                     = 12,
	BuildingTakeDamage             = 13,
	FoodHealingPotential           = 14,
	PlayerAmmo                     = 15,
	EnemiesNear                    = 16,
	PlayerMovement                 = 17,
	BuildingDamagedNearObjective   = 18,
	TrapDamageEnemy                = 19,
	ObjectivePathCost              = 20,
	PlayerPathCost                 = 21,
	Max_None                       = 22,
	EFortCombatEvents_MAX          = 23
};


// Enum FortniteGame.EFortAIDirectorEventParticipant
enum class EFortAIDirectorEventParticipant : uint8_t
{
	Target                         = 0,
	Source                         = 1,
	Either                         = 2,
	Max_None                       = 3,
	EFortAIDirectorEventParticipant_MAX = 4
};


// Enum FortniteGame.EFortCombatThresholds
enum class EFortCombatThresholds : uint8_t
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Extreme                        = 3,
	Max_None                       = 4,
	EFortCombatThresholds_MAX      = 5
};


// Enum FortniteGame.EFortElementalDamageType
enum class EFortElementalDamageType : uint8_t
{
	None                           = 0,
	Fire                           = 1,
	Ice                            = 2,
	Lightning                      = 3,
	Energy                         = 4,
	MAX                            = 5
};


// Enum FortniteGame.EFortDamageZone
enum class EFortDamageZone : uint8_t
{
	Light                          = 0,
	Normal                         = 1,
	Critical                       = 2,
	Vulnerability                  = 3,
	Max                            = 4
};


// Enum FortniteGame.EFortBaseWeaponDamage
enum class EFortBaseWeaponDamage : uint8_t
{
	Combat                         = 0,
	Environmental                  = 1,
	EFortBaseWeaponDamage_MAX      = 2
};


// Enum FortniteGame.EFortWeaponCoreAnimation
enum class EFortWeaponCoreAnimation : uint8_t
{
	Melee                          = 0,
	Pistol                         = 1,
	Shotgun                        = 2,
	PaperBlueprint                 = 3,
	Rifle                          = 4,
	MeleeOneHand                   = 5,
	MachinePistol                  = 6,
	RocketLauncher                 = 7,
	GrenadeLauncher                = 8,
	GoingCommando                  = 9,
	AssaultRifle                   = 10,
	TacticalShotgun                = 11,
	SniperRifle                    = 12,
	TrapPlacement                  = 13,
	ShoulderLauncher               = 14,
	AbilityDecoTool                = 15,
	Crossbow                       = 16,
	C4                             = 17,
	RemoteControl                  = 18,
	DualWield                      = 19,
	MAX                            = 20
};


// Enum FortniteGame.EFortReloadFXState
enum class EFortReloadFXState : uint8_t
{
	ReloadStart                    = 0,
	ReloadCartridge                = 1,
	ReloadEnd                      = 2,
	Max_None                       = 3,
	EFortReloadFXState_MAX         = 4
};


// Enum FortniteGame.EFortWeaponSoundChannel
enum class EFortWeaponSoundChannel : uint8_t
{
	NormalA                        = 0,
	NormalB                        = 1,
	LowAmmo                        = 2,
	Degraded                       = 3,
	Max_None                       = 4,
	EFortWeaponSoundChannel_MAX    = 5
};


// Enum FortniteGame.EFortWeaponSoundState
enum class EFortWeaponSoundState : uint8_t
{
	Normal                         = 0,
	LowAmmo                        = 1,
	Degraded                       = 2,
	Max_None                       = 3,
	EFortWeaponSoundState_MAX      = 4
};


// Enum FortniteGame.EFortMontageInputType
enum class EFortMontageInputType : uint8_t
{
	WindowClickOrHold              = 0,
	WindowHoldOnly                 = 1,
	InstantClick                   = 2,
	EFortMontageInputType_MAX      = 3
};


// Enum FortniteGame.EFortAbilityTargetingSource
enum class EFortAbilityTargetingSource : uint8_t
{
	Camera                         = 0,
	PawnForward                    = 1,
	PawnTowardsFocus               = 2,
	WeaponForward                  = 3,
	WeaponTowardsFocus             = 4,
	Custom                         = 5,
	Max_None                       = 6,
	EFortAbilityTargetingSource_MAX = 7
};


// Enum FortniteGame.EFortAmmoType
enum class EFortAmmoType : uint8_t
{
	Pistol                         = 0,
	Shotgun                        = 1,
	Assault                        = 2,
	Sniper                         = 3,
	Energy                         = 4,
	EFortAmmoType_MAX              = 5
};


// Enum FortniteGame.EFortSentenceAudioPreference
enum class EFortSentenceAudioPreference : uint8_t
{
	AudioAsset                     = 0,
	FeedbackBank                   = 1,
	EFortSentenceAudioPreference_MAX = 2
};


// Enum FortniteGame.EFortDamageNumberType
enum class EFortDamageNumberType : uint8_t
{
	None                           = 0,
	Pawn                           = 1,
	Building                       = 2,
	Player                         = 3,
	Shield                         = 4,
	Score                          = 5,
	DBNO                           = 6,
	EFortDamageNumberType_MAX      = 7
};


// Enum FortniteGame.ETimespanAsTextFormat
enum class ETimespanAsTextFormat : uint8_t
{
	DaysHoursMinutesSeconds        = 0,
	Colons                         = 1,
	Approximate                    = 2,
	ETimespanAsTextFormat_MAX      = 3
};


// Enum FortniteGame.EFortDefenderSubtype
enum class EFortDefenderSubtype : uint8_t
{
	AssaultRifle                   = 0,
	Pistol                         = 1,
	Melee                          = 2,
	Sniper                         = 3,
	Shotgun                        = 4,
	Invalid                        = 5,
	EFortDefenderSubtype_MAX       = 6
};


// Enum FortniteGame.EHordeTierStartStatus
enum class EHordeTierStartStatus : uint8_t
{
	ReadyToStart                   = 0,
	WaitingForPlayer               = 1,
	WaitingForDBM                  = 2,
	GenericNotReadyToStart         = 3,
	EHordeTierStartStatus_MAX      = 4
};


// Enum FortniteGame.EHordeWaveStingerType
enum class EHordeWaveStingerType : uint8_t
{
	WaveSuccess                    = 0,
	WaveFailure                    = 1,
	WaveIncoming                   = 2,
	WaveStarted                    = 3,
	EHordeWaveStingerType_MAX      = 4
};


// Enum FortniteGame.EQueueActionType
enum class EQueueActionType : uint8_t
{
	Plot                           = 0,
	ZoneCleanup                    = 1,
	EnvironmentActorRestoration    = 2,
	EQueueActionType_MAX           = 3
};


// Enum FortniteGame.EAthenaPIEStartupMode
enum class EAthenaPIEStartupMode : uint8_t
{
	UseDefaults                    = 0,
	Warmup                         = 1,
	WarmupPaused                   = 2,
	Aircraft                       = 3,
	AircraftPaused                 = 4,
	Gameplay                       = 5,
	EAthenaPIEStartupMode_MAX      = 6
};


// Enum FortniteGame.FDynamicBuildOrder
enum class EFDynamicBuildOrder : uint8_t
{
	X                              = 0,
	Y                              = 1,
	Z                              = 2,
	None                           = 3,
	FDynamicBuildOrder_MAX         = 4
};


// Enum FortniteGame.EFortFeedbackBroadcastFilter
enum class EFortFeedbackBroadcastFilter : uint8_t
{
	FFBF_Speaker                   = 0,
	FFBF_SpeakerTeam               = 1,
	FFBF_SpeakerAdressee           = 2,
	FFBF_HumanPvP_Team1            = 3,
	FFBF_HumanPvP_Team2            = 4,
	FFBF_None_Max                  = 5,
	FFBF_MAX                       = 6
};


// Enum FortniteGame.EFortFeedbackSelectionMethod
enum class EFortFeedbackSelectionMethod : uint8_t
{
	FFSM_Instigator                = 0,
	FFSM_Recipient                 = 1,
	FFSM_TeamWitness               = 2,
	FFSM_EnemyWitness              = 3,
	FFSM_Random                    = 4,
	FFSM_Priority_IRTE             = 5,
	FFSM_AllPawns                  = 6,
	FFSM_Announcer                 = 7,
	FFSM_MAX                       = 8
};


// Enum FortniteGame.EFortFeedbackAddressee
enum class EFortFeedbackAddressee : uint8_t
{
	FFA_Instigator                 = 0,
	FFA_Recipient                  = 1,
	FFA_All                        = 2,
	FFA_MAX                        = 3
};


// Enum FortniteGame.EFortFeedbackContext
enum class EFortFeedbackContext : uint8_t
{
	FFC_Instigator                 = 0,
	FFC_Recipient                  = 1,
	FFC_TeamWitness                = 2,
	FFC_EnemyWitness               = 3,
	FFC_AllPawns                   = 4,
	FFC_Announcer                  = 5,
	FFC_None_Max                   = 6,
	FFC_MAX                        = 7
};


// Enum FortniteGame.EFortFootstepPosition
enum class EFortFootstepPosition : uint8_t
{
	Parallel                       = 0,
	Above                          = 1,
	Below                          = 2,
	AboveOrBelowAndVisible         = 3,
	Max_None                       = 4,
	EFortFootstepPosition_MAX      = 5
};


// Enum FortniteGame.EFortFootstepSurfaceType
enum class EFortFootstepSurfaceType : uint8_t
{
	Default                        = 0,
	Wood                           = 1,
	Stone                          = 2,
	Metal                          = 3,
	Water                          = 4,
	Snow                           = 5,
	Max_None                       = 6,
	EFortFootstepSurfaceType_MAX   = 7
};


// Enum FortniteGame.EFortFootstepAudioType
enum class EFortFootstepAudioType : uint8_t
{
	Crouch                         = 0,
	CrouchSprint                   = 1,
	Walk                           = 2,
	Sprint                         = 3,
	Jump                           = 4,
	Land                           = 5,
	LandHard                       = 6,
	Max_None                       = 7,
	EFortFootstepAudioType_MAX     = 8
};


// Enum FortniteGame.EWaveRules
enum class EWaveRules : uint8_t
{
	KillAllEnemies                 = 0,
	Timed                          = 1,
	KillPoints                     = 2,
	EWaveRules_MAX                 = 3
};


// Enum FortniteGame.EFriendFeedbackType
enum class EFriendFeedbackType : uint8_t
{
	FriendRequestSent              = 0,
	FriendRequestReceived          = 1,
	FriendRequestAccepted          = 2,
	Default                        = 3,
	EFriendFeedbackType_MAX        = 4
};


// Enum FortniteGame.EClampType
enum class EClampType : uint8_t
{
	Minimum                        = 0,
	Maximum                        = 1,
	EClampType_MAX                 = 2
};


// Enum FortniteGame.EFortAbilityCostSource
enum class EFortAbilityCostSource : uint8_t
{
	Stamina                        = 0,
	Durability                     = 1,
	AmmoMagazine                   = 2,
	AmmoPrimary                    = 3,
	Item                           = 4,
	EFortAbilityCostSource_MAX     = 5
};


// Enum FortniteGame.EFortGameplayAbilityActivation
enum class EFortGameplayAbilityActivation : uint8_t
{
	Passive                        = 0,
	Triggered                      = 1,
	Active                         = 2,
	EFortGameplayAbilityActivation_MAX = 3
};


// Enum FortniteGame.EFortAIWeaponUsage
enum class EFortAIWeaponUsage : uint8_t
{
	NoWeaponUsage                  = 0,
	UsesRangedWeapon               = 1,
	UsesMeleeWeapon                = 2,
	EFortAIWeaponUsage_MAX         = 3
};


// Enum FortniteGame.EFortGameplayAbilityMontageSectionToPlay
enum class EFortGameplayAbilityMontageSectionToPlay : uint8_t
{
	FirstSection                   = 0,
	RandomSection                  = 1,
	TestedRandomSection            = 2,
	EFortGameplayAbilityMontageSectionToPlay_MAX = 3
};


// Enum FortniteGame.EJumpBoostPackState
enum class EJumpBoostPackState : uint8_t
{
	Idle                           = 0,
	Boost                          = 1,
	Hovering                       = 2,
	Falling                        = 3,
	None                           = 4,
	EJumpBoostPackState_MAX        = 5
};


// Enum FortniteGame.EPvPGameEndReasons
enum class EPvPGameEndReasons : uint8_t
{
	PVPGER_TeamScoreLimit          = 0,
	PVPGER_LastManStanding         = 1,
	PVPGER_TimeExpired             = 2,
	PVPGER_MissionCompletion       = 3,
	PVPGER_MAX                     = 4
};


// Enum FortniteGame.EFortServerGameMode
enum class EFortServerGameMode : uint8_t
{
	Idle                           = 0,
	LobbyPvE                       = 1,
	LobbyPvP                       = 2,
	ZonePvP                        = 3,
	ZonePvE                        = 4,
	EFortServerGameMode_MAX        = 5
};


// Enum FortniteGame.EFortBanHammerNotificationAction
enum class EFortBanHammerNotificationAction : uint8_t
{
	DelayedBanAndKick              = 0,
	ImmediateBanAndKick            = 1,
	ImmediateKick                  = 2,
	EFortBanHammerNotificationAction_MAX = 3
};


// Enum FortniteGame.ETeamChatRoomState
enum class ETeamChatRoomState : uint8_t
{
	NotCreated                     = 0,
	Creating                       = 1,
	Created                        = 2,
	Timeout                        = 3,
	ETeamChatRoomState_MAX         = 4
};


// Enum FortniteGame.EAirCraftBehavior
enum class EAirCraftBehavior : uint8_t
{
	Default                        = 0,
	OpposingAirCraftForEachTeam    = 1,
	EAirCraftBehavior_MAX          = 2
};


// Enum FortniteGame.EAthenaAerialPhase
enum class EAthenaAerialPhase : uint8_t
{
	None                           = 0,
	BusCantExit                    = 1,
	BusCanExit                     = 2,
	Skydiving                      = 3,
	Parachuting                    = 4,
	EAthenaAerialPhase_MAX         = 5
};


// Enum FortniteGame.ESavedAccountType
enum class ESavedAccountType : uint8_t
{
	None                           = 0,
	Facebook                       = 1,
	Google                         = 2,
	Epic                           = 3,
	Device                         = 4,
	Headless                       = 5,
	Refresh                        = 6,
	ESavedAccountType_MAX          = 7
};


// Enum FortniteGame.EFortConsoleFPSMode
enum class EFortConsoleFPSMode : uint8_t
{
	Mode_30Fps                     = 0,
	Mode_30Fps_Unlocked            = 1,
	Mode_60Fps                     = 2,
	Mode_MAX                       = 3
};


// Enum FortniteGame.EFortGiftWrapType
enum class EFortGiftWrapType : uint8_t
{
	System                         = 0,
	UserFree                       = 1,
	UserUnlock                     = 2,
	UserConsumable                 = 3,
	EFortGiftWrapType_MAX          = 4
};


// Enum FortniteGame.EFortAccountLinkingUIConfig
enum class EFortAccountLinkingUIConfig : uint8_t
{
	Disabled                       = 0,
	Default                        = 1,
	ExternalViewerOnly             = 2,
	FullExternal                   = 3,
	EFortAccountLinkingUIConfig_MAX = 4
};


// Enum FortniteGame.EFortHelpContentLocation
enum class EFortHelpContentLocation : uint8_t
{
	Top                            = 0,
	Bottom                         = 1,
	Max                            = 2
};


// Enum FortniteGame.EFortHelpItemType
enum class EFortHelpItemType : uint8_t
{
	Header                         = 0,
	Entry                          = 1,
	Max                            = 2
};


// Enum FortniteGame.ESpecializationType
enum class ESpecializationType : uint8_t
{
	Tier1                          = 0,
	Tier2                          = 1,
	Tier3                          = 2,
	Tier4                          = 3,
	NumTiers                       = 4,
	ESpecializationType_MAX        = 5
};


// Enum FortniteGame.EFortSupportBonusType
enum class EFortSupportBonusType : uint8_t
{
	Normal                         = 0,
	Tactical                       = 1,
	Max_None                       = 2,
	EFortSupportBonusType_MAX      = 3
};


// Enum FortniteGame.EFortHexTileAdjacency
enum class EFortHexTileAdjacency : uint8_t
{
	North                          = 0,
	NorthEast                      = 1,
	SouthEast                      = 2,
	South                          = 3,
	SouthWest                      = 4,
	NorthWest                      = 5,
	Max_None                       = 6,
	EFortHexTileAdjacency_MAX      = 7
};


// Enum FortniteGame.EPrereqNodeType
enum class EPrereqNodeType : uint8_t
{
	Invalid                        = 0,
	SkillPoint                     = 1,
	ResearchPoint                  = 2,
	All                            = 3,
	EPrereqNodeType_MAX            = 4
};


// Enum FortniteGame.EFortHomebaseNodeActionType
enum class EFortHomebaseNodeActionType : uint8_t
{
	None                           = 0,
	DrillDown                      = 1,
	CollectResources               = 2,
	Max_None                       = 3,
	EFortHomebaseNodeActionType_MAX = 4
};


// Enum FortniteGame.EFortHomebaseNodeMagnitude
enum class EFortHomebaseNodeMagnitude : uint8_t
{
	Small                          = 0,
	Medium                         = 1,
	Large                          = 2,
	Max_None                       = 3,
	EFortHomebaseNodeMagnitude_MAX = 4
};


// Enum FortniteGame.EFortHomebaseNodeDisplayType
enum class EFortHomebaseNodeDisplayType : uint8_t
{
	Stat                           = 0,
	SquadSlot                      = 1,
	Gadget                         = 2,
	Inventory                      = 3,
	Hero                           = 4,
	ExitNode                       = 5,
	Max_None                       = 6,
	EFortHomebaseNodeDisplayType_MAX = 7
};


// Enum FortniteGame.ESquadSlotType
enum class ESquadSlotType : uint8_t
{
	HeroSquadPrimary               = 0,
	HeroSquadSupport               = 1,
	HeroSquadTactical              = 2,
	HeroSquadMissionDefender       = 3,
	SurvivorSquadLeadSurvivor      = 4,
	SurvivorSquadSurvivor          = 5,
	DefenderSquadMember            = 6,
	ExpeditionSquadMember          = 7,
	ESquadSlotType_MAX             = 8
};


// Enum FortniteGame.EFortHomebaseSquadSlotType
enum class EFortHomebaseSquadSlotType : uint8_t
{
	GroundSlot                     = 0,
	SupportSlot                    = 1,
	TacticalSlot                   = 2,
	Max_None                       = 3,
	EFortHomebaseSquadSlotType_MAX = 4
};


// Enum FortniteGame.EFortHomebaseSquadType
enum class EFortHomebaseSquadType : uint8_t
{
	AttributeSquad                 = 0,
	CombatSquad                    = 1,
	DefenderSquad                  = 2,
	ExpeditionSquad                = 3,
	Max_None                       = 4,
	EFortHomebaseSquadType_MAX     = 5
};


// Enum FortniteGame.EFortHuskAnimType
enum class EFortHuskAnimType : uint8_t
{
	Basic                          = 0,
	Dwarf                          = 1,
	BlasterBig                     = 2,
	Weak                           = 3,
	TinyHead                       = 4,
	Beehive                        = 5,
	Husky                          = 6,
	Sploder                        = 7,
	EFortHuskAnimType_MAX          = 8
};


// Enum FortniteGame.EFortInputGameMode
enum class EFortInputGameMode : uint8_t
{
	SaveTheWorld                   = 0,
	Athena                         = 1,
	EFortInputGameMode_MAX         = 2
};


// Enum FortniteGame.EFortIntensityCurveSequenceType
enum class EFortIntensityCurveSequenceType : uint8_t
{
	Sequence                       = 0,
	Loop                           = 1,
	Random                         = 2,
	Max_None                       = 3,
	EFortIntensityCurveSequenceType_MAX = 4
};


// Enum FortniteGame.TInteractionType
enum class ETInteractionType : uint8_t
{
	IT_NoInteraction               = 0,
	IT_Simple                      = 1,
	IT_LongPress                   = 2,
	IT_BuildingEdit                = 3,
	IT_BuildingImprovement         = 4,
	IT_TrapPlacement               = 5,
	IT_MAX                         = 6
};


// Enum FortniteGame.EItemEvolutionRestrictionReason
enum class EItemEvolutionRestrictionReason : uint8_t
{
	NoEvolutions                   = 0,
	BelowMaximumLevel              = 1,
	VaultOverflow                  = 2,
	MissingCatalyst                = 3,
	MissingCosts                   = 4,
	NoRarityUpgrade                = 5,
	InUseByCrafting                = 6,
	EItemEvolutionRestrictionReason_MAX = 7
};


// Enum FortniteGame.EItemUpgradeRestrictionReason
enum class EItemUpgradeRestrictionReason : uint8_t
{
	NoAdditionalLevels             = 0,
	MaximumLevelAchieved           = 1,
	VaultOverflow                  = 2,
	EItemUpgradeRestrictionReason_MAX = 3
};


// Enum FortniteGame.EFortTemplateAccess
enum class EFortTemplateAccess : uint8_t
{
	Normal                         = 0,
	Trusted                        = 1,
	Private                        = 2,
	EFortTemplateAccess_MAX        = 3
};


// Enum FortniteGame.EFortItemEntryState
enum class EFortItemEntryState : uint8_t
{
	NoneState                      = 0,
	NewItemCount                   = 1,
	ShouldShowItemToast            = 2,
	DurabilityInitialized          = 3,
	DoNotShowSpawnParticles        = 4,
	FromRecoveredBackpack          = 5,
	FromGift                       = 6,
	PendingUpgradeCriteriaProgress = 7,
	OwnerBuildingHandle            = 8,
	FromDroppedPickup              = 9,
	JustCrafted                    = 10,
	CraftAndSlotTarget             = 11,
	GenericAttributeValueSet       = 12,
	EFortItemEntryState_MAX        = 13
};


// Enum FortniteGame.EItemProfileType
enum class EItemProfileType : uint8_t
{
	Common                         = 0,
	Campaign                       = 1,
	Athena                         = 2,
	EItemProfileType_MAX           = 3
};


// Enum FortniteGame.ELobbyMissionGeneratorDetailsRequirement
enum class ELobbyMissionGeneratorDetailsRequirement : uint8_t
{
	Unknown                        = 0,
	NotRequired                    = 1,
	Required                       = 2,
	ELobbyMissionGeneratorDetailsRequirement_MAX = 3
};


// Enum FortniteGame.ELootQuotaLevel
enum class ELootQuotaLevel : uint8_t
{
	Unlimited                      = 0,
	Level1                         = 1,
	Level2                         = 2,
	Level3                         = 3,
	Level4                         = 4,
	Level5                         = 5,
	Level6                         = 6,
	Level7                         = 7,
	Level8                         = 8,
	Level9                         = 9,
	Level10                        = 10,
	Level11                        = 11,
	Level12                        = 12,
	Level13                        = 13,
	Level14                        = 14,
	Level15                        = 15,
	Level16                        = 16,
	Level17                        = 17,
	NumLevels                      = 18,
	ELootQuotaLevel_MAX            = 19
};


// Enum FortniteGame.EFortMatchmakingType
enum class EFortMatchmakingType : uint8_t
{
	Gathering                      = 0,
	CriticalMission                = 1,
	QuickPlay                      = 2,
	Session                        = 3,
	EFortMatchmakingType_MAX       = 4
};


// Enum FortniteGame.EFortSessionHelperJoinResult
enum class EFortSessionHelperJoinResult : uint8_t
{
	NoResult                       = 0,
	ReservationSuccess             = 1,
	ReservationFailure_PartyLimitReached = 2,
	ReservationFailure_IncorrectPlayerCount = 3,
	ReservationFailure_RequestTimedOut = 4,
	ReservationFailure_ReservationNotFound = 5,
	ReservationFailure_ReservationDenied = 6,
	ReservationFailure_ReservationDenied_Banned = 7,
	ReservationFailure_ReservationRequestCanceled = 8,
	ReservationFailure_ReservationInvalid = 9,
	ReservationFailure_BadSessionId = 10,
	ReservationFailure_ReservationDenied_ContainsExistingPlayers = 11,
	ReservationFailure_GeneralError = 12,
	ReservationFailure_NoSubsystem = 13,
	ReservationFailure_NoIdentity  = 14,
	ReservationFailure_InvalidSession = 15,
	ReservationFailure_InvalidUser = 16,
	ReservationFailure_EncryptionKey = 17,
	ReservationFailure_RefreshAuth = 18,
	ReservationFailure_AlreadyJoiningDuringReserve = 19,
	ReservationFailure_AlreadyJoiningDuringSkip = 20,
	JoinSessionSuccess             = 21,
	JoinSessionFailure_SessionIsFull = 22,
	JoinSessionFailure_SessionDoesNotExist = 23,
	JoinSessionFailure_CouldNotRetrieveAddress = 24,
	JoinSessionFailure_AlreadyInSession = 25,
	JoinSessionFailure_UnknownError = 26,
	JoinSessionFailure_InvalidSession = 27,
	JoinSessionFailure_InvalidSearchResultIndex = 28,
	JoinSessionFailure_AlreadyJoiningDuringJoin = 29,
	SearchPassFailure_NoSessionHelper = 30,
	SearchPassFailure_InvalidUser  = 31,
	SearchPassFailure_NoIdentity   = 32,
	SearchPassFailure_InvalidSearchResult = 33,
	SearchPassFailure_InvalidSearchResultIndex = 34,
	JoinSessionCanceled            = 35,
	EFortSessionHelperJoinResult_MAX = 36
};


// Enum FortniteGame.EFortMatchmakingPool
enum class EFortMatchmakingPool : uint8_t
{
	Any                            = 0,
	Desktop                        = 1,
	PS4                            = 2,
	XboxOne                        = 3,
	Mobile                         = 4,
	Test                           = 5,
	EFortMatchmakingPool_MAX       = 6
};


// Enum FortniteGame.EFortMatchmakingPrivacyConfiguration
enum class EFortMatchmakingPrivacyConfiguration : uint8_t
{
	UserPartyConfigured            = 0,
	ForcePrivate                   = 1,
	ForcePublic                    = 2,
	EFortMatchmakingPrivacyConfiguration_MAX = 3
};


// Enum FortniteGame.EMatchmakingFlags
enum class EMatchmakingFlags : uint8_t
{
	None                           = 0,
	CreateNewOnly                  = 1,
	NoReservation                  = 2,
	Private                        = 3,
	UseWorldDataOwner              = 4,
	EMatchmakingFlags_MAX          = 5
};


// Enum FortniteGame.EMatchmakingStartLocation
enum class EMatchmakingStartLocation : uint8_t
{
	Lobby                          = 0,
	Game                           = 1,
	CreateNew                      = 2,
	FindSingle                     = 3,
	EMatchmakingStartLocation_MAX  = 4
};


// Enum FortniteGame.EMatchmakingErrorV2
enum class EMatchmakingErrorV2 : uint8_t
{
	Success                        = 0,
	Canceled                       = 1,
	NeedUpdate                     = 2,
	NotLoggedIn                    = 3,
	NoIdentityInterface            = 4,
	NoSessionInterface             = 5,
	AlreadyInSession               = 6,
	FindSessionFailure             = 7,
	FailedToQueryEncryptionKey     = 8,
	FailedToRefreshAuthToken       = 9,
	FailedToCleanupSession         = 10,
	FailedToJoinSession            = 11,
	FailedToTravelToSession        = 12,
	Unauthorized                   = 13,
	BannedFromAthena               = 14,
	BannedFromAthenaForExploit     = 15,
	BannedFromAthenaForTeaming     = 16,
	BannedFromAthenaForTeamKilling = 17,
	InvalidCustomMatchKey          = 18,
	FailedToContactGameServices    = 19,
	FailedToConnectToMMS           = 20,
	MMSCommunicationIssue          = 21,
	ServiceReturnedError           = 22,
	PlaylistNoLongerAvailable      = 23,
	MatchmakingDisabled            = 24,
	UnknownError                   = 25,
	EMatchmakingErrorV2_MAX        = 26
};


// Enum FortniteGame.EAthenaProgressiveCosmeticType
enum class EAthenaProgressiveCosmeticType : uint8_t
{
	None                           = 0,
	AllTimeWins                    = 1,
	EAthenaProgressiveCosmeticType_MAX = 2
};


// Enum FortniteGame.EAthenaCustomizationCategory
enum class EAthenaCustomizationCategory : uint8_t
{
	None                           = 0,
	Glider                         = 1,
	Pickaxe                        = 2,
	Hat                            = 3,
	Backpack                       = 4,
	Character                      = 5,
	LoadingScreen                  = 6,
	BattleBus                      = 7,
	Dance                          = 8,
	Spray                          = 9,
	ConsumableEmote                = 10,
	VictoryPose                    = 11,
	SkyDiveContrail                = 12,
	EAthenaCustomizationCategory_MAX = 13
};


// Enum FortniteGame.ECampaignCustomizationCategory
enum class ECampaignCustomizationCategory : uint8_t
{
	None                           = 0,
	PersonalVehicle                = 1,
	ECampaignCustomizationCategory_MAX = 2
};


// Enum FortniteGame.ETwitchViewerStatusType
enum class ETwitchViewerStatusType : uint8_t
{
	TwitchViewerStatus_Unknown     = 0,
	TwitchViewerStatus_Nonsubscriber = 1,
	TwitchViewerStatus_Subscriber  = 2,
	TwitchViewerStatus_Broadcaster = 3,
	TwitchViewerStatus_Max         = 4
};


// Enum FortniteGame.EMcpLeaderboardTimeWindow
enum class EMcpLeaderboardTimeWindow : uint8_t
{
	Daily                          = 0,
	Weekly                         = 1,
	Monthly                        = 2,
	AllTime                        = 3,
	EMcpLeaderboardTimeWindow_MAX  = 4
};


// Enum FortniteGame.EFortMiniMapIconRotation
enum class EFortMiniMapIconRotation : uint8_t
{
	EFMMIR_None                    = 0,
	EFMMIR_Absolute                = 1,
	EFMMIR_Relative                = 2,
	EFMMIR_MAX                     = 3
};


// Enum FortniteGame.EFortMiniMapContext
enum class EFortMiniMapContext : uint8_t
{
	EFMC_MiniMap                   = 0,
	EFMC_FullScreenMap             = 1,
	EFMC_MAX                       = 2
};


// Enum FortniteGame.EFortMiniMapHeight
enum class EFortMiniMapHeight : uint8_t
{
	EFMH_Equal                     = 0,
	EFMH_Below                     = 1,
	EFMH_Above                     = 2,
	EFMH_MAX                       = 3
};


// Enum FortniteGame.EFortCheatMissionGenType
enum class EFortCheatMissionGenType : uint8_t
{
	NewGeneration                  = 0,
	OldGeneration                  = 1,
	Max_None                       = 2,
	EFortCheatMissionGenType_MAX   = 3
};


// Enum FortniteGame.EFortOptionGenerationResult
enum class EFortOptionGenerationResult : uint8_t
{
	NoOptionsGenerated             = 0,
	NewOptionsGenerated            = 1,
	ExistingOptionsGenerated       = 2,
	EFortOptionGenerationResult_MAX = 3
};


// Enum FortniteGame.EPollActorsInVolumeTypes
enum class EPollActorsInVolumeTypes : uint8_t
{
	DesignerPlacedOnly             = 0,
	PlayerBuiltOnly                = 1,
	All                            = 2,
	EPollActorsInVolumeTypes_MAX   = 3
};


// Enum FortniteGame.EMissionReplyTypes
enum class EMissionReplyTypes : uint8_t
{
	Handled                        = 0,
	NotHandled                     = 1,
	EMissionReplyTypes_MAX         = 2
};


// Enum FortniteGame.ETimerOverrideSetting
enum class ETimerOverrideSetting : uint8_t
{
	DefaultBehavior                = 0,
	ForceShow                      = 1,
	ForceHide                      = 2,
	ETimerOverrideSetting_MAX      = 3
};


// Enum FortniteGame.EFortMtxPlatform
enum class EFortMtxPlatform : uint8_t
{
	Epic                           = 0,
	PSN                            = 1,
	Live                           = 2,
	Shared                         = 3,
	EpicPC                         = 4,
	EpicPCKorea                    = 5,
	IOSAppStore                    = 6,
	EpicAndroid                    = 7,
	EFortMtxPlatform_MAX           = 8
};


// Enum FortniteGame.EFortMusicSectionType
enum class EFortMusicSectionType : uint8_t
{
	Intro                          = 0,
	Loop                           = 1,
	Outro                          = 2,
	Max_None                       = 3,
	EFortMusicSectionType_MAX      = 4
};


// Enum FortniteGame.EFortMusicSectionStopBehavior
enum class EFortMusicSectionStopBehavior : uint8_t
{
	Crossfade                      = 0,
	AllowFadeOut                   = 1,
	EFortMusicSectionStopBehavior_MAX = 2
};


// Enum FortniteGame.EFortMusicCombatIntensity
enum class EFortMusicCombatIntensity : uint8_t
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	VeryHigh                       = 3,
	Max_None                       = 4,
	EFortMusicCombatIntensity_MAX  = 5
};


// Enum FortniteGame.EMusicChannel
enum class EMusicChannel : uint8_t
{
	VoiceA                         = 0,
	VoiceB                         = 1,
	Max_None                       = 2,
	EMusicChannel_MAX              = 3
};


// Enum FortniteGame.EMusicFadeStyles
enum class EMusicFadeStyles : uint8_t
{
	CrossFade                      = 0,
	FadeOutThenIn                  = 1,
	Max_None                       = 2,
	EMusicFadeStyles_MAX           = 3
};


// Enum FortniteGame.EFortAreaFlag
enum class EFortAreaFlag : uint8_t
{
	Default                        = 0,
	Obstacle                       = 1,
	Smashable                      = 2,
	Unwalkable                     = 3,
	Interactable                   = 4,
	EFortAreaFlag_MAX              = 5
};


// Enum FortniteGame.EFortNavLinkPattern
enum class EFortNavLinkPattern : uint8_t
{
	Floor                          = 0,
	Stairs                         = 1,
	Roof                           = 2,
	Manual                         = 3,
	EFortNavLinkPattern_MAX        = 4
};


// Enum FortniteGame.EFortNamedNavmesh
enum class EFortNamedNavmesh : uint8_t
{
	Husk                           = 0,
	Smasher                        = 1,
	MAX                            = 2
};


// Enum FortniteGame.ESettingTab
enum class ESettingTab : uint8_t
{
	Video                          = 0,
	Game                           = 1,
	ESettingTab_MAX                = 2
};


// Enum FortniteGame.ESettingDisplayType
enum class ESettingDisplayType : uint8_t
{
	Header                         = 0,
	Slider                         = 1,
	Rotator                        = 2,
	Toggle                         = 3,
	ESettingDisplayType_MAX        = 4
};


// Enum FortniteGame.ESettingType
enum class ESettingType : uint8_t
{
	MouseSensitivity               = 0,
	TouchDragSensitivity           = 1,
	ControllerLookSensitivityYaw   = 2,
	ControllerLookSensitivityPitch = 3,
	MouseTargetingMultiplier       = 4,
	MouseScopedMultiplier          = 5,
	GamepadTargetingMultiplier     = 6,
	GamepadScopedMultiplier        = 7,
	TouchDragTargetingSensitivity  = 8,
	TouchDragScopedSensitivity     = 9,
	SafeZone                       = 10,
	ConsoleUnlockedFPS             = 11,
	Language                       = 12,
	InvertAcceptAndBack            = 13,
	Region                         = 14,
	InvertMouse                    = 15,
	ToggleSprint                   = 16,
	SprintCancelsReload            = 17,
	TapInteract                    = 18,
	ToggleTargeting                = 19,
	AutoEquipBetterItems           = 20,
	FirstPersonCamera              = 21,
	ForceFeedback                  = 22,
	AimAssist                      = 23,
	EquipFirstBuildingPieceWhenSwappingQuickbars = 24,
	EquipFirstBuildingPieceWhenSwappingQuickbarsAthena = 25,
	ShowHeadAccessories            = 26,
	ShowBackpack                   = 27,
	PeripheralLighting             = 28,
	ShowViewerCount                = 29,
	GamepadAutoRun                 = 30,
	HUDScale                       = 31,
	StreamerMode                   = 32,
	TurboBuild                     = 33,
	AutoChangeMaterial             = 34,
	CrossplayPreference            = 35,
	ReplayRecording                = 36,
	ReplayRecordingLargeTeams      = 37,
	ESettingType_MAX               = 38
};


// Enum FortniteGame.EPathUndermineEvent
enum class EPathUndermineEvent : uint8_t
{
	Predicted                      = 0,
	Started                        = 1,
	Finished                       = 2,
	EPathUndermineEvent_MAX        = 3
};


// Enum FortniteGame.EPathObstacleAction
enum class EPathObstacleAction : uint8_t
{
	Melee                          = 0,
	Ignore                         = 1,
	AbortMoveAsFailed              = 2,
	FinishMoveAsSucceeded          = 3,
	EPathObstacleAction_MAX        = 4
};


// Enum FortniteGame.EWardAffectType
enum class EWardAffectType : uint8_t
{
	AffectsBothStartAndEndPoints   = 0,
	AffectsOnlyStartPoints         = 1,
	AffectsOnlyEndPoints           = 2,
	EWardAffectType_MAX            = 3
};


// Enum FortniteGame.EFortControlRecoveryBehavior
enum class EFortControlRecoveryBehavior : uint8_t
{
	DefaultControl                 = 0,
	LimitedControl                 = 1,
	ChainControl                   = 2,
	EFortControlRecoveryBehavior_MAX = 3
};


// Enum FortniteGame.EFortPawnPushSize
enum class EFortPawnPushSize : uint8_t
{
	FFPS_Normal                    = 0,
	FPPS_Player                    = 1,
	FPPS_Large                     = 2,
	FPPS_SuperLarge                = 3,
	EFortPawnPushSize_MAX          = 4
};


// Enum FortniteGame.EFortAnnouncerTeamVocalChords
enum class EFortAnnouncerTeamVocalChords : uint8_t
{
	Team1                          = 0,
	Team2                          = 1,
	Max_None                       = 2,
	EFortAnnouncerTeamVocalChords_MAX = 3
};


// Enum FortniteGame.EFortIsFinalXpUpdate
enum class EFortIsFinalXpUpdate : uint8_t
{
	Uninitialized                  = 0,
	NotFinal                       = 1,
	Final                          = 2,
	EFortIsFinalXpUpdate_MAX       = 3
};


// Enum FortniteGame.EFortRewardType
enum class EFortRewardType : uint8_t
{
	Default                        = 0,
	Missed                         = 1,
	Max_None                       = 2,
	EFortRewardType_MAX            = 3
};


// Enum FortniteGame.EFortRewardActivityType
enum class EFortRewardActivityType : uint8_t
{
	General                        = 0,
	MissionPrimary                 = 1,
	MissionSecondary               = 2,
	AccountLevelUp                 = 3,
	Max_None                       = 4,
	EFortRewardActivityType_MAX    = 5
};


// Enum FortniteGame.EStatCategory
enum class EStatCategory : uint8_t
{
	Combat                         = 0,
	Building                       = 1,
	Utility                        = 2,
	Max_None                       = 3,
	EStatCategory_MAX              = 4
};


// Enum FortniteGame.EFortReplicatedStat
enum class EFortReplicatedStat : uint8_t
{
	MonsterKills                   = 0,
	MonsterDamagePoints            = 1,
	PlayerKills                    = 2,
	WoodGathered                   = 3,
	StoneGathered                  = 4,
	MetalGathered                  = 5,
	Deaths                         = 6,
	BuildingsBuilt                 = 7,
	BuildingsBuilt_Wood            = 8,
	BuildingsBuilt_Stone           = 9,
	BuildingsBuilt_Metal           = 10,
	BuildingsUpgraded_Wood2        = 11,
	BuildingsUpgraded_Wood3        = 12,
	BuildingsUpgraded_Stone2       = 13,
	BuildingsUpgraded_Stone3       = 14,
	BuildingsUpgraded_Metal2       = 15,
	BuildingsUpgraded_Metal3       = 16,
	BuildingsDestroyed             = 17,
	Repair_Wood                    = 18,
	Repair_Stone                   = 19,
	Repair_Metal                   = 20,
	FlagsCaptured                  = 21,
	FlagsReturned                  = 22,
	ContainersLooted               = 23,
	CraftingPoints                 = 24,
	TrapPlacementPoints            = 25,
	TrapActivationPoints           = 26,
	TotalScore                     = 27,
	OldTotalScore                  = 28,
	CombatScore                    = 29,
	BuildingScore                  = 30,
	UtilityScore                   = 31,
	BadgesScore                    = 32,
	None                           = 33,
	MAX                            = 34
};


// Enum FortniteGame.EFortReplenishmentType
enum class EFortReplenishmentType : uint8_t
{
	Restricted                     = 0,
	ClampMin                       = 1,
	Add                            = 2,
	Ability                        = 3,
	EFortReplenishmentType_MAX     = 4
};


// Enum FortniteGame.EFortPickupTossState
enum class EFortPickupTossState : uint8_t
{
	NotTossed                      = 0,
	InProgress                     = 1,
	AtRest                         = 2,
	EFortPickupTossState_MAX       = 3
};


// Enum FortniteGame.EFortPlayerAnimBodyType
enum class EFortPlayerAnimBodyType : uint8_t
{
	Small                          = 0,
	Medium                         = 1,
	Large                          = 2,
	EFortPlayerAnimBodyType_MAX    = 3
};


// Enum FortniteGame.EFortCardinalDirection
enum class EFortCardinalDirection : uint8_t
{
	North                          = 0,
	East                           = 1,
	South                          = 2,
	West                           = 3,
	EFortCardinalDirection_MAX     = 4
};


// Enum FortniteGame.EFortPickerToDisplay
enum class EFortPickerToDisplay : uint8_t
{
	TrapPicker                     = 0,
	WeaponPicker                   = 1,
	SocialPicker                   = 2,
	ChatPicker                     = 3,
	NotePicker                     = 4,
	SprayPicker                    = 5,
	EmotePicker                    = 6,
	SquadQuickChatPicker           = 7,
	EFortPickerToDisplay_MAX       = 8
};


// Enum FortniteGame.ELockOnState
enum class ELockOnState : uint8_t
{
	NoTarget                       = 0,
	TargetAcquired                 = 1,
	LockingOnToTarget              = 2,
	TargetLockedOn                 = 3,
	Cooldown                       = 4,
	COUNT                          = 5,
	ELockOnState_MAX               = 6
};


// Enum FortniteGame.EMapZoomingMode
enum class EMapZoomingMode : uint8_t
{
	None                           = 0,
	ZoomingIn                      = 1,
	ZoomingOut                     = 2,
	EMapZoomingMode_MAX            = 3
};


// Enum FortniteGame.ECameraStateRestoreReason
enum class ECameraStateRestoreReason : uint8_t
{
	Unknown                        = 0,
	ChangedFollowTarget            = 1,
	ChangedCameraType              = 2,
	InvokedHotKey                  = 3,
	Scrubbed                       = 4,
	MAX                            = 5
};


// Enum FortniteGame.EFortInputActionGroup
enum class EFortInputActionGroup : uint8_t
{
	AllModes                       = 0,
	Combat                         = 1,
	Building                       = 2,
	Edit                           = 3,
	Death                          = 4,
	Cinematic                      = 5,
	Picker                         = 6,
	Other                          = 7,
	EFortInputActionGroup_MAX      = 8
};


// Enum FortniteGame.EFortInputActionType
enum class EFortInputActionType : uint8_t
{
	Press                          = 0,
	Click                          = 1,
	Hold                           = 2,
	Release                        = 3,
	EFortInputActionType_MAX       = 4
};


// Enum FortniteGame.EFortPawnStasisMode
enum class EFortPawnStasisMode : uint8_t
{
	None                           = 0,
	NoMovement                     = 1,
	NoMovementOrTurning            = 2,
	EFortPawnStasisMode_MAX        = 3
};


// Enum FortniteGame.ETrustedPlatformType
enum class ETrustedPlatformType : uint8_t
{
	Unknown                        = 0,
	Untrusted                      = 1,
	PS4                            = 2,
	XboxOne                        = 3,
	ETrustedPlatformType_MAX       = 4
};


// Enum FortniteGame.EDeathCause
enum class EDeathCause : uint8_t
{
	OutsideSafeZone                = 0,
	FallDamage                     = 1,
	Pistol                         = 2,
	Shotgun                        = 3,
	Rifle                          = 4,
	SMG                            = 5,
	Sniper                         = 6,
	Melee                          = 7,
	Grenade                        = 8,
	GrenadeLauncher                = 9,
	RocketLauncher                 = 10,
	Minigun                        = 11,
	Bow                            = 12,
	Trap                           = 13,
	DBNOTimeout                    = 14,
	Banhammer                      = 15,
	RemovedFromGame                = 16,
	Unspecified                    = 17,
	EDeathCause_MAX                = 18
};


// Enum FortniteGame.ETeamMemberState
enum class ETeamMemberState : uint8_t
{
	None                           = 0,
	FIRST_CHAT_MESSAGE             = 1,
	NeedAmmoHeavy                  = 2,
	NeedAmmoLight                  = 3,
	NeedAmmoMedium                 = 4,
	NeedAmmoShells                 = 5,
	NeedAmmoRocket                 = 6,
	ChatBubble                     = 7,
	EnemySpotted                   = 8,
	NeedBandages                   = 9,
	NeedMaterials                  = 10,
	NeedShields                    = 11,
	NeedWeapon                     = 12,
	LAST_CHAT_MESSAGE              = 13,
	MAX                            = 14
};


// Enum FortniteGame.EFortPawnState
enum class EFortPawnState : uint8_t
{
	Default                        = 0,
	InCombat                       = 1,
	DBNO                           = 2,
	IsReviving                     = 3,
	BeingRevived                   = 4,
	Dead                           = 5,
	EFortPawnState_MAX             = 6
};


// Enum FortniteGame.EFriendlyFireType
enum class EFriendlyFireType : uint8_t
{
	Off                            = 0,
	On                             = 1,
	EFriendlyFireType_MAX          = 2
};


// Enum FortniteGame.EFortAthenaPlaylist
enum class EFortAthenaPlaylist : uint8_t
{
	AthenaSolo                     = 0,
	AthenaDuo                      = 1,
	AthenaSquad                    = 2,
	AthenaFiftyFifty               = 3,
	AthenaEvent1                   = 4,
	AthenaEvent2                   = 5,
	AthenaEvent3                   = 6,
	AthenaEvent4                   = 7,
	AthenaEvent5                   = 8,
	AthenaEvent6                   = 9,
	AthenaEvent7                   = 10,
	AthenaEvent8                   = 11,
	AthenaPlatoon                  = 12,
	AthenaEvent21                  = 13,
	AthenaEvent22                  = 14,
	AthenaEvent23                  = 15,
	AthenaEvent24                  = 16,
	AthenaEvent25                  = 17,
	AthenaEvent26                  = 18,
	AthenaEvent27                  = 19,
	AthenaEvent28                  = 20,
	AthenaEvent29                  = 21,
	AthenaEvent30                  = 22,
	AthenaEvent31                  = 23,
	AthenaEvent32                  = 24,
	AthenaEvent33                  = 25,
	AthenaEvent34                  = 26,
	AthenaEvent35                  = 27,
	AthenaEvent36                  = 28,
	AthenaEvent37                  = 29,
	AthenaEvent38                  = 30,
	AthenaEvent39                  = 31,
	AthenaSnipersV2Solo            = 32,
	AthenaEvent40                  = 33,
	AthenaSnipersV2Duo             = 34,
	AthenaEvent41                  = 35,
	AthenaSnipersV2Squad           = 36,
	AthenaEvent42                  = 37,
	AthenaEvent43                  = 38,
	AthenaEvent44                  = 39,
	AthenaEvent45                  = 40,
	AthenaEvent46                  = 41,
	AthenaEvent47                  = 42,
	AthenaEvent48                  = 43,
	AthenaEvent49                  = 44,
	AthenaEvent50                  = 45,
	AthenaEvent51                  = 46,
	AthenaEvent52                  = 47,
	AthenaEvent53                  = 48,
	AthenaEvent54                  = 49,
	EFortAthenaPlaylist_MAX        = 50
};


// Enum FortniteGame.EAthenaRespawnLocation
enum class EAthenaRespawnLocation : uint8_t
{
	Air                            = 0,
	EAthenaRespawnLocation_MAX     = 1
};


// Enum FortniteGame.EAthenaRespawnType
enum class EAthenaRespawnType : uint8_t
{
	None                           = 0,
	InfiniteRespawn                = 1,
	InfiniteRespawnExceptStorm     = 2,
	EAthenaRespawnType_MAX         = 3
};


// Enum FortniteGame.EScorePlacementTable
enum class EScorePlacementTable : uint8_t
{
	None                           = 0,
	Solo                           = 1,
	Duos                           = 2,
	Squads                         = 3,
	FiftyFifty                     = 4,
	Count                          = 5,
	EScorePlacementTable_MAX       = 6
};


// Enum FortniteGame.ESafeZoneStartUp
enum class ESafeZoneStartUp : uint8_t
{
	UseDefaultGameBehavior         = 0,
	StartsWithWarmUp               = 1,
	StartsWithAirCraft             = 2,
	ESafeZoneStartUp_MAX           = 3
};


// Enum FortniteGame.EProfileGoState
enum class EProfileGoState : uint8_t
{
	None                           = 0,
	SettlingLocation               = 1,
	RunningCommands                = 2,
	CompletedScenario              = 3,
	Summary                        = 4,
	Completed                      = 5,
	EProfileGoState_MAX            = 6
};


// Enum FortniteGame.EFortPointsFromNavGraphGoalPathDistanceFilterOperator
enum class EFortPointsFromNavGraphGoalPathDistanceFilterOperator : uint8_t
{
	AllGoalsInRange                = 0,
	AnyGoalInRange                 = 1,
	EFortPointsFromNavGraphGoalPathDistanceFilterOperator_MAX = 2
};


// Enum FortniteGame.EFortTestGoalActorDot
enum class EFortTestGoalActorDot : uint8_t
{
	Dot3D                          = 0,
	Dot2D                          = 1,
	EFortTestGoalActorDot_MAX      = 2
};


// Enum FortniteGame.EDistanceMode
enum class EDistanceMode : uint8_t
{
	DistItemToContext              = 0,
	DistItemGoalActorToContext     = 1,
	DistItemToItemGoalActor        = 2,
	EDistanceMode_MAX              = 3
};


// Enum FortniteGame.ECountAIAssignedToType
enum class ECountAIAssignedToType : uint8_t
{
	Goal                           = 0,
	Actor                          = 1,
	Assignment                     = 2,
	ECountAIAssignedToType_MAX     = 3
};


// Enum FortniteGame.ETwoPointSolverRotationA
enum class ETwoPointSolverRotationA : uint8_t
{
	PointAToQuerier                = 0,
	QuerierToPointA                = 1,
	PointAToQuerierWithRandomOffset = 2,
	QuerierToPointAWithRandomOffset = 3,
	Custom                         = 4,
	ETwoPointSolverRotationA_MAX   = 5
};


// Enum FortniteGame.EFortQuestRewardType
enum class EFortQuestRewardType : uint8_t
{
	BasicRewards                   = 0,
	BasicPlusSingleChoice          = 1,
	EFortQuestRewardType_MAX       = 2
};


// Enum FortniteGame.EQuestVisualStyle
enum class EQuestVisualStyle : uint8_t
{
	Normal                         = 0,
	Hard                           = 1,
	EQuestVisualStyle_MAX          = 2
};


// Enum FortniteGame.EFortQuestType
enum class EFortQuestType : uint8_t
{
	Task                           = 0,
	Optional                       = 1,
	DailyQuest                     = 2,
	TransientQuest                 = 3,
	SurvivorQuest                  = 4,
	Achievement                    = 5,
	Onboarding                     = 6,
	StreamBroadcaster              = 7,
	StreamViewer                   = 8,
	StreamSubscriber               = 9,
	Athena                         = 10,
	AthenaDailyQuest               = 11,
	AthenaEvent                    = 12,
	AthenaBattlePassQuest          = 13,
	AthenaChallengeBundleQuest     = 14,
	All                            = 15,
	EFortQuestType_MAX             = 16
};


// Enum FortniteGame.EFortQuestObjectiveItemEvent
enum class EFortQuestObjectiveItemEvent : uint8_t
{
	Craft                          = 0,
	Collect                        = 1,
	Acquire                        = 2,
	Consume                        = 3,
	OpenCardPack                   = 4,
	PurchaseCardPack               = 5,
	Convert                        = 6,
	Upgrade                        = 7,
	UpgradeRarity                  = 8,
	QuestComplete                  = 9,
	AssignWorker                   = 10,
	LevelUpCollectionBook          = 11,
	LevelUpAthenaSeason            = 12,
	LevelUpBattlePass              = 13,
	HasItem                        = 14,
	SlotInCollection               = 15,
	HasCompletedQuest              = 16,
	HasAssignedWorker              = 17,
	HasUpgraded                    = 18,
	HasConverted                   = 19,
	HasUpgradedRarity              = 20,
	HasLeveledUpCollectionBook     = 21,
	HasLeveledUpAthenaSeason       = 22,
	HasLeveledUpBattlePass         = 23,
	Max_None                       = 24,
	EFortQuestObjectiveItemEvent_MAX = 25
};


// Enum FortniteGame.EFortQuestObjectiveStatEvent
enum class EFortQuestObjectiveStatEvent : uint8_t
{
	Kill                           = 0,
	TeamKill                       = 1,
	KillContribution               = 2,
	Damage                         = 3,
	Visit                          = 4,
	Land                           = 5,
	Emote                          = 6,
	Spray                          = 7,
	Build                          = 8,
	BuildingEdit                   = 9,
	BuildingRepair                 = 10,
	BuildingUpgrade                = 11,
	PlaceTrap                      = 12,
	Complete                       = 13,
	Craft                          = 14,
	Collect                        = 15,
	Win                            = 16,
	Interact                       = 17,
	Destroy                        = 18,
	Ability                        = 19,
	WaveComplete                   = 20,
	Custom                         = 21,
	Client                         = 22,
	AthenaRank                     = 23,
	AthenaOutlive                  = 24,
	RevivePlayer                   = 25,
	NumGameplayEvents              = 26,
	Acquire                        = 27,
	Consume                        = 28,
	OpenCardPack                   = 29,
	PurchaseCardPack               = 30,
	Convert                        = 31,
	Upgrade                        = 32,
	UpgradeRarity                  = 33,
	QuestComplete                  = 34,
	AssignWorker                   = 35,
	CollectExpedition              = 36,
	CollectSuccessfulExpedition    = 37,
	LevelUpCollectionBook          = 38,
	LevelUpAthenaSeason            = 39,
	LevelUpBattlePass              = 40,
	HasItem                        = 41,
	SlotInCollection               = 42,
	HasCompletedQuest              = 43,
	HasAssignedWorker              = 44,
	HasUpgraded                    = 45,
	HasConverted                   = 46,
	HasUpgradedRarity              = 47,
	HasLeveledUpCollectionBook     = 48,
	HasLeveledUpAthenaSeason       = 49,
	HasLeveledUpBattlePass         = 50,
	Max_None                       = 51,
	EFortQuestObjectiveStatEvent_MAX = 52
};


// Enum FortniteGame.EFortQuestState
enum class EFortQuestState : uint8_t
{
	Inactive                       = 0,
	Active                         = 1,
	Completed                      = 2,
	Claimed                        = 3,
	EFortQuestState_MAX            = 4
};


// Enum FortniteGame.EFortQuickBars
enum class EFortQuickBars : uint8_t
{
	Primary                        = 0,
	Secondary                      = 1,
	Max_None                       = 2,
	EFortQuickBars_MAX             = 3
};


// Enum FortniteGame.ERegisteredPlayerUnregistrationStatus
enum class ERegisteredPlayerUnregistrationStatus : uint8_t
{
	Registered                     = 0,
	UnregistrationStarting         = 1,
	UnregistrationWaitingForInitialLock = 2,
	UnregistrationWaitingForFinalSave = 3,
	UnregistrationWaitingForProfileUnlock = 4,
	UnregistrationComplete         = 5,
	ERegisteredPlayerUnregistrationStatus_MAX = 6
};


// Enum FortniteGame.EClassRepNodeMapping
enum class EClassRepNodeMapping : uint8_t
{
	NotRouted                      = 0,
	RelevantAllConnections         = 1,
	Spatialize_Static              = 2,
	Spatialize_Dynamic             = 3,
	Spatialize_Dormancy            = 4,
	EClassRepNodeMapping_MAX       = 5
};


// Enum FortniteGame.EFortSafeZoneState
enum class EFortSafeZoneState : uint8_t
{
	None                           = 0,
	Starting                       = 1,
	Holding                        = 2,
	Shrinking                      = 3,
	EFortSafeZoneState_MAX         = 4
};


// Enum FortniteGame.EFortUIScoreType
enum class EFortUIScoreType : uint8_t
{
	Combat                         = 0,
	Building                       = 1,
	Utility                        = 2,
	Badges                         = 3,
	Bonus                          = 4,
	Total                          = 5,
	Max_None                       = 6,
	EFortUIScoreType_MAX           = 7
};


// Enum FortniteGame.EFortScriptedActionEnvironment
enum class EFortScriptedActionEnvironment : uint8_t
{
	FrontEnd                       = 0,
	GameServer                     = 1,
	GameClient                     = 2,
	Max_None                       = 3,
	EFortScriptedActionEnvironment_MAX = 4
};


// Enum FortniteGame.EFortScriptedActionSource
enum class EFortScriptedActionSource : uint8_t
{
	Quest                          = 0,
	Token                          = 1,
	Manual                         = 2,
	Max_None                       = 3,
	EFortScriptedActionSource_MAX  = 4
};


// Enum FortniteGame.EFortSessionHelperJoinState
enum class EFortSessionHelperJoinState : uint8_t
{
	NotJoining                     = 0,
	RequestingReservation          = 1,
	FailedReservation              = 2,
	WaitingOnGame                  = 3,
	AttemptingJoin                 = 4,
	JoiningSession                 = 5,
	FailedJoin                     = 6,
	CanceledJoin                   = 7,
	EFortSessionHelperJoinState_MAX = 8
};


// Enum FortniteGame.EFortSocialItemPresenceStatus
enum class EFortSocialItemPresenceStatus : uint8_t
{
	Offline                        = 0,
	InGame                         = 1,
	Away                           = 2,
	Unknown                        = 3,
	EFortSocialItemPresenceStatus_MAX = 4
};


// Enum FortniteGame.EFortSocialItemType
enum class EFortSocialItemType : uint8_t
{
	Header                         = 0,
	Friend                         = 1,
	XBLFriend                      = 2,
	PartyInvite                    = 3,
	RecentPlayer                   = 4,
	DisplayMessage                 = 5,
	Max                            = 6
};


// Enum FortniteGame.EFortSoundIndicatorTypes
enum class EFortSoundIndicatorTypes : uint8_t
{
	Generic                        = 0,
	FootStep                       = 1,
	Gunshot                        = 2,
	Chest                          = 3,
	COUNT                          = 4,
	EFortSoundIndicatorTypes_MAX   = 5
};


// Enum FortniteGame.EFortEventConditionType
enum class EFortEventConditionType : uint8_t
{
	EFEC_StatCompare               = 0,
	EFEC_CanCraft                  = 1,
	EFEC_MAX                       = 2
};


// Enum FortniteGame.EFortCompare
enum class EFortCompare : uint8_t
{
	EFC_LessThan                   = 0,
	EFC_LessThanOrEqual            = 1,
	EFC_GreaterThan                = 2,
	EFC_GreaterThanOrEqual         = 3,
	EFC_Equals                     = 4,
	EFC_MAX                        = 5
};


// Enum FortniteGame.EFortEventRepeat
enum class EFortEventRepeat : uint8_t
{
	EFER_Inactive                  = 0,
	EFER_Always                    = 1,
	EFER_OncePerPlayer             = 2,
	EFER_OncePerCampaign           = 3,
	EFER_OncePerMap                = 4,
	EFER_MAX                       = 5
};


// Enum FortniteGame.EFortAutoTestState
enum class EFortAutoTestState : uint8_t
{
	InitialLoad                    = 0,
	Login                          = 1,
	FrontendLoad                   = 2,
	FrontendPvELoad                = 3,
	FrontendPvETest                = 4,
	PvEMatchmaking                 = 5,
	ZoneLoad                       = 6,
	ZoneTest                       = 7,
	ServerShutdown                 = 8,
	Finished                       = 9,
	MAX                            = 10
};


// Enum FortniteGame.EFortTheaterType
enum class EFortTheaterType : uint8_t
{
	Standard                       = 0,
	Elder                          = 1,
	PvP                            = 2,
	PvP2                           = 3,
	Tutorial                       = 4,
	TutorialGate                   = 5,
	Max_None                       = 6,
	EFortTheaterType_MAX           = 7
};


// Enum FortniteGame.EFortTheaterMapTileType
enum class EFortTheaterMapTileType : uint8_t
{
	Normal                         = 0,
	CriticalMission                = 1,
	AlwaysActive                   = 2,
	Outpost                        = 3,
	NonMission                     = 4,
	PvPFOB                         = 5,
	EFortTheaterMapTileType_MAX    = 6
};


// Enum FortniteGame.EFortMapNavigationDirection
enum class EFortMapNavigationDirection : uint8_t
{
	North                          = 0,
	NorthEast                      = 1,
	East                           = 2,
	SouthEast                      = 3,
	South                          = 4,
	SouthWest                      = 5,
	West                           = 6,
	NorthWest                      = 7,
	Invalid                        = 8,
	EFortMapNavigationDirection_MAX = 9
};


// Enum FortniteGame.EFortMissionQuestValidityResult
enum class EFortMissionQuestValidityResult : uint8_t
{
	Invalid                        = 0,
	InvalidNotPlayable             = 1,
	ValidLinked                    = 2,
	ValidObjectiveCondition        = 3,
	ValidFallback                  = 4,
	EFortMissionQuestValidityResult_MAX = 5
};


// Enum FortniteGame.ECollectionSelectionMethod
enum class ECollectionSelectionMethod : uint8_t
{
	TierAsIndex                    = 0,
	TierAsIndexOverflowToLastValid = 1,
	Modulo                         = 2,
	Random                         = 3,
	None                           = 4,
	ECollectionSelectionMethod_MAX = 5
};


// Enum FortniteGame.ETrackVerticality
enum class ETrackVerticality : uint8_t
{
	Floor                          = 0,
	Ramp                           = 1,
	GradualRamp                    = 2,
	Max_None                       = 3,
	ETrackVerticality_MAX          = 4
};


// Enum FortniteGame.ETrackIncline
enum class ETrackIncline : uint8_t
{
	NoNeighbor                     = 0,
	Flat                           = 1,
	Up                             = 2,
	Down                           = 3,
	GradualUp                      = 4,
	GradualDown                    = 5,
	Max_None                       = 6,
	ETrackIncline_MAX              = 7
};


// Enum FortniteGame.ETrackPieceType
enum class ETrackPieceType : uint8_t
{
	None                           = 0,
	Straight                       = 1,
	Turn                           = 2,
	TShape                         = 3,
	Cross                          = 4,
	Max_None                       = 5,
	ETrackPieceType_MAX            = 6
};


// Enum FortniteGame.ETrackDirection
enum class ETrackDirection : uint8_t
{
	YNegative                      = 0,
	XPositive                      = 1,
	YPositive                      = 2,
	XNegative                      = 3,
	Max_None                       = 4,
	ETrackDirection_MAX            = 5
};


// Enum FortniteGame.EPTTState
enum class EPTTState : uint8_t
{
	Enabled                        = 0,
	MicDisabled                    = 1,
	AllSoundDisabled               = 2,
	EPTTState_MAX                  = 3
};


// Enum FortniteGame.EFortPlayerRole
enum class EFortPlayerRole : uint8_t
{
	Player                         = 0,
	LiveSpectator                  = 1,
	ReplaySpectator                = 2,
	EFortPlayerRole_MAX            = 3
};


// Enum FortniteGame.EMobileInteractionIconTypes
enum class EMobileInteractionIconTypes : uint8_t
{
	Interact                       = 0,
	Swap                           = 1,
	Revive                         = 2,
	Blocked                        = 3,
	MAX                            = 4
};


// Enum FortniteGame.EAthenaPickerType
enum class EAthenaPickerType : uint8_t
{
	EditMode                       = 0,
	Interact                       = 1,
	MAX                            = 2
};


// Enum FortniteGame.EFortGliderType
enum class EFortGliderType : uint8_t
{
	Glider                         = 0,
	Umbrella                       = 1,
	EFortGliderType_MAX            = 2
};


// Enum FortniteGame.EItemTileViewDisplayType
enum class EItemTileViewDisplayType : uint8_t
{
	World                          = 0,
	Outpost                        = 1,
	Account                        = 2,
	DeployableBase                 = 3,
	Max                            = 4
};


// Enum FortniteGame.EOutpostBuildings
enum class EOutpostBuildings : uint8_t
{
	StormShield                    = 0,
	CraftingTable                  = 1,
	Fabricator                     = 2,
	HarvestingOptimizer            = 3,
	StorageVault                   = 4,
	POST                           = 5,
	EOutpostBuildings_MAX          = 6
};


// Enum FortniteGame.EFortClientAnnouncementQueueType
enum class EFortClientAnnouncementQueueType : uint8_t
{
	Toasts                         = 0,
	Stickies                       = 1,
	Max                            = 2
};


// Enum FortniteGame.EFortNotificationQueueType
enum class EFortNotificationQueueType : uint8_t
{
	Toasts                         = 0,
	Stickies                       = 1,
	Messages                       = 2,
	Max                            = 3
};


// Enum FortniteGame.EFortDialogResult
enum class EFortDialogResult : uint8_t
{
	Confirmed                      = 0,
	Declined                       = 1,
	Ignored                        = 2,
	Killed                         = 3,
	TimedOut                       = 4,
	Unknown                        = 5,
	EFortDialogResult_MAX          = 6
};


// Enum FortniteGame.EFortBangType
enum class EFortBangType : uint8_t
{
	Invalid                        = 0,
	Custom                         = 1,
	PlayTab                        = 2,
	HeroesTab                      = 3,
	VaultTab                       = 4,
	StoreTab                       = 5,
	FriendsButton                  = 6,
	PartyInviteButton              = 7,
	SubGameAccessChanged           = 8,
	DailyRewardsButton             = 9,
	QuestsButton                   = 10,
	CompletedExpeditions           = 11,
	MainMenu                       = 12,
	HelpMenu                       = 13,
	VaultSchematics                = 14,
	VaultLeadSurvivors             = 15,
	VaultSurvivors                 = 16,
	VaultHeroes                    = 17,
	VaultDefenders                 = 18,
	VaultResources                 = 19,
	VaultMelee                     = 20,
	VaultRanged                    = 21,
	VaultConsumables               = 22,
	VaultIngredients               = 23,
	VaultTraps                     = 24,
	CosmeticsTab                   = 25,
	CosmeticsOutfit                = 26,
	CosmeticGlider                 = 27,
	CosmeticContrail               = 28,
	CosmeticBattleBus              = 29,
	CosmeticLoadingScreen          = 30,
	CosmeticBackpack               = 31,
	CosmeticHat                    = 32,
	CosmeticPickaxe                = 33,
	CosmeticDance                  = 34,
	CosmeticSpray                  = 35,
	AthenaDirectedAcquisitionTab   = 36,
	PlayerBanners                  = 37,
	EFortBangType_MAX              = 38
};


// Enum FortniteGame.EFortEventNameType
enum class EFortEventNameType : uint8_t
{
	Mission                        = 0,
	Client                         = 1,
	EFortEventNameType_MAX         = 2
};


// Enum FortniteGame.EFortCraftFailCause
enum class EFortCraftFailCause : uint8_t
{
	Unknown                        = 0,
	NotEnoughResources             = 1,
	InventoryFull                  = 2,
	InsufficientTeamLevel          = 3,
	CraftingQueueFull              = 4,
	CurrentlyLocked                = 5,
	OverflowSchematic              = 6,
	EFortCraftFailCause_MAX        = 7
};


// Enum FortniteGame.EKeepContainerType
enum class EKeepContainerType : uint8_t
{
	Base                           = 0,
	Storeroom                      = 1,
	FirstAid                       = 2,
	Armory                         = 3,
	Workshop                       = 4,
	AmmoStash                      = 5,
	Max                            = 6
};


// Enum FortniteGame.EFortIndicatorState
enum class EFortIndicatorState : uint8_t
{
	Hidden                         = 0,
	OnlyFriendsVisible             = 1,
	Visible                        = 2,
	EFortIndicatorState_MAX        = 3
};


// Enum FortniteGame.EReadyCheckState
enum class EReadyCheckState : uint8_t
{
	CheckStarted                   = 0,
	Ready                          = 1,
	NotReady                       = 2,
	EReadyCheckState_MAX           = 3
};


// Enum FortniteGame.ERichPresenceStateChange
enum class ERichPresenceStateChange : uint8_t
{
	AutoUpdate                     = 0,
	Idle                           = 1,
	Active                         = 2,
	Busy                           = 3,
	NotBusy                        = 4,
	ERichPresenceStateChange_MAX   = 5
};


// Enum FortniteGame.EFortTeamAffiliation
enum class EFortTeamAffiliation : uint8_t
{
	Friendly                       = 0,
	Neutral                        = 1,
	Hostile                        = 2,
	EFortTeamAffiliation_MAX       = 3
};


// Enum FortniteGame.EFortAIUtility
enum class EFortAIUtility : uint8_t
{
	KillPlayersMelee               = 0,
	KillPlayersRanged              = 1,
	KillPlayersArtillery           = 2,
	DestroyBuildingsMelee          = 3,
	DestroyBuildingsRanged         = 4,
	DestroyBuildingsArtillery      = 5,
	DestroyTraps                   = 6,
	Tank                           = 7,
	Infiltrate                     = 8,
	Mob                            = 9,
	Support                        = 10,
	Kiting                         = 11,
	AreaOfDenial                   = 12,
	DisableTraps                   = 13,
	Dormant                        = 14,
	Assassin                       = 15,
	MAX                            = 16
};


// Enum FortniteGame.EFortTileEdgeType
enum class EFortTileEdgeType : uint8_t
{
	Undefined                      = 0,
	Outer_1                        = 1,
	Transition_2                   = 2,
	Inner_3                        = 3,
	Border_4                       = 4,
	BorderTransitionSingle_5       = 5,
	BorderTransitionDouble_6       = 6,
	MAX                            = 7
};


// Enum FortniteGame.EFortRequestedGameplayAction
enum class EFortRequestedGameplayAction : uint8_t
{
	ContinuePlaying                = 0,
	StartPlaying                   = 1,
	StopPlaying                    = 2,
	EnterZone                      = 3,
	LeaveZone                      = 4,
	ReturnToMainMenu               = 5,
	QuitGame                       = 6,
	Invalid                        = 7,
	EFortRequestedGameplayAction_MAX = 8
};


// Enum FortniteGame.EFortGameplayState
enum class EFortGameplayState : uint8_t
{
	NormalGameplay                 = 0,
	WaitingToStart                 = 1,
	EndOfZone                      = 2,
	EnteringZone                   = 3,
	LeavingZone                    = 4,
	Invalid                        = 5,
	EFortGameplayState_MAX         = 6
};


// Enum FortniteGame.EFortMovementUrgency
enum class EFortMovementUrgency : uint8_t
{
	None                           = 0,
	Low                            = 1,
	Medium                         = 2,
	High                           = 3,
	NumLevels                      = 4,
	EFortMovementUrgency_MAX       = 5
};


// Enum FortniteGame.EFortMovementStyle
enum class EFortMovementStyle : uint8_t
{
	Running                        = 0,
	Walking                        = 1,
	Charging                       = 2,
	Sprinting                      = 3,
	PersonalVehicle                = 4,
	EFortMovementStyle_MAX         = 5
};


// Enum FortniteGame.EFortWeaponReloadType
enum class EFortWeaponReloadType : uint8_t
{
	ReloadWholeClip                = 0,
	ReloadIndividualBullets        = 1,
	ReloadBasedOnAmmoCostPerFire   = 2,
	ReloadBasedOnCartridgePerFire  = 3,
	EFortWeaponReloadType_MAX      = 4
};


// Enum FortniteGame.EFortWeaponTriggerType
enum class EFortWeaponTriggerType : uint8_t
{
	OnPress                        = 0,
	Automatic                      = 1,
	OnRelease                      = 2,
	OnPressAndRelease              = 3,
	EFortWeaponTriggerType_MAX     = 4
};


// Enum FortniteGame.EFortJumpStaminaCost
enum class EFortJumpStaminaCost : uint8_t
{
	None                           = 0,
	Trigger                        = 1,
	SprintTrigger                  = 2,
	SprintAir                      = 3,
	EFortJumpStaminaCost_MAX       = 4
};


// Enum FortniteGame.EFortDayPhasePrio
enum class EFortDayPhasePrio : uint8_t
{
	Default                        = 0,
	DailySummary                   = 1,
	EFortDayPhasePrio_MAX          = 2
};


// Enum FortniteGame.EFortCustomBodyType
enum class EFortCustomBodyType : uint8_t
{
	Small                          = 0,
	Medium                         = 1,
	MediumAndSmall                 = 2,
	Large                          = 3,
	LargeAndSmall                  = 4,
	LargeAndMedium                 = 5,
	All                            = 6,
	Deprecated                     = 7,
	EFortCustomBodyType_MAX        = 8
};


// Enum FortniteGame.EFortDisplayGender
enum class EFortDisplayGender : uint8_t
{
	Unknown                        = 0,
	Male                           = 1,
	Female                         = 2,
	NumTypes                       = 3,
	EFortDisplayGender_MAX         = 4
};


// Enum FortniteGame.EFortCustomGender
enum class EFortCustomGender : uint8_t
{
	Invalid                        = 0,
	Male                           = 1,
	Female                         = 2,
	Both                           = 3,
	EFortCustomGender_MAX          = 4
};


// Enum FortniteGame.EFortCompletionResult
enum class EFortCompletionResult : uint8_t
{
	Win                            = 0,
	Loss                           = 1,
	Draw                           = 2,
	Undefined                      = 3,
	EFortCompletionResult_MAX      = 4
};


// Enum FortniteGame.EFortPvPGameResult
enum class EFortPvPGameResult : uint8_t
{
	Win                            = 0,
	Loss                           = 1,
	Draw                           = 2,
	EFortPvPGameResult_MAX         = 3
};


// Enum FortniteGame.EFortItemTier
enum class EFortItemTier : uint8_t
{
	No_Tier                        = 0,
	I                              = 1,
	II                             = 2,
	III                            = 3,
	IV                             = 4,
	V                              = 5,
	VI                             = 6,
	VII                            = 7,
	VIII                           = 8,
	IX                             = 9,
	X                              = 10,
	NumItemTierValues              = 11,
	EFortItemTier_MAX              = 12
};


// Enum FortniteGame.EFortQuality
enum class EFortQuality : uint8_t
{
	Common                         = 0,
	Uncommon                       = 1,
	Rare                           = 2,
	NumQualityValues               = 3,
	EFortQuality_MAX               = 4
};


// Enum FortniteGame.EFortRarity
enum class EFortRarity : uint8_t
{
	Handmade                       = 0,
	Ordinary                       = 1,
	Sturdy                         = 2,
	Quality                        = 3,
	Fine                           = 4,
	Elegant                        = 5,
	Masterwork                     = 6,
	Epic                           = 7,
	Badass                         = 8,
	Legendary                      = 9,
	NumRarityValues                = 10,
	EFortRarity_MAX                = 11
};


// Enum FortniteGame.EFortTargetSelectionFilter
enum class EFortTargetSelectionFilter : uint8_t
{
	Damageable                     = 0,
	Everything                     = 1,
	Pawns                          = 2,
	Buildings                      = 3,
	Walls                          = 4,
	Traps                          = 5,
	Players                        = 6,
	AIPawns                        = 7,
	Instigator                     = 8,
	WeakSpots                      = 9,
	World                          = 10,
	Max                            = 11
};


// Enum FortniteGame.EFortTargetSelectionTestType
enum class EFortTargetSelectionTestType : uint8_t
{
	Overlap                        = 0,
	Swept                          = 1,
	Ballistic                      = 2,
	EFortTargetSelectionTestType_MAX = 3
};


// Enum FortniteGame.EFortTargetSelectionShape
enum class EFortTargetSelectionShape : uint8_t
{
	Sphere                         = 0,
	Cone                           = 1,
	Box                            = 2,
	Capsule                        = 3,
	Line                           = 4,
	Custom                         = 5,
	EFortTargetSelectionShape_MAX  = 6
};


// Enum FortniteGame.EFortBrushSize
enum class EFortBrushSize : uint8_t
{
	VeryVerySmall                  = 0,
	VerySmall                      = 1,
	Small                          = 2,
	Medium                         = 3,
	Large                          = 4,
	VeryLarge                      = 5,
	EFortBrushSize_MAX             = 6
};


// Enum FortniteGame.EFortInventoryCustomFilter
enum class EFortInventoryCustomFilter : uint8_t
{
	Mythic                         = 0,
	Legendary                      = 1,
	Epic                           = 2,
	Rare                           = 3,
	Uncommon                       = 4,
	Common                         = 5,
	EFortInventoryCustomFilter_MAX = 6
};


// Enum FortniteGame.EInventoryContentSortType
enum class EInventoryContentSortType : uint8_t
{
	ByName                         = 0,
	ByRating                       = 1,
	ByLevel                        = 2,
	ByCategory                     = 3,
	ByRarity                       = 4,
	ByLocation                     = 5,
	ByPersonality                  = 6,
	ByBonus                        = 7,
	BySubtype                      = 8,
	EInventoryContentSortType_MAX  = 9
};


// Enum FortniteGame.EFortFrontendInventoryFilter
enum class EFortFrontendInventoryFilter : uint8_t
{
	Schematics                     = 0,
	WorldItems                     = 1,
	WorldItemsInGame               = 2,
	WorldItemsStorage              = 3,
	WorldItemsTransfer             = 4,
	ConsumablesAndAccountResources = 5,
	Heroes                         = 6,
	Defenders                      = 7,
	Survivors                      = 8,
	Invisible                      = 9,
	Max_None                       = 10,
	EFortFrontendInventoryFilter_MAX = 11
};


// Enum FortniteGame.EFortInventoryFilter
enum class EFortInventoryFilter : uint8_t
{
	WeaponMelee                    = 0,
	WeaponRanged                   = 1,
	Ammo                           = 2,
	Traps                          = 3,
	Consumables                    = 4,
	Ingredients                    = 5,
	Gadget                         = 6,
	Decorations                    = 7,
	Badges                         = 8,
	Heroes                         = 9,
	LeadSurvivors                  = 10,
	Survivors                      = 11,
	Defenders                      = 12,
	Resources                      = 13,
	ConversionControl              = 14,
	AthenaCosmetics                = 15,
	Invisible                      = 16,
	Max_None                       = 17,
	EFortInventoryFilter_MAX       = 18
};


// Enum FortniteGame.EFortItemCategoryOrdinal
enum class EFortItemCategoryOrdinal : uint8_t
{
	Primary                        = 0,
	Secondary                      = 1,
	Tertiary                       = 2,
	EFortItemCategoryOrdinal_MAX   = 3
};


// Enum FortniteGame.ESubGameMatchmakingStatus
enum class ESubGameMatchmakingStatus : uint8_t
{
	Disabled                       = 0,
	Enabled                        = 1,
	ESubGameMatchmakingStatus_MAX  = 2
};


// Enum FortniteGame.ESubGameAccessStatus
enum class ESubGameAccessStatus : uint8_t
{
	Disabled                       = 0,
	LimitedAccess                  = 1,
	OpenAccess                     = 2,
	ESubGameAccessStatus_MAX       = 3
};


// Enum FortniteGame.ESubGame
enum class ESubGame : uint8_t
{
	Campaign                       = 0,
	Athena                         = 1,
	Invalid                        = 2,
	Count                          = 3,
	ESubGame_MAX                   = 4
};


// Enum FortniteGame.EFortUIFriendNotificationType
enum class EFortUIFriendNotificationType : uint8_t
{
	Default                        = 0,
	FriendRequest                  = 1,
	PartyInvite                    = 2,
	EFortUIFriendNotificationType_MAX = 3
};


// Enum FortniteGame.EFortNotificationPriority
enum class EFortNotificationPriority : uint8_t
{
	Friend                         = 0,
	BoostedXP                      = 1,
	TwitchHigh                     = 2,
	GeneralSendNotification        = 3,
	TwitchLow                      = 4,
	Max                            = 5
};


// Enum FortniteGame.EFortNotificationType
enum class EFortNotificationType : uint8_t
{
	Default                        = 0,
	Power                          = 1,
	HealthWarning                  = 2,
	Max                            = 3
};


// Enum FortniteGame.EFortContextualReticleTypes
enum class EFortContextualReticleTypes : uint8_t
{
	FCR_GenericFailure             = 0,
	FCR_Upgrade                    = 1,
	FCR_Repair                     = 2,
	FCR_Locked                     = 3,
	FCR_Placement                  = 4,
	FCR_Edit                       = 5,
	FCR_NoTarget                   = 6,
	FCR_InProgress                 = 7,
	FCR_None                       = 8,
	FCR_MAX                        = 9
};


// Enum FortniteGame.EFortUserCloudRequestResult
enum class EFortUserCloudRequestResult : uint8_t
{
	Success                        = 0,
	Failure_CloudStorageDisabled   = 1,
	Failure_CloudStorageError      = 2,
	Failure_FileNotFoundInUserFileList = 3,
	Failure_SavingNotAllowedForSpecifiedUser = 4,
	EFortUserCloudRequestResult_MAX = 5
};


// Enum FortniteGame.EFortUserCloudRequestType
enum class EFortUserCloudRequestType : uint8_t
{
	LoadCloudFile                  = 0,
	SaveCloudFile                  = 1,
	EFortUserCloudRequestType_MAX  = 2
};


// Enum FortniteGame.EVehicleAudioTriggerDir
enum class EVehicleAudioTriggerDir : uint8_t
{
	Forward                        = 0,
	Backward                       = 1,
	EVehicleAudioTriggerDir_MAX    = 2
};


// Enum FortniteGame.EVehicleAudioInterpolationType
enum class EVehicleAudioInterpolationType : uint8_t
{
	None                           = 0,
	CustomCurve                    = 1,
	Linear                         = 2,
	EVehicleAudioInterpolationType_MAX = 3
};


// Enum FortniteGame.EFortVisibilityBehavior
enum class EFortVisibilityBehavior : uint8_t
{
	Proximity                      = 0,
	OnceSeenAlwaysSeen             = 1,
	AlwaysSeen                     = 2,
	Invalid                        = 3,
	EFortVisibilityBehavior_MAX    = 4
};


// Enum FortniteGame.EFortReloadMontageSection
enum class EFortReloadMontageSection : uint8_t
{
	Intro                          = 0,
	Loop                           = 1,
	Outro                          = 2,
	EFortReloadMontageSection_MAX  = 3
};


// Enum FortniteGame.EFortDisplayTier
enum class EFortDisplayTier : uint8_t
{
	Invalid                        = 0,
	Handmade                       = 1,
	Copper                         = 2,
	Silver                         = 3,
	Malachite                      = 4,
	Obsidian                       = 5,
	Brightcore                     = 6,
	Spectrolite                    = 7,
	Shadowshard                    = 8,
	Sunbeam                        = 9,
	Moonglow                       = 10,
	EFortDisplayTier_MAX           = 11
};


// Enum FortniteGame.EWorldItemDropBehavior
enum class EWorldItemDropBehavior : uint8_t
{
	DropAsPickup                   = 0,
	DestroyOnDrop                  = 1,
	DropAsPickupDestroyOnEmpty     = 2,
	EWorldItemDropBehavior_MAX     = 3
};


// Enum FortniteGame.EFortWorldManagerState
enum class EFortWorldManagerState : uint8_t
{
	WMS_Created                    = 0,
	WMS_QueryingWorld              = 1,
	WMS_WorldQueryComplete         = 2,
	WMS_CreatingNewWorld           = 3,
	WMS_LoadingExistingWorld       = 4,
	WMS_Running                    = 5,
	WMS_Failed                     = 6,
	WMS_MAX                        = 7
};


// Enum FortniteGame.EFortLevelStreamingState
enum class EFortLevelStreamingState : uint8_t
{
	LSS_Unloaded                   = 0,
	LSS_Loaded                     = 1,
	LSS_UnconditionalFoundationsUpdated = 2,
	LSS_AllFoundationsUpdated      = 3,
	LSS_NewActorsCreatedButNotUpdated = 4,
	LSS_AllUpdated                 = 5,
	LSS_Ready                      = 6,
	LSS_MAX                        = 7
};


// Enum FortniteGame.EFortQueuedActionUserStatus
enum class EFortQueuedActionUserStatus : uint8_t
{
	Succeeded                      = 0,
	Failed                         = 1,
	WaitingForCloudRequest         = 2,
	WaitingForProfileSave          = 3,
	EFortQueuedActionUserStatus_MAX = 4
};


// Enum FortniteGame.EFortWorldRecordState
enum class EFortWorldRecordState : uint8_t
{
	StartProcessing                = 0,
	WaitingForResponse             = 1,
	RetrievingTheaterInformation   = 2,
	RetrievingZoneInformation      = 3,
	LoadingWorldRecord             = 4,
	LoadingZoneRecord              = 5,
	SavingZoneRecord               = 6,
	SavingPlayerProfiles           = 7,
	SavingPlayerDeployableBases    = 8,
	Succeeded                      = 9,
	Failed                         = 10,
	Max_None                       = 11,
	EFortWorldRecordState_MAX      = 12
};


// Enum FortniteGame.EFortWorldRecordAction
enum class EFortWorldRecordAction : uint8_t
{
	LoadWorldOnly                  = 0,
	SaveWorldOnly                  = 1,
	SaveZoneAndWorld               = 2,
	LoadZoneAndWorld               = 3,
	SaveDeployableBasesAndWorld    = 4,
	Max_None                       = 5,
	EFortWorldRecordAction_MAX     = 6
};


// Enum FortniteGame.EDeployableBaseUseType
enum class EDeployableBaseUseType : uint8_t
{
	Neighborhood                   = 0,
	PvECombat                      = 1,
	EDeployableBaseUseType_MAX     = 2
};


// Enum FortniteGame.EFortZoneType
enum class EFortZoneType : uint8_t
{
	PVE                            = 0,
	PVP                            = 1,
	Keep                           = 2,
	SingleZone                     = 3,
	Max_None                       = 4,
	EFortZoneType_MAX              = 5
};


// Enum FortniteGame.EFrontEndCamera
enum class EFrontEndCamera : uint8_t
{
	Invalid                        = 0,
	HomeBase                       = 1,
	MissionControl                 = 2,
	Store                          = 3,
	Vault                          = 4,
	SkillTrees                     = 5,
	Heroes                         = 6,
	Login                          = 7,
	TutorialPhaseOne               = 8,
	TutorialPhaseTwo               = 9,
	TutorialPhaseThree             = 10,
	HeroSelect                     = 11,
	Party                          = 12,
	WorldMap                       = 13,
	Home                           = 14,
	StoreItemInspect               = 15,
	Cosmetics                      = 16,
	SmallCosmetics                 = 17,
	SpecialEvent                   = 18,
	EFrontEndCamera_MAX            = 19
};


// Enum FortniteGame.EFortEncounterSpawnLimitType
enum class EFortEncounterSpawnLimitType : uint8_t
{
	NoLimit                        = 0,
	NumPawnsLimit                  = 1,
	SpawnPointLimit                = 2,
	UserDefined                    = 3,
	MAX                            = 4
};


// Enum FortniteGame.EFortEncounterUtilitiesMode
enum class EFortEncounterUtilitiesMode : uint8_t
{
	LockedOnly                     = 0,
	LockedAndFree                  = 1,
	EFortEncounterUtilitiesMode_MAX = 2
};


// Enum FortniteGame.EFortEncounterSpawnLocationPlacementMode
enum class EFortEncounterSpawnLocationPlacementMode : uint8_t
{
	Directional                    = 0,
	Ring                           = 1,
	Volume                         = 2,
	Custom                         = 3,
	Max_None                       = 4,
	EFortEncounterSpawnLocationPlacementMode_MAX = 5
};


// Enum FortniteGame.EFortEncounterPacingMode
enum class EFortEncounterPacingMode : uint8_t
{
	SpawnPointsPercentageCurve     = 0,
	IntensityCurve                 = 1,
	Burst                          = 2,
	EFortEncounterPacingMode_MAX   = 3
};


// Enum FortniteGame.EFortMissionAudibility
enum class EFortMissionAudibility : uint8_t
{
	UseVisibility                  = 0,
	Audible                        = 1,
	Inaudible                      = 2,
	EFortMissionAudibility_MAX     = 3
};


// Enum FortniteGame.EFortMissionType
enum class EFortMissionType : uint8_t
{
	Primary                        = 0,
	Secondary                      = 1,
	Max_None                       = 2,
	EFortMissionType_MAX           = 3
};


// Enum FortniteGame.EFortObjectiveRequirement
enum class EFortObjectiveRequirement : uint8_t
{
	Optional                       = 0,
	Required                       = 1,
	RequiredButCanFail             = 2,
	EFortObjectiveRequirement_MAX  = 3
};


// Enum FortniteGame.EFortMissionStatus
enum class EFortMissionStatus : uint8_t
{
	Created                        = 0,
	InProgress                     = 1,
	Succeeded                      = 2,
	Failed                         = 3,
	NeutralCompletion              = 4,
	Quit                           = 5,
	Max_None                       = 6,
	EFortMissionStatus_MAX         = 7
};


// Enum FortniteGame.EMissionGenerationCategory
enum class EMissionGenerationCategory : uint8_t
{
	Primary                        = 0,
	Secondary                      = 1,
	Tertiary                       = 2,
	Survivor                       = 3,
	Max_None                       = 4,
	EMissionGenerationCategory_MAX = 5
};


// Enum FortniteGame.EStatRecordingPeriod
enum class EStatRecordingPeriod : uint8_t
{
	Minute                         = 0,
	Life                           = 1,
	Map                            = 2,
	Campaign                       = 3,
	Persistent                     = 4,
	Max                            = 5
};


// Enum FortniteGame.EStatMod
enum class EStatMod : uint8_t
{
	Delta                          = 0,
	Set                            = 1,
	Maximum                        = 2,
	EStatMod_MAX                   = 3
};


// Enum FortniteGame.EFortStrategicBuildingLevelCriteriaDisplayRepresentation
enum class EFortStrategicBuildingLevelCriteriaDisplayRepresentation : uint8_t
{
	Integer                        = 0,
	Float                          = 1,
	EFortStrategicBuildingLevelCriteriaDisplayRepresentation_MAX = 2
};


// Enum FortniteGame.EFortStrategicBuildingCategory
enum class EFortStrategicBuildingCategory : uint8_t
{
	Defensive                      = 0,
	Offensive                      = 1,
	Utility                        = 2,
	EFortStrategicBuildingCategory_MAX = 3
};


// Enum FortniteGame.EFortThreatDeactivationType
enum class EFortThreatDeactivationType : uint8_t
{
	Off                            = 0,
	Dormant                        = 1,
	EFortThreatDeactivationType_MAX = 2
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct FortniteGame.AIHotSpotSlotConfig
// 0x001C
struct FAIHotSpotSlotConfig
{
	struct FVector                                     Offset;                                                   // 0x0000(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     Direction;                                                // 0x000C(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	EFortHotSpotSlot                                   SlotType;                                                 // 0x0018(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0019(0x0003) MISSED OFFSET
};

// ScriptStruct FortniteGame.AIHotSpotSlotInfo
// 0x0010
struct FAIHotSpotSlotInfo
{
	class AAIHotSpot*                                  HotSpot;                                                  // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	int                                                SlotIndex;                                                // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.AIHotSpotUseInfo
// 0x0008 (0x0018 - 0x0010)
struct FAIHotSpotUseInfo : public FAIHotSpotSlotInfo
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0010(0x0008) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortItemQuantityPair
// 0x0030
struct FFortItemQuantityPair
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty FortniteGame.FortItemQuantityPair.ItemDefinition
	int                                                Quantity;                                                 // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.AthenaCosmeticMaterialOverride
// 0x0038
struct FAthenaCosmeticMaterialOverride
{
	struct FName                                       ComponentName;                                            // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                MaterialOverrideIndex;                                    // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                ProgressionThreshold;                                     // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x28];                                      // 0x0010(0x0028) UNKNOWN PROPERTY: SoftObjectProperty FortniteGame.AthenaCosmeticMaterialOverride.OverrideMaterial
};

// ScriptStruct FortniteGame.FortMultiSizeBrush
// 0x0330
struct FFortMultiSizeBrush
{
	struct FSlateBrush                                 Brush_XXS;                                                // 0x0000(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSlateBrush                                 Brush_XS;                                                 // 0x0088(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSlateBrush                                 Brush_S;                                                  // 0x0110(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSlateBrush                                 Brush_M;                                                  // 0x0198(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSlateBrush                                 Brush_L;                                                  // 0x0220(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FSlateBrush                                 Brush_XL;                                                 // 0x02A8(0x0088) (Edit, BlueprintVisible, BlueprintReadOnly)
};

// ScriptStruct FortniteGame.FortAlterationSlotStatus
// 0x0010
struct FFortAlterationSlotStatus
{
	class UFortAlterationItemDefinition*               Alteration;                                               // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData)
	int                                                MinRequiredLevel;                                         // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAttributeInitializationKey
// 0x0010
struct FFortAttributeInitializationKey
{
	struct FName                                       AttributeInitCategory;                                    // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       AttributeInitSubCategory;                                 // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct FortniteGame.FortTooltipValueData
// 0x0070
struct FFortTooltipValueData
{
	struct FText                                       DisplayName;                                              // 0x0000(0x0018) (Edit, BlueprintVisible)
	struct FText                                       FormattedValue;                                           // 0x0018(0x0018) (Edit, BlueprintVisible)
	struct FText                                       ExplanationText;                                          // 0x0030(0x0018) (Edit, BlueprintVisible)
	float                                              Value;                                                    // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x004C(0x0004) MISSED OFFSET
	struct FGameplayTagContainer                       StateTags;                                                // 0x0050(0x0020) (Edit, BlueprintVisible)
};

// ScriptStruct FortniteGame.GameplayTagMessage
// 0x0038
struct FGameplayTagMessage
{
	struct FGameplayTagContainer                       Tags;                                                     // 0x0000(0x0020) (Edit)
	struct FText                                       Text;                                                     // 0x0020(0x0018) (Edit)
};

// ScriptStruct FortniteGame.AthenaLevelInfo
// 0x0024
struct FAthenaLevelInfo
{
	int                                                AccountLevel;                                             // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                Level;                                                    // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                MaxLevel;                                                 // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                LevelXp;                                                  // 0x000C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                LevelXpForLevel;                                          // 0x0010(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                BookLevel;                                                // 0x0014(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                BookMaxLevel;                                             // 0x0018(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                BookLevelXp;                                              // 0x001C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                BookLevelXpForLevel;                                      // 0x0020(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.AthenaMatchStats
// 0x0074
struct FAthenaMatchStats
{
	int                                                SecondsAlive;                                             // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                Kills;                                                    // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                Downs;                                                    // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                Assists;                                                  // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                Revives;                                                  // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                DamageDealtToHostiles;                                    // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                DamageDealtToFriends;                                     // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                DamageDealtToStructures;                                  // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                DamageTaken;                                              // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                RangedShots;                                              // 0x0024(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                RangedHit;                                                // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              Accuracy;                                                 // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                TravelDistanceGround;                                     // 0x0030(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                GatheredWood;                                             // 0x0034(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                GatheredStone;                                            // 0x0038(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                GatheredMetal;                                            // 0x003C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                MaterialsGathered;                                        // 0x0040(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                UsedWood;                                                 // 0x0044(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                UsedStone;                                                // 0x0048(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                UsedMetal;                                                // 0x004C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                MaterialsUsed;                                            // 0x0050(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                NormalDamageToHostiles;                                   // 0x0054(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                NormalDamageToFriends;                                    // 0x0058(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                CriticalDamageToHostiles;                                 // 0x005C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                CriticalDamageToFriends;                                  // 0x0060(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                NormalHitsToHostiles;                                     // 0x0064(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                NormalHitsToFriends;                                      // 0x0068(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                CriticalHitsToHostiles;                                   // 0x006C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                CriticalHitsToFriends;                                    // 0x0070(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.AthenaMatchTeamStats
// 0x0008
struct FAthenaMatchTeamStats
{
	int                                                Place;                                                    // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                TotalPlayers;                                             // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.AthenaMatchXpMultiplierGroup
// 0x0008
struct FAthenaMatchXpMultiplierGroup
{
	EAthenaMatchXpMultiplierSource                     Source;                                                   // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                Amount;                                                   // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.AthenaAwardGroup
// 0x0028
struct FAthenaAwardGroup
{
	ERewardSource                                      RewardSource;                                             // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	TArray<struct FMcpLootEntry>                       Items;                                                    // 0x0008(0x0010) (ZeroConstructor)
	int                                                Score;                                                    // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              SeasonXp;                                                 // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                BookXp;                                                   // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.AthenaRewardResult
// 0x0040
struct FAthenaRewardResult
{
	int                                                LevelsGained;                                             // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                BookLevelsGained;                                         // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                TotalSeasonXpGained;                                      // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                TotalBookXpGained;                                        // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PrePenaltySeasonXpGained;                                 // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	TArray<struct FAthenaMatchXpMultiplierGroup>       XpMultipliers;                                            // 0x0018(0x0010) (ZeroConstructor)
	TArray<struct FAthenaAwardGroup>                   Rewards;                                                  // 0x0028(0x0010) (ZeroConstructor)
	float                                              AntiAddictionMultiplier;                                  // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.AthenaTravelLogEntry
// 0x0014
struct FAthenaTravelLogEntry
{
	float                                              Time;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     Position;                                                 // 0x0004(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	EAthenaTravelEventType                             Type;                                                     // 0x0010(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
};

// ScriptStruct FortniteGame.AthenaTravelRecord
// 0x0010
struct FAthenaTravelRecord
{
	TArray<struct FAthenaTravelLogEntry>               Log;                                                      // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct FortniteGame.AthenaMatchXpReward
// 0x0020
struct FAthenaMatchXpReward
{
	struct FText                                       Text;                                                     // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	int                                                Amount;                                                   // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.AthenaMatchLootReward
// 0x0018
struct FAthenaMatchLootReward
{
	struct FString                                     TemplateId;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	int                                                Amount;                                                   // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.AthenaQuickChatLeafEntry
// 0x00D8
struct FAthenaQuickChatLeafEntry
{
	struct FText                                       Label;                                                    // 0x0000(0x0018) (Edit, DisableEditOnInstance)
	struct FText                                       FullChatMessage;                                          // 0x0018(0x0018) (Edit, DisableEditOnInstance)
	struct FSlateBrush                                 Brush;                                                    // 0x0030(0x0088) (Edit, DisableEditOnInstance)
	bool                                               bPopulateBrushFromContextObject;                          // 0x00B8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EAthenaQuickChatFilteringType                      FilterType;                                               // 0x00B9(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x00BA(0x0006) MISSED OFFSET
	class UAthenaEmojiItemDefinition*                  EmojiItemDefinition;                                      // 0x00C0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	ETeamMemberState                                   TeamCommType;                                             // 0x00C8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x00C9(0x0007) MISSED OFFSET
	struct FGameplayTag                                OptionGameplayTag;                                        // 0x00D0(0x0008) (Edit, DisableEditOnInstance)
};

// ScriptStruct FortniteGame.AthenaRewardItemReference
// 0x0040
struct FAthenaRewardItemReference
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty FortniteGame.AthenaRewardItemReference.ItemDefinition
	struct FString                                     TemplateId;                                               // 0x0028(0x0010) (Edit, ZeroConstructor)
	int                                                Quantity;                                                 // 0x0038(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               IsChaseReward;                                            // 0x003C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x003D(0x0003) MISSED OFFSET
};

// ScriptStruct FortniteGame.AthenaRewardScheduleLevel
// 0x0010
struct FAthenaRewardScheduleLevel
{
	TArray<struct FAthenaRewardItemReference>          Rewards;                                                  // 0x0000(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct FortniteGame.AthenaRewardSchedule
// 0x0010
struct FAthenaRewardSchedule
{
	TArray<struct FAthenaRewardScheduleLevel>          Levels;                                                   // 0x0000(0x0010) (Edit, EditFixedSize, ZeroConstructor)
};

// ScriptStruct FortniteGame.AthenaSeasonBannerLevel
// 0x0050
struct FAthenaSeasonBannerLevel
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty FortniteGame.AthenaSeasonBannerLevel.SurroundImage
	unsigned char                                      UnknownData01[0x28];                                      // 0x0028(0x0028) UNKNOWN PROPERTY: SoftObjectProperty FortniteGame.AthenaSeasonBannerLevel.BannerMaterial
};

// ScriptStruct FortniteGame.AthenaSeasonBannerLevelSchedule
// 0x0010
struct FAthenaSeasonBannerLevelSchedule
{
	TArray<struct FAthenaSeasonBannerLevel>            Levels;                                                   // 0x0000(0x0010) (Edit, EditFixedSize, ZeroConstructor)
};

// ScriptStruct FortniteGame.AthenaWeaponAlterationRule
// 0x0058
struct FAthenaWeaponAlterationRule
{
	struct FGameplayTagQuery                           MatchCriteria;                                            // 0x0000(0x0048) (Edit)
	TArray<class UFortAlterationItemDefinition*>       Alterations;                                              // 0x0048(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct FortniteGame.FortGiftingInfo
// 0x0028
struct FFortGiftingInfo
{
	struct FString                                     PlayerName;                                               // 0x0000(0x0010) (ZeroConstructor)
	class UFortHeroType*                               HeroType;                                                 // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0018(0x0010) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortItemEntryStateValue
// 0x0018
struct FFortItemEntryStateValue
{
	int                                                IntValue;                                                 // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FName                                       NameValue;                                                // 0x0008(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TEnumAsByte<EFortItemEntryState>                   StateType;                                                // 0x0010(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0011(0x0007) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortItemEntry
// 0x00BC (0x00C8 - 0x000C)
struct FFortItemEntry : public FFastArraySerializerItem
{
	int                                                Count;                                                    // 0x000C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData)
	int                                                PreviousCount;                                            // 0x0010(0x0004) (ZeroConstructor, Transient, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	class UFortItemDefinition*                         ItemDefinition;                                           // 0x0018(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData)
	float                                              Durability;                                               // 0x0020(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData)
	int                                                Level;                                                    // 0x0024(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData)
	int                                                LoadedAmmo;                                               // 0x0028(0x0004) (ZeroConstructor, SaveGame, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	TArray<struct FString>                             AlterationDefinitions;                                    // 0x0030(0x0010) (ZeroConstructor, SaveGame)
	struct FString                                     ItemSource;                                               // 0x0040(0x0010) (ZeroConstructor, SaveGame)
	struct FGuid                                       ItemGuid;                                                 // 0x0050(0x0010) (SaveGame, IsPlainOldData)
	bool                                               inventory_overflow_date;                                  // 0x0060(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData)
	bool                                               bIsReplicatedCopy;                                        // 0x0061(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsDirty;                                                 // 0x0062(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x5];                                       // 0x0063(0x0005) MISSED OFFSET
	struct FFortGiftingInfo                            GiftingInfo;                                              // 0x0068(0x0028)
	TArray<struct FFortItemEntryStateValue>            StateValues;                                              // 0x0090(0x0010) (ZeroConstructor, Transient)
	TWeakObjectPtr<class AFortInventory>               ParentInventory;                                          // 0x00A0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FGameplayAbilitySpecHandle                  GameplayAbilitySpecHandle;                                // 0x00A8(0x0004) (Transient)
	unsigned char                                      UnknownData03[0x4];                                       // 0x00AC(0x0004) MISSED OFFSET
	TArray<class UFortAlterationItemDefinition*>       AlterationInstances;                                      // 0x00B0(0x0010) (ZeroConstructor, Transient)
	float                                              GenericAttributeValue;                                    // 0x00C0(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x00C4(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.BuildingActorHotSpotDirection
// 0x0020
struct FBuildingActorHotSpotDirection
{
	class UAIHotSpotConfig*                            HotSpotConfig;                                            // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     Offset;                                                   // 0x0008(0x000C) (Edit, IsPlainOldData)
	unsigned char                                      bMirrorX : 1;                                             // 0x0014(0x0001) (Edit)
	unsigned char                                      bMirrorY : 1;                                             // 0x0014(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
	EFortHotSpotDirection                              Direction;                                                // 0x0018(0x0001) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	EHotspotTypeConfigMode                             TypeConfigUsage;                                          // 0x0019(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x001A(0x0006) MISSED OFFSET
};

// ScriptStruct FortniteGame.MeshSet
// 0x0060
struct FMeshSet
{
	float                                              Weight;                                                   // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EFortResourceType>                     ResourceType;                                             // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bDoNotBlockBuildings : 1;                                 // 0x0005(0x0001) (Edit, BlueprintVisible, DisableEditOnInstance)
	unsigned char                                      bDestroyOnPlayerBuildingPlacement : 1;                    // 0x0005(0x0001) (Edit, BlueprintVisible, DisableEditOnInstance)
	unsigned char                                      bNeedsDamageOverlay : 1;                                  // 0x0005(0x0001) (Edit, BlueprintVisible, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0006(0x0002) MISSED OFFSET
	class UStaticMesh*                                 BaseMesh;                                                 // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UParticleSystem*                             BreakEffect;                                              // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UParticleSystem*                             DeathParticles;                                           // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       DeathParticleSocketName;                                  // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundBase*                                  DeathSound;                                               // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UParticleSystem*                             ConstructedEffect;                                        // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UStaticMesh*                                 SearchedMesh;                                             // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FCurveTableRowHandle                        SearchSpeed;                                              // 0x0040(0x0010) (Edit, BlueprintVisible, DisableEditOnInstance)
	float                                              LootNoiseRange;                                           // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     LootSpawnLocation;                                        // 0x0054(0x000C) (Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct FortniteGame.TierMeshSets
// 0x0018
struct FTierMeshSets
{
	int                                                Tier;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<struct FMeshSet>                            MeshSets;                                                 // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct FortniteGame.FortBounceData
// 0x0030
struct FFortBounceData
{
	float                                              StartTime;                                                // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              BounceValue;                                              // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	float                                              Radius;                                                   // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	struct FLinearColor                                DeformationVector;                                        // 0x000C(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData)
	struct FLinearColor                                DeformationCenter;                                        // 0x001C(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData)
	TEnumAsByte<EFortBounceType>                       BounceType;                                               // 0x002C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x002D(0x0003) MISSED OFFSET
};

// ScriptStruct FortniteGame.BuildingNavObstacle
// 0x0020
struct FBuildingNavObstacle
{
	struct FBox                                        LocalBounds;                                              // 0x0000(0x001C) (Edit, IsPlainOldData)
	EBuildingNavObstacleType                           ObstacleType;                                             // 0x001C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x001D(0x0003) MISSED OFFSET
};

// ScriptStruct FortniteGame.EditorOnlyBuildingInstanceMaterialParameters
// 0x0030
struct FEditorOnlyBuildingInstanceMaterialParameters
{
	TArray<struct FScalarParameterValue>               ScalarParams;                                             // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
	TArray<struct FVectorParameterValue>               VectorParams;                                             // 0x0010(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
	TArray<struct FTextureParameterValue>              TextureParams;                                            // 0x0020(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
};

// ScriptStruct FortniteGame.ChosenQuotaInfo
// 0x0010
struct FChosenQuotaInfo
{
	int                                                LootTier;                                                 // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FName                                       LootTierKey;                                              // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.RandomDayphaseFX
// 0x0040
struct FRandomDayphaseFX
{
	class UParticleSystem*                             ParticleSystem;                                           // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<class UParticleSystem*>                     AltParticleSystems;                                       // 0x0008(0x0010) (Edit, ZeroConstructor)
	TArray<TEnumAsByte<EFortDayPhase>>                 RequiredDayphases;                                        // 0x0018(0x0010) (Edit, ZeroConstructor)
	float                                              ChanceToSpawnFX;                                          // 0x0028(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EDetailMode>                           DetailMode;                                               // 0x002C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x002D(0x0003) MISSED OFFSET
	float                                              MaxDrawDistance;                                          // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bRandomSelectionAlreadyHappened;                          // 0x0034(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0035(0x0003) MISSED OFFSET
	class UParticleSystemComponent*                    SpawnedComponent;                                         // 0x0038(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
};

// ScriptStruct FortniteGame.FortConnectionData
// 0x0030
struct FFortConnectionData
{
	class ABuildingSMActor*                            ConnectedActor;                                           // 0x0000(0x0008) (ZeroConstructor, SaveGame, IsPlainOldData)
	struct FGuid                                       ConnectedActorGuid;                                       // 0x0008(0x0010) (SaveGame, IsPlainOldData)
	struct FName                                       MySocketName;                                             // 0x0018(0x0008) (ZeroConstructor, SaveGame, IsPlainOldData)
	struct FName                                       TheirSocketName;                                          // 0x0020(0x0008) (ZeroConstructor, SaveGame, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortConnectivityComponentData
// 0x0018
struct FFortConnectivityComponentData
{
	TArray<struct FFortConnectionData>                 Connections;                                              // 0x0000(0x0010) (ZeroConstructor, SaveGame)
	bool                                               bIsPowered;                                               // 0x0010(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData)
	bool                                               bIsProvidingPower;                                        // 0x0011(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData)
	bool                                               bAllowConnections;                                        // 0x0012(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData)
	bool                                               bAllowsPowerToPassThrough;                                // 0x0013(0x0001) (ZeroConstructor, SaveGame, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortDeliveryInfoRequirementsFilter
// 0x0098
struct FFortDeliveryInfoRequirementsFilter
{
	struct FGameplayTagRequirements                    SourceTagRequirements;                                    // 0x0000(0x0040) (Edit, DisableEditOnInstance)
	struct FGameplayTagRequirements                    TargetTagRequirements;                                    // 0x0040(0x0040) (Edit, DisableEditOnInstance)
	TEnumAsByte<EFortTeamAffiliation>                  ApplicableTeamAffiliation;                                // 0x0080(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0081(0x0003) MISSED OFFSET
	unsigned char                                      bConsiderTeamAffiliationToInstigator : 1;                 // 0x0084(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0085(0x0003) MISSED OFFSET
	TEnumAsByte<EFortTeam>                             ApplicableTeam;                                           // 0x0088(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0089(0x0003) MISSED OFFSET
	unsigned char                                      bConsiderTeam : 1;                                        // 0x008C(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bApplyToPlayerPawns : 1;                                  // 0x008C(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bApplyToAIPawns : 1;                                      // 0x008C(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bApplyToBuildingActors : 1;                               // 0x008C(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData03[0x3];                                       // 0x008D(0x0003) MISSED OFFSET
	EFortDeliveryInfoBuildingActorSpecification        BuildingActorSpecification;                               // 0x0090(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0091(0x0003) MISSED OFFSET
	unsigned char                                      bApplyToGlobalEnvironmentAbilityActor : 1;                // 0x0094(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData05[0x3];                                       // 0x0095(0x0003) MISSED OFFSET
};

// ScriptStruct FortniteGame.GameplayEffectApplicationInfo
// 0x0030
struct FGameplayEffectApplicationInfo
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftClassProperty FortniteGame.GameplayEffectApplicationInfo.GameplayEffect
	float                                              Level;                                                    // 0x0028(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.ProximityBasedGEDeliveryInfo
// 0x00B0
struct FProximityBasedGEDeliveryInfo
{
	struct FFortDeliveryInfoRequirementsFilter         DeliveryRequirements;                                     // 0x0000(0x0098) (Edit, DisableEditOnInstance)
	TArray<struct FGameplayEffectApplicationInfo>      EffectsToApply;                                           // 0x0098(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	EFortProximityBasedGEApplicationType               ProximityApplicationType;                                 // 0x00A8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x00A9(0x0007) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAbilitySetDeliveryInfo
// 0x00A8
struct FFortAbilitySetDeliveryInfo
{
	struct FFortDeliveryInfoRequirementsFilter         DeliveryRequirements;                                     // 0x0000(0x0098) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0098(0x0010) UNKNOWN PROPERTY: ArrayProperty FortniteGame.FortAbilitySetDeliveryInfo.AbilitySets
};

// ScriptStruct FortniteGame.FortAbilitySetHandle
// 0x0028
struct FFortAbilitySetHandle
{
	TWeakObjectPtr<class UAbilitySystemComponent>      TargetAbilitySystemComponent;                             // 0x0000(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	TArray<struct FGameplayAbilitySpecHandle>          GrantedAbilityHandles;                                    // 0x0008(0x0010) (ZeroConstructor, Transient)
	TArray<struct FActiveGameplayEffectHandle>         AppliedEffectHandles;                                     // 0x0018(0x0010) (ZeroConstructor, Transient)
};

// ScriptStruct FortniteGame.BuildingGameplayActorAbilityDeliveryBucket
// 0x0090
struct FBuildingGameplayActorAbilityDeliveryBucket
{
	struct FGameplayTag                                Tag;                                                      // 0x0000(0x0008) (Edit, DisableEditOnInstance)
	TArray<struct FProximityBasedGEDeliveryInfo>       ProximityBasedEffectBuckets;                              // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FFortAbilitySetDeliveryInfo>         PawnPersistentAbilitySetBuckets;                          // 0x0018(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FFortAbilitySetHandle>               PersistentlyAppliedAbilitySets;                           // 0x0028(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      bEnabled : 1;                                             // 0x0038(0x0001) (Transient)
	unsigned char                                      bEnabledByDefault : 1;                                    // 0x0038(0x0001) (Edit, DisableEditOnInstance)
	unsigned char                                      bHasGEsToApplyOnTouch : 1;                                // 0x0038(0x0001)
	unsigned char                                      bHasGEsToApplyOnPulseTimer : 1;                           // 0x0038(0x0001)
	unsigned char                                      bHasPersistentEffects : 1;                                // 0x0038(0x0001)
	unsigned char                                      UnknownData00[0x57];                                      // 0x0039(0x0057) MISSED OFFSET
};

// ScriptStruct FortniteGame.BuildingGameplayActorAbilityDeliveryInfo
// 0x0080
struct FBuildingGameplayActorAbilityDeliveryInfo
{
	TArray<struct FBuildingGameplayActorAbilityDeliveryBucket> DeliveryBuckets;                                          // 0x0000(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              ProximityPulseInterval;                                   // 0x0010(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bHasGEsToApplyOnTouch : 1;                                // 0x0014(0x0001)
	unsigned char                                      bHasGEsToApplyOnPulseTimer : 1;                           // 0x0014(0x0001)
	unsigned char                                      bHasPersistentEffects : 1;                                // 0x0014(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
	class ABuildingGameplayActor*                      OwningActor;                                              // 0x0018(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<class AActor*>                              DeferredTouchActorsToProcess;                             // 0x0020(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData01[0x50];                                      // 0x0030(0x0050) MISSED OFFSET
};

// ScriptStruct FortniteGame.TimeOfDayBlueprintDefaultVariables
// 0x0018
struct FTimeOfDayBlueprintDefaultVariables
{
	bool                                               bDisableTODLightsAndMaterialEmissiveValues;               // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bDisableStaticMeshShadowCastingWhenLightsAreActive;       // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseAnAlternateShadowMeshWhenTheLightIsOff;               // 0x0002(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x0003(0x0005) MISSED OFFSET
	class UStaticMesh*                                 AlternateShadowStaticMesh;                                // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              VolumetricLightScatteringIntensity;                       // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bCastVolumetricShadows;                                   // 0x0014(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortSearchBounceData
// 0x0010
struct FFortSearchBounceData
{
	struct FVector                                     BounceNormal;                                             // 0x0000(0x000C) (IsPlainOldData)
	uint32_t                                           SearchAnimationCount;                                     // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.ConnectivityCube
// 0x00C0
struct FConnectivityCube
{
	unsigned char                                      UnknownData00[0xC0];                                      // 0x0000(0x00C0) MISSED OFFSET
};

// ScriptStruct FortniteGame.AuxiliaryEditTileMeshData
// 0x0020
struct FAuxiliaryEditTileMeshData
{
	class UStaticMesh*                                 TileMesh;                                                 // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UTexture2D*                                  TileTexture;                                              // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    RelativeRot;                                              // 0x0010(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.EditModeState
// 0x0010
struct FEditModeState
{
	class UClass*                                      EditClass;                                                // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                RotationIterations;                                       // 0x0008(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bMirrored;                                                // 0x000C(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bCurrentlyValid;                                          // 0x000D(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x000E(0x0002) MISSED OFFSET
};

// ScriptStruct FortniteGame.TileCompInterpData
// 0x0018
struct FTileCompInterpData
{
	struct FVector                                     InitialTranslation;                                       // 0x0000(0x000C) (Transient, IsPlainOldData)
	struct FVector                                     DesiredTranslation;                                       // 0x000C(0x000C) (Transient, IsPlainOldData)
};

// ScriptStruct FortniteGame.FOBCoreChoice
// 0x002C (0x0038 - 0x000C)
struct FFOBCoreChoice : public FFastArraySerializerItem
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	class UFortFOBCoreDecoItemDefinition*              FOBCoreDef;                                               // 0x0010(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	EFOBFileHeaderStatus                               FileHeaderStatus;                                         // 0x0018(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
	struct FString                                     CoreFilename;                                             // 0x0020(0x0010) (ZeroConstructor, Transient, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class UFortBuildingInstructions*                   BuildingInstructions;                                     // 0x0030(0x0008) (ZeroConstructor, Transient, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
};

// ScriptStruct FortniteGame.FOBCoreChoiceArray
// 0x0010 (0x00C0 - 0x00B0)
struct FFOBCoreChoiceArray : public FFastArraySerializer
{
	TArray<struct FFOBCoreChoice>                      Items;                                                    // 0x00B0(0x0010) (ZeroConstructor)
};

// ScriptStruct FortniteGame.BuildingFoundationStreamingData
// 0x0058
struct FBuildingFoundationStreamingData
{
	struct FName                                       FoundationName;                                           // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     FoundationLocation;                                       // 0x0008(0x000C) (IsPlainOldData)
	struct FBox                                        BoundingBox;                                              // 0x0014(0x001C) (IsPlainOldData)
	TArray<TLazyObjectPtr<class AFortHLODSMActor>>     ProxyInfo;                                                // 0x0030(0x0010) (ZeroConstructor)
	TArray<TLazyObjectPtr<class AFortHLODSMActor>>     ChildProxyInfo;                                           // 0x0040(0x0010) (ZeroConstructor)
	unsigned char                                      PersistentHLODLevelIndex;                                 // 0x0050(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0051(0x0007) MISSED OFFSET
};

// ScriptStruct FortniteGame.BuildingFoundationLODActorData
// 0x0028
struct FBuildingFoundationLODActorData
{
	TWeakObjectPtr<class ALODActor>                    LODActor;                                                 // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0008(0x0010) MISSED OFFSET
	class UMaterialInstanceDynamic*                    VisibilityMaterial;                                       // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData)
	class UTexture2DDynamic*                           VisibilityTexture;                                        // 0x0020(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.FortMapData
// 0x0048
struct FFortMapData
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty FortniteGame.FortMapData.BuildingWorld
	struct FGameplayTagContainer                       BuildingLevelTags;                                        // 0x0028(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly)
};

// ScriptStruct FortniteGame.FortGameplayEffectDeliveryInfo
// 0x00A8
struct FFortGameplayEffectDeliveryInfo
{
	struct FFortDeliveryInfoRequirementsFilter         DeliveryRequirements;                                     // 0x0000(0x0098) (Edit, DisableEditOnInstance)
	TArray<struct FGameplayEffectApplicationInfo>      GameplayEffects;                                          // 0x0098(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct FortniteGame.ColletorUnitInfo
// 0x0110
struct FColletorUnitInfo
{
	class UFortWorldItemDefinition*                    InputItem;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FScalableFloat                              InputCount;                                               // 0x0008(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class UTexture*                                    OverrideInputItemTexture;                                 // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bUseDefinedOutputItem : 1;                                // 0x0038(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0039(0x0007) MISSED OFFSET
	class UFortWorldItemDefinition*                    OutputItem;                                               // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FFortItemEntry>                      OutputItemEntry;                                          // 0x0048(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient)
	struct FName                                       OverrideOutputItemLootTierGroupName;                      // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FFortGameplayEffectDeliveryInfo             OutputGameplayEffect;                                     // 0x0060(0x00A8) (Edit, DisableEditOnInstance)
	class UTexture*                                    OverrideOutputItemTexture;                                // 0x0108(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct FortniteGame.CollectorTrackedData
// 0x0020
struct FCollectorTrackedData
{
	TEnumAsByte<EFortTeam>                             Team;                                                     // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class AFortPlayerState*                            Player;                                                   // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0010(0x0010) MISSED OFFSET
};

// ScriptStruct FortniteGame.BuildingActorNavArea
// 0x0004
struct FBuildingActorNavArea
{
	int                                                AreaBits;                                                 // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.FortSpawnSlotData
// 0x0020
struct FFortSpawnSlotData
{
	struct FVector                                     SpawnSlotLocation;                                        // 0x0000(0x000C) (IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	class AFortAIPawn*                                 OccupyingAI;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EFortRiftSlotStatus>                   SlotStatus;                                               // 0x0018(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
};

// ScriptStruct FortniteGame.BuildingSupportCellIndex
// 0x000C
struct FBuildingSupportCellIndex
{
	int                                                X;                                                        // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Y;                                                        // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Z;                                                        // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.NeighboringWallInfo
// 0x0018
struct FNeighboringWallInfo
{
	TWeakObjectPtr<class ABuildingSMActor>             NeighboringActor;                                         // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FBuildingSupportCellIndex                   NeighboringCellIdx;                                       // 0x0008(0x000C) (Edit, BlueprintVisible)
	EStructuralWallPosition                            WallPosition;                                             // 0x0014(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
};

// ScriptStruct FortniteGame.NeighboringFloorInfo
// 0x0018
struct FNeighboringFloorInfo
{
	TWeakObjectPtr<class ABuildingSMActor>             NeighboringActor;                                         // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FBuildingSupportCellIndex                   NeighboringCellIdx;                                       // 0x0008(0x000C) (Edit, BlueprintVisible)
	EStructuralFloorPosition                           FloorPosition;                                            // 0x0014(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
};

// ScriptStruct FortniteGame.NeighboringCenterCellInfo
// 0x0014
struct FNeighboringCenterCellInfo
{
	TWeakObjectPtr<class ABuildingSMActor>             NeighboringActor;                                         // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FBuildingSupportCellIndex                   NeighboringCellIdx;                                       // 0x0008(0x000C) (Edit, BlueprintVisible)
};

// ScriptStruct FortniteGame.BuildingNeighboringActorInfo
// 0x0030
struct FBuildingNeighboringActorInfo
{
	TArray<struct FNeighboringWallInfo>                NeighboringWallInfos;                                     // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FNeighboringFloorInfo>               NeighboringFloorInfos;                                    // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FNeighboringCenterCellInfo>          NeighboringCenterCellInfos;                               // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct FortniteGame.BuildingGridActorFilter
// 0x0004
struct FBuildingGridActorFilter
{
	bool                                               bIncludeWalls;                                            // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIncludeFloors;                                           // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIncludeFloorInTop;                                       // 0x0002(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIncludeCenterCell;                                       // 0x0003(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.FortTargetFilter
// 0x0020
struct FFortTargetFilter
{
	TEnumAsByte<EFortTargetSelectionFilter>            ActorTypeFilter;                                          // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class UClass*                                      ActorClassFilter;                                         // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bExcludeInstigator;                                       // 0x0010(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bExcludeRequester;                                        // 0x0011(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bExcludeAllAttachedToInstigator;                          // 0x0012(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bExcludeAllAttachedToRequester;                           // 0x0013(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bExcludePawnFriends;                                      // 0x0014(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bExcludeFriendlyAI;                                       // 0x0015(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bExcludePawnEnemies;                                      // 0x0016(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bExcludeNonPawnFriends;                                   // 0x0017(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bExcludeNonPawnEnemies;                                   // 0x0018(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bExcludeDBNOPawns;                                        // 0x0019(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bExcludeWithoutNavigationCorridor;                        // 0x001A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bExcludeNonPlayerBuiltPieces;                             // 0x001B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bExcludePlayerBuiltPieces;                                // 0x001C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bExcludeNonBGABuildings;                                  // 0x001D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bExcludeNonBlockingHits;                                  // 0x001E(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bTraceComplexCollision;                                   // 0x001F(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.FortCosmeticModification
// 0x0B20
struct FFortCosmeticModification
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty FortniteGame.FortCosmeticModification.CosmeticMaterial
	unsigned char                                      UnknownData01[0x28];                                      // 0x0028(0x0028) UNKNOWN PROPERTY: SoftObjectProperty FortniteGame.FortCosmeticModification.AmbientParticleSystem
	unsigned char                                      UnknownData02[0x28];                                      // 0x0050(0x0028) UNKNOWN PROPERTY: SoftObjectProperty FortniteGame.FortCosmeticModification.MuzzleParticleSystem
	unsigned char                                      UnknownData03[0x28];                                      // 0x0078(0x0028) UNKNOWN PROPERTY: SoftObjectProperty FortniteGame.FortCosmeticModification.ReloadParticleSystem
	unsigned char                                      UnknownData04[0x28];                                      // 0x00A0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty FortniteGame.FortCosmeticModification.BeamParticleSystem
	unsigned char                                      UnknownData05[0x9D8];                                     // 0x00C8(0x09D8) UNKNOWN PROPERTY: SoftObjectProperty FortniteGame.FortCosmeticModification.ImpactPhysicalSurfaceEffects
	unsigned char                                      UnknownData06[0x28];                                      // 0x0AA0(0x0028) UNKNOWN PROPERTY: SoftClassProperty FortniteGame.FortCosmeticModification.TracerTemplate
	bool                                               bModifyColor;                                             // 0x0AC8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x0AC9(0x0003) MISSED OFFSET
	struct FLinearColor                                ColorAlteration;                                          // 0x0ACC(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	unsigned char                                      UnknownData08[0x4];                                       // 0x0ADC(0x0004) MISSED OFFSET
	struct FName                                       ColorParameterName;                                       // 0x0AE0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bModifyDecalColour;                                       // 0x0AE8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData09[0x3];                                       // 0x0AE9(0x0003) MISSED OFFSET
	struct FLinearColor                                DecalColourAlterationStart;                               // 0x0AEC(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	struct FLinearColor                                DecalColourAlterationEnd;                                 // 0x0AFC(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	bool                                               bModifyShellColour;                                       // 0x0B0C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData10[0x3];                                       // 0x0B0D(0x0003) MISSED OFFSET
	struct FLinearColor                                ShellColourAlteration;                                    // 0x0B10(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
};

// ScriptStruct FortniteGame.MOBATurretPrioritySetting
// 0x000C
struct FMOBATurretPrioritySetting
{
	int                                                AIPriority;                                               // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                PlayerPriority;                                           // 0x0004(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                BuildingPriority;                                         // 0x0008(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
};

// ScriptStruct FortniteGame.ClimbLinkData
// 0x0028
struct FClimbLinkData
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
	uint32_t                                           UniqueLinkId;                                             // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.ColorSwatchPair
// 0x0018
struct FColorSwatchPair
{
	struct FName                                       ColorName;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                ColorValue;                                               // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
};

// ScriptStruct FortniteGame.CustomPartTextureParameter
// 0x0038
struct FCustomPartTextureParameter
{
	int                                                MaterialIndexForTextureParameter;                         // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FName                                       TextureParameterNameForMaterial;                          // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x28];                                      // 0x0010(0x0028) UNKNOWN PROPERTY: SoftObjectProperty FortniteGame.CustomPartTextureParameter.TextureOverride
};

// ScriptStruct FortniteGame.CustomPartMaterialOverrideData
// 0x0030
struct FCustomPartMaterialOverrideData
{
	int                                                MaterialOverrideIndex;                                    // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	unsigned char                                      UnknownData01[0x28];                                      // 0x0004(0x0028) UNKNOWN PROPERTY: SoftObjectProperty FortniteGame.CustomPartMaterialOverrideData.OverrideMaterial
};

// ScriptStruct FortniteGame.CustomPartScalarParameter
// 0x0018
struct FCustomPartScalarParameter
{
	int                                                MaterialIndexForScalarParameter;                          // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FName                                       ScalarParameterNameForMaterial;                           // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              ScalarOverride;                                           // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.CustomPartVectorParameter
// 0x0020
struct FCustomPartVectorParameter
{
	int                                                MaterialIndexForVectorParameter;                          // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FName                                       VectorParameterNameForMaterial;                           // 0x0008(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                VectorOverride;                                           // 0x0010(0x0010) (Edit, IsPlainOldData)
};

// ScriptStruct FortniteGame.GameplayTagAnimationData
// 0x0050
struct FGameplayTagAnimationData
{
	struct FGameplayTagContainer                       GameplayTags;                                             // 0x0000(0x0020) (Edit)
	TEnumAsByte<EFortCustomGender>                     ValidGenders;                                             // 0x0020(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
	unsigned char                                      UnknownData01[0x28];                                      // 0x0021(0x0028) UNKNOWN PROPERTY: SoftObjectProperty FortniteGame.GameplayTagAnimationData.AnimMontage
};

// ScriptStruct FortniteGame.GameplayTagAnimations
// 0x0010
struct FGameplayTagAnimations
{
	TArray<struct FGameplayTagAnimationData>           GameplayTagAnimData;                                      // 0x0000(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct FortniteGame.FortCloudSaveRecordInfo
// 0x0018
struct FFortCloudSaveRecordInfo
{
	int                                                RecordIndex;                                              // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ArchiveNumber;                                            // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FString                                     RecordFilename;                                           // 0x0008(0x0010) (ZeroConstructor)
};

// ScriptStruct FortniteGame.FortCloudSaveInfo
// 0x0018
struct FFortCloudSaveInfo
{
	int                                                SaveCount;                                                // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	TArray<struct FFortCloudSaveRecordInfo>            SavedRecords;                                             // 0x0008(0x0010) (ZeroConstructor)
};

// ScriptStruct FortniteGame.DeferredActorData
// 0x0040
struct FDeferredActorData
{
	class ABuildingActor*                              BuildingActor;                                            // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                ActorRecordIndex;                                         // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	struct FTransform                                  BuildingTransform;                                        // 0x0010(0x0030) (IsPlainOldData)
};

// ScriptStruct FortniteGame.ViewOffsetData
// 0x0024
struct FViewOffsetData
{
	struct FVector                                     OffsetHigh;                                               // 0x0000(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	struct FVector                                     OffsetMid;                                                // 0x000C(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	struct FVector                                     OffsetLow;                                                // 0x0018(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
};

// ScriptStruct FortniteGame.PenetrationAvoidanceFeeler
// 0x0020
struct FPenetrationAvoidanceFeeler
{
	struct FRotator                                    AdjustmentRot;                                            // 0x0000(0x000C) (Edit, IsPlainOldData)
	float                                              WorldWeight;                                              // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              PawnWeight;                                               // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              Extent;                                                   // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                TraceInterval;                                            // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                FramesUntilNextTrace;                                     // 0x001C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct FortniteGame.FortGameplayAbilityBehaviorDistanceData
// 0x0028
struct FFortGameplayAbilityBehaviorDistanceData
{
	struct FGameplayTagContainer                       DistanceDataTag;                                          // 0x0000(0x0020) (Edit)
	float                                              Distance;                                                 // 0x0020(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortEffectDistanceQuality
// 0x0018
struct FFortEffectDistanceQuality
{
	float                                              MinDistanceCinematic;                                     // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MinDistanceEpic;                                          // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MinDistanceHigh;                                          // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MinDistanceMedium;                                        // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MinDistanceLow;                                           // 0x0010(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bAllowCinematic : 1;                                      // 0x0014(0x0001)
	unsigned char                                      bAllowEpic : 1;                                           // 0x0014(0x0001)
	unsigned char                                      bAllowHigh : 1;                                           // 0x0014(0x0001)
	unsigned char                                      bAllowMedium : 1;                                         // 0x0014(0x0001)
	unsigned char                                      bAllowLow : 1;                                            // 0x0014(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
};

// ScriptStruct FortniteGame.AbilityToolSpawnParameters
// 0x0028
struct FAbilityToolSpawnParameters
{
	class UClass*                                      SpawnClass;                                               // 0x0000(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     Location;                                                 // 0x0008(0x000C) (BlueprintVisible, IsPlainOldData)
	struct FRotator                                    Rotation;                                                 // 0x0014(0x000C) (BlueprintVisible, IsPlainOldData)
	class ABuildingSMActor*                            AttachedToActor;                                          // 0x0020(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.AbilityKitItem
// 0x0010
struct FAbilityKitItem
{
	class UFortItemDefinition*                         Item;                                                     // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                Quantity;                                                 // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EFortReplenishmentType>                Replenishment;                                            // 0x000C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
};

// ScriptStruct FortniteGame.ReplicatedMontagePair
// 0x0028
struct FReplicatedMontagePair
{
	class UAnimMontage*                                Montage1;                                                 // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	class UAnimMontage*                                Montage2;                                                 // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FName                                       Section1;                                                 // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FName                                       Section2;                                                 // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData)
	int8_t                                             RepIndex;                                                 // 0x0020(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
};

// ScriptStruct FortniteGame.AttributeInfo
// 0x0010
struct FAttributeInfo
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct FortniteGame.TokenAttributePair
// 0x0028
struct FTokenAttributePair
{
	struct FGameplayTag                                Token;                                                    // 0x0000(0x0008) (Edit)
	struct FGameplayAttribute                          Attribute;                                                // 0x0008(0x0020) (Edit)
};

// ScriptStruct FortniteGame.FortGameplayEffectModifierDescription
// 0x0040
struct FFortGameplayEffectModifierDescription
{
	struct FGameplayAttribute                          ModAttribute;                                             // 0x0000(0x0020)
	struct FText                                       ModDescription;                                           // 0x0020(0x0018) (BlueprintVisible, BlueprintReadOnly)
	bool                                               bIsBuff;                                                  // 0x0038(0x0001) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EFortAttributeDisplay>                 MagnitudeFormat;                                          // 0x0039(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EFortStatDisplayType                               DisplayType;                                              // 0x003A(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x003B(0x0001) MISSED OFFSET
	float                                              Magnitude;                                                // 0x003C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.FortGameplayEffectDescription
// 0x0050
struct FFortGameplayEffectDescription
{
	struct FText                                       EffectDisplayName;                                        // 0x0000(0x0018) (BlueprintVisible, BlueprintReadOnly)
	struct FText                                       EffectWrittenDescription;                                 // 0x0018(0x0018) (BlueprintVisible, BlueprintReadOnly)
	TArray<struct FFortGameplayEffectModifierDescription> ModDescriptions;                                          // 0x0030(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FText>                               GrantedTagDescriptions;                                   // 0x0040(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct FortniteGame.FortMoveConfig
// 0x0028
struct FFortMoveConfig
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
	class AActor*                                      FocusTarget;                                              // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData)
	class UClass*                                      PushPawnClassOnBump;                                      // 0x0020(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.FortCharacterPartMontageInfo
// 0x0010
struct FFortCharacterPartMontageInfo
{
	TEnumAsByte<EFortCustomPartType>                   CharacterPart;                                            // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class UAnimMontage*                                AnimMontage;                                              // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.FortGameplayAbilityMontageInfo
// 0x0060
struct FFortGameplayAbilityMontageInfo
{
	class UAnimMontage*                                MontageToPlay;                                            // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AnimPlayRate;                                             // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              AnimRootMotionTranslationScale;                           // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EFortGameplayAbilityMontageSectionToPlay           MontageSectionToPlay;                                     // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0011(0x0007) MISSED OFFSET
	struct FName                                       OverrideSection;                                          // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bPlayRandomSection;                                       // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
	TArray<struct FFortCharacterPartMontageInfo>       CharacterPartMontages;                                    // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData02[0x28];                                      // 0x0038(0x0028) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAbilityTargetSelection
// 0x00F8
struct FFortAbilityTargetSelection
{
	TEnumAsByte<EFortTargetSelectionShape>             Shape;                                                    // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FString                                     CustomShapeComponentName;                                 // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	EFortTargetSelectionTestType                       TestType;                                                 // 0x0018(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EFortAbilityTargetingSource                        PrimarySource;                                            // 0x0019(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EFortAbilityTargetingSource                        SecondarySource;                                          // 0x001A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x5];                                       // 0x001B(0x0005) MISSED OFFSET
	struct FScalableFloat                              Range;                                                    // 0x0020(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FVector                                     HalfExtents;                                              // 0x0048(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
	struct FScalableFloat                              ConeYawAngle;                                             // 0x0058(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FScalableFloat                              ConePitchAngle;                                           // 0x0080(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FScalableFloat                              ConeMinRadius;                                            // 0x00A8(0x0028) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FFortTargetFilter                           TargetFilter;                                             // 0x00D0(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                               bExcludeObstructedByWorld;                                // 0x00F0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bCreateHitResultWhenNoTargetsFound;                       // 0x00F1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bUseProjectileRotationForDamageZones;                     // 0x00F2(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EFortAbilityTargetSelectionUsage                   TargetSelectionUsage;                                     // 0x00F3(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                MaxTargets;                                               // 0x00F4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.FortAbilityTargetSelectionList
// 0x0020
struct FFortAbilityTargetSelectionList
{
	TArray<struct FFortAbilityTargetSelection>         List;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	unsigned char                                      bStopAtFirstSuccess : 1;                                  // 0x0010(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bKeepCheckingListOnIndestructibleHit : 1;                 // 0x0010(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bUseWeaponRanges : 1;                                     // 0x0010(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bUseMaxYawAngleToTarget : 1;                              // 0x0010(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	float                                              MaxYawAngleToTarget;                                      // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0018(0x0008) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortGameplayEffectContainerSpec
// 0x0080
struct FFortGameplayEffectContainerSpec
{
	struct FFortAbilityTargetSelectionList             TargetSelection;                                          // 0x0000(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<struct FGameplayEffectSpecHandle>           TargetGameplayEffectSpecs;                                // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FGameplayEffectSpecHandle>           OwnerGameplayEffectSpecs;                                 // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FGameplayTagContainer                       ActivationCues;                                           // 0x0040(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FGameplayTagContainer                       ImpactCues;                                               // 0x0060(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly)
};

// ScriptStruct FortniteGame.FortGameplayAttributeData
// 0x0010 (0x0020 - 0x0010)
struct FFortGameplayAttributeData : public FGameplayAttributeData
{
	float                                              Minimum;                                                  // 0x0010(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              Maximum;                                                  // 0x0014(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsClamped;                                               // 0x0018(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bShouldClampBase;                                         // 0x0019(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x001A(0x0006) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAIAssignmentIdentifier
// 0x0030
struct FFortAIAssignmentIdentifier
{
	EAssignmentType                                    AssignmentType;                                           // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FGameplayTagContainer                       AssignmentGameplayTags;                                   // 0x0008(0x0020) (Edit, BlueprintVisible)
	TEnumAsByte<EFortTeam>                             AssignmentTeam;                                           // 0x0028(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAIGoalInfo
// 0x0018
struct FFortAIGoalInfo
{
	TWeakObjectPtr<class AActor>                       Actor;                                                    // 0x0000(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     Location;                                                 // 0x0008(0x000C) (Transient, IsPlainOldData)
	bool                                               bActorAlwaysPerceived;                                    // 0x0014(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAIGoal
// 0x0010 (0x0028 - 0x0018)
struct FFortAIGoal : public FFortAIGoalInfo
{
	TArray<class AFortAIController*>                   ControllersAssignedToGoal;                                // 0x0018(0x0010) (ZeroConstructor, Transient)
};

// ScriptStruct FortniteGame.GoalSelectionQueryInfo
// 0x0028
struct FGoalSelectionQueryInfo
{
	class UEnvQuery*                                   GoalSelectionQuery;                                       // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FGameplayTagContainer                       RequiredGameplayTags;                                     // 0x0008(0x0020) (Edit)
};

// ScriptStruct FortniteGame.IntensityContribution
// 0x0048
struct FIntensityContribution
{
	TEnumAsByte<EFortCombatFactors>                    CombatFactor;                                             // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EFortAIDirectorFactor                              ContributingAIDirectorFactor;                             // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	float                                              MaxContribution;                                          // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bModifyContributionByCompletionPercentage;                // 0x0008(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
	struct FCurveTableRowHandle                        CompletionPercentageInitialMultiplier;                    // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FCurveTableRowHandle                        CompletionPercentageToStartReducingMultiplier;            // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FCurveTableRowHandle                        CompletionPercentageToStopReducingMultiplier;             // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                               bModifyByNumberOfCriticalEncounterGoals;                  // 0x0040(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0041(0x0007) MISSED OFFSET
};

// ScriptStruct FortniteGame.IntensityData
// 0x0030
struct FIntensityData
{
	TArray<struct FIntensityContribution>              ContributingFactors;                                      // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	float                                              ContributionsTotal;                                       // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	TArray<class UBuildingEditModeMetadata*>           ExceptionEditModes;                                       // 0x0018(0x0010) (Edit, ZeroConstructor)
	float                                              ExceptionEditModeWeight;                                  // 0x0028(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAIEncounterPIDController
// 0x0068
struct FFortAIEncounterPIDController
{
	float                                              ProportionalGain;                                         // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              IntegralGain;                                             // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DerivativeGain;                                           // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5C];                                      // 0x000C(0x005C) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAIEncounterPIDControllerSettings
// 0x0030
struct FFortAIEncounterPIDControllerSettings
{
	struct FCurveTableRowHandle                        ProportionalGain;                                         // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FCurveTableRowHandle                        IntegralGain;                                             // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FCurveTableRowHandle                        DerivativeGain;                                           // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly)
};

// ScriptStruct FortniteGame.UtilityContribution
// 0x000C
struct FUtilityContribution
{
	TEnumAsByte<EFortCombatFactors>                    ContributingFactor;                                       // 0x0000(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	EFortAIDirectorFactor                              ContributingAIDirectorFactor;                             // 0x0001(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	float                                              MaxContribution;                                          // 0x0004(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EFortFactorContributionType>           ContributionType;                                         // 0x0008(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
};

// ScriptStruct FortniteGame.UtilityData
// 0x0040
struct FUtilityData
{
	TArray<struct FUtilityContribution>                ContributingFactors;                                      // 0x0000(0x0010) (Edit, ZeroConstructor)
	float                                              ContributionsTotal;                                       // 0x0010(0x0004) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	bool                                               bApplyRecentSelectionPenalty;                             // 0x0014(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
	float                                              RecentlySelectedPenaltyPercentage;                        // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              PenaltyFallOffRate;                                       // 0x001C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FString                                     DebugGraphName;                                           // 0x0020(0x0010) (Edit, ZeroConstructor)
	struct FLinearColor                                DebugGraphColor;                                          // 0x0030(0x0010) (Edit, IsPlainOldData)
};

// ScriptStruct FortniteGame.FortPlayerPerformanceEstimateSettings
// 0x0040
struct FFortPlayerPerformanceEstimateSettings
{
	struct FCurveTableRowHandle                        PlayerPerformanceEstimateTransformMin;                    // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FCurveTableRowHandle                        PlayerPerformanceEstimateTransformOrigin;                 // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FCurveTableRowHandle                        PlayerPerformanceEstimateTransformMax;                    // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly)
	float                                              EncounterPlayerPerformanceWeight;                         // 0x0030(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              PreviousWavePlayerPerformanceWeight;                      // 0x0034(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              CampaignPlayerPerformanceWeight;                          // 0x0038(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAIEncounterSpawnGroupCap
// 0x0020
struct FFortAIEncounterSpawnGroupCap
{
	struct FCurveTableRowHandle                        MinSpawnGroupNumberCap;                                   // 0x0000(0x0010) (Edit, DisableEditOnInstance)
	struct FCurveTableRowHandle                        MaxSpawnGroupNumberCap;                                   // 0x0010(0x0010) (Edit, DisableEditOnInstance)
};

// ScriptStruct FortniteGame.FortAIEncounterSpawnGroupCapsCategory
// 0x0140
struct FFortAIEncounterSpawnGroupCapsCategory
{
	struct FGameplayTagQuery                           TagQuery;                                                 // 0x0000(0x0048) (Edit, DisableEditOnInstance)
	bool                                               bApplyGroupPopulationCurveToCategoryMax;                  // 0x0048(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0049(0x0007) MISSED OFFSET
	struct FCurveTableRowHandle                        InitialSpawnGroupAvailabilityDelaySeconds;                // 0x0050(0x0010) (Edit, DisableEditOnInstance)
	struct FCurveTableRowHandle                        SpawnGroupAvailabilityDelaySeconds;                       // 0x0060(0x0010) (Edit, DisableEditOnInstance)
	struct FGameplayTagQuery                           UnlockingTagQuery;                                        // 0x0070(0x0048) (Edit, DisableEditOnInstance)
	TArray<struct FFortAIEncounterSpawnGroupCap>       SpawnGroupCapsPerPlayerCount;                             // 0x00B8(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	float                                              InitialSpawnGroupAvailabilityTime;                        // 0x00C8(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              NumActiveCategorySpawnGroups;                             // 0x00CC(0x0004) (ZeroConstructor, IsPlainOldData)
	TArray<float>                                      SpawnGroupAvailabilityTimes;                              // 0x00D0(0x0010) (ZeroConstructor)
	int                                                NumSpawnGroupAvailable;                                   // 0x00E0(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x00E4(0x0004) MISSED OFFSET
	class UObject*                                     CategorySource;                                           // 0x00E8(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x50];                                      // 0x00F0(0x0050) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAIEncounterSpawnGroupCapsProfile
// 0x0030
struct FFortAIEncounterSpawnGroupCapsProfile
{
	struct FGameplayTagContainer                       EncounterTypeTags;                                        // 0x0000(0x0020) (Edit, DisableEditOnInstance)
	TArray<struct FFortAIEncounterSpawnGroupCapsCategory> PopulationCategories;                                     // 0x0020(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct FortniteGame.FortAIEncounterSpawnPointsProfile
// 0x0040
struct FFortAIEncounterSpawnPointsProfile
{
	struct FGameplayTagContainer                       EncounterTypeTags;                                        // 0x0000(0x0020) (Edit, DisableEditOnInstance)
	TArray<struct FCurveTableRowHandle>                MaxSpawnPointsPerPlayerCount;                             // 0x0020(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FCurveTableRowHandle>                MinSpawnPointsPerPlayerCount;                             // 0x0030(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct FortniteGame.FortAIEncounterPawnDifficultyLevelModifier
// 0x0058
struct FFortAIEncounterPawnDifficultyLevelModifier
{
	struct FGameplayTagQuery                           EncounterTagRequirementsQuery;                            // 0x0000(0x0048) (Edit, DisableEditOnInstance)
	struct FCurveTableRowHandle                        DifficultyLevelModifierCurve;                             // 0x0048(0x0010) (Edit, DisableEditOnInstance)
};

// ScriptStruct FortniteGame.FortAISpawnGroupUpgradeData
// 0x0060
struct FFortAISpawnGroupUpgradeData
{
	class UClass*                                      SpawnGroupUpgrade;                                        // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      UpgradeProbabilities;                                     // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      SpawnGroupCapsCategories;                                 // 0x0010(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FGameplayTagQuery                           EncounterTagRequirementsQuery;                            // 0x0018(0x0048) (Edit, DisableEditOnInstance)
};

// ScriptStruct FortniteGame.EncounterEnvironmentQueryInfo
// 0x0028
struct FEncounterEnvironmentQueryInfo
{
	class UEnvQuery*                                   EnvironmentQuery;                                         // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FEnvNamedValue>                      QueryParams;                                              // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0018(0x0008) MISSED OFFSET
	bool                                               bIsDirectional;                                           // 0x0020(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortEncounterPawnNumberCaps
// 0x0018
struct FFortEncounterPawnNumberCaps
{
	bool                                               bApplyPawnNumberCaps;                                     // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	TArray<struct FCurveTableRowHandle>                PawnCapsPerPlayerCount;                                   // 0x0008(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct FortniteGame.FortAISpawnGroupUpgradeUIData
// 0x00B8
struct FFortAISpawnGroupUpgradeUIData
{
	bool                                               bAlwaysDisplayHealthBar;                                  // 0x0000(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bOverrideHealthBarColor;                                  // 0x0001(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0002(0x0006) MISSED OFFSET
	struct FSlateBrush                                 UpgradeIcon;                                              // 0x0008(0x0088) (Edit, DisableEditOnInstance)
	struct FLinearColor                                HealthBarColorOverride;                                   // 0x0090(0x0010) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FText                                       UpgradeName;                                              // 0x00A0(0x0018) (Edit, DisableEditOnInstance)
};

// ScriptStruct FortniteGame.PendingSpawnInfo
// 0x0170
struct FPendingSpawnInfo
{
	class UClass*                                      PawnClassToSpawn;                                         // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	class AActor*                                      SpawnPoint;                                               // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     SpawnLocation;                                            // 0x0010(0x000C) (IsPlainOldData)
	struct FRotator                                    SpawnRotation;                                            // 0x001C(0x000C) (IsPlainOldData)
	class AActor*                                      SpawnSource;                                              // 0x0028(0x0008) (ZeroConstructor, IsPlainOldData)
	bool                                               bSpawnedFromExternalSpawner;                              // 0x0030(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0031(0x0003) MISSED OFFSET
	int                                                SpawnSetIndex;                                            // 0x0034(0x0004) (ZeroConstructor, IsPlainOldData)
	EFortressAIType                                    AIType;                                                   // 0x0038(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0039(0x0007) MISSED OFFSET
	class AFortPlayerController*                       TargetPlayer;                                             // 0x0040(0x0008) (ZeroConstructor, IsPlainOldData)
	class UFortAIEncounterInfo*                        EncounterInfo;                                            // 0x0048(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              DifficultyLevel;                                          // 0x0050(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
	class UFortAISpawnGroup*                           SpawnGroup;                                               // 0x0058(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FGuid                                       SpawnGroupGuid;                                           // 0x0060(0x0010) (IsPlainOldData)
	int                                                EnemyIndexInSpawnGroup;                                   // 0x0070(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              TimeToSpawn;                                              // 0x0074(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FGuid                                       PendingSpawnInfoGuid;                                     // 0x0078(0x0010) (IsPlainOldData)
	bool                                               bIgnoreCollision;                                         // 0x0088(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bKillBuildingActorsAtSpawnLocation;                       // 0x0089(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2];                                       // 0x008A(0x0002) MISSED OFFSET
	float                                              EncounterAILifespan;                                      // 0x008C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              ScoreMultiplier;                                          // 0x0090(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bDebugSpawnedAI;                                          // 0x0094(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0095(0x0003) MISSED OFFSET
	TArray<class UFortAbilitySet*>                     AbilitySetsToGrantOnSpawn;                                // 0x0098(0x0010) (ZeroConstructor)
	TArray<class UFortGameplayModifierItemDefinition*> ModifiersToApplyOnSpawn;                                  // 0x00A8(0x0010) (ZeroConstructor)
	struct FFortAISpawnGroupUpgradeUIData              UpgradeUIData;                                            // 0x00B8(0x00B8)
};

// ScriptStruct FortniteGame.FortPendingStoppedEncounterData
// 0x0010
struct FFortPendingStoppedEncounterData
{
	class UFortAIEncounterInfo*                        Encounter;                                                // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	EFortObjectiveStatus                               ObjectiveStatus;                                          // 0x0008(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bForceDestroyAI;                                          // 0x0009(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bEncounterCompletedSuccessfully;                          // 0x000A(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x000B(0x0005) MISSED OFFSET
};

// ScriptStruct FortniteGame.UtilityTypeFloatPair
// 0x0008
struct FUtilityTypeFloatPair
{
	TEnumAsByte<EFortAIUtility>                        Utility;                                                  // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              Value;                                                    // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.AIDirectorEventData
// 0x0030
struct FAIDirectorEventData
{
	EFortAIDirectorEvent                               Event;                                                    // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FCurveTableRowHandle                        DataMax;                                                  // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FCurveTableRowHandle                        CoolDownRate;                                             // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly)
	EFortAIDirectorEventContribution                   ContributionType;                                         // 0x0028(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EFortAIDirectorEventParticipant                    OwnerParticipantType;                                     // 0x0029(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x002A(0x0006) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAIDirectorFactorContribution
// 0x000C
struct FFortAIDirectorFactorContribution
{
	EFortAIDirectorEvent                               AIDirectorEvent;                                          // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              MaxContribution;                                          // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EFortAIDirectorFactorContribution>     ContributionType;                                         // 0x0008(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAIDirectorFactorData
// 0x0020
struct FFortAIDirectorFactorData
{
	EFortAIDirectorFactor                              AIDirectorFactor;                                         // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	TArray<struct FFortAIDirectorFactorContribution>   ContributingEvents;                                       // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	float                                              MaxValue;                                                 // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAIDirectorEvent
// 0x0020
struct FFortAIDirectorEvent
{
	EFortAIDirectorEvent                               Event;                                                    // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	class UObject*                                     EventSource;                                              // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
	class UObject*                                     EventTarget;                                              // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              EventValue;                                               // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortCurveSequenceInstanceInfo
// 0x0004
struct FFortCurveSequenceInstanceInfo
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0000(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortSpawnPointsPercentageCurveSequenceInstanceInfo
// 0x000C (0x0010 - 0x0004)
struct FFortSpawnPointsPercentageCurveSequenceInstanceInfo : public FFortCurveSequenceInstanceInfo
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	class UFortSpawnPointsPercentageCurveSequence*     SpawnPointsPercentageCurveSequence;                       // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.FortIntensityCurveSequenceInstanceInfo
// 0x000C (0x0010 - 0x0004)
struct FFortIntensityCurveSequenceInstanceInfo : public FFortCurveSequenceInstanceInfo
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	class UFortIntensityCurveSequence*                 IntensityCurveSequence;                                   // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.AIEncounterSpawnGroupWeights
// 0x0018
struct FAIEncounterSpawnGroupWeights
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAIPawnUpgradeData
// 0x0048
struct FFortAIPawnUpgradeData
{
	struct FCurveTableRowHandle                        SpawnPointsMultiplierCurve;                               // 0x0000(0x0010) (Edit, DisableEditOnInstance)
	struct FCurveTableRowHandle                        LifespanMultiplierCurve;                                  // 0x0010(0x0010) (Edit, DisableEditOnInstance)
	struct FCurveTableRowHandle                        ScoreMultiplierCurve;                                     // 0x0020(0x0010) (Edit, DisableEditOnInstance)
	class UFortGameplayModifierItemDefinition*         ModifierDefinition;                                       // 0x0030(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class UFortGameplayModifierItemDefinition*> AdditionalModifiers;                                      // 0x0038(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct FortniteGame.SpawnGroupInstanceInfo
// 0x0140
struct FSpawnGroupInstanceInfo
{
	class UFortAISpawnGroup*                           SpawnGroup;                                               // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                NumActiveAlive;                                           // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                TotalGroupCost;                                           // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                SpawnPointsUsed;                                          // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                NumEngaged;                                               // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bReadyToSpawn;                                            // 0x0018(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bFinishedSpawning;                                        // 0x0019(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x001A(0x0002) MISSED OFFSET
	struct FGuid                                       GroupGuid;                                                // 0x001C(0x0010) (IsPlainOldData)
	int                                                EnemySpawnDataIndex;                                      // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              TimeSelected;                                             // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                NextEnemyToSpawnIndex;                                    // 0x0034(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FGameplayTagContainer                       UpgradeTags;                                              // 0x0038(0x0020)
	struct FFortAISpawnGroupUpgradeUIData              UpgradeUIData;                                            // 0x0058(0x00B8)
	TArray<struct FFortAIPawnUpgradeData>              PawnUpgrades;                                             // 0x0110(0x0010) (ZeroConstructor)
	TArray<class UFortGameplayModifierItemDefinition*> ModifiersForAllPawns;                                     // 0x0120(0x0010) (ZeroConstructor)
	TArray<class AFortAIPawn*>                         PawnList;                                                 // 0x0130(0x0010) (ZeroConstructor)
};

// ScriptStruct FortniteGame.FortAIEncounterWaveProgressEstimation
// 0x001C
struct FFortAIEncounterWaveProgressEstimation
{
	float                                              SectionProgressEstimate;                                  // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              SectionStartTime;                                         // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LastWaveProgressUpdateTime;                               // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              PeakAndFadeWavePercentage;                                // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              MaxAdjustmentPerSecond;                                   // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EFortAIWaveProgressSection>            CurrentSection;                                           // 0x0014(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
	int                                                NumberOfWaveSegments;                                     // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.FortGoalActorEncounterDataManagerPair
// 0x0010
struct FFortGoalActorEncounterDataManagerPair
{
	class AActor*                                      GoalActor;                                                // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	class AFortAIDirectorDataManager*                  EncounterDataManager;                                     // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.FortEncounterSettings
// 0x0058
struct FFortEncounterSettings
{
	TArray<TEnumAsByte<EFortEncounterDirection>>       ForbiddenSpawnDirections;                                 // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               bRiftsDestroyPlayerBuiltBuildings;                        // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bMustFindSpawnPoints;                                     // 0x0011(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bTrackCombatParticipation;                                // 0x0012(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bDisplayThreatVisuals;                                    // 0x0013(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NumRiftsToUseOverride;                                    // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseEQSQueryToFindAISpawnLocations;                       // 0x0018(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bRelevantForTotalAICap;                                   // 0x0019(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x001A(0x0006) MISSED OFFSET
	class UEnvQuery*                                   RiftSelectionQuery;                                       // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class AActor*>                              ScriptedSpawnPoints;                                      // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<class AActor*>                              WorkingScriptedSpawnPoints;                               // 0x0038(0x0010) (ZeroConstructor, Transient)
	TArray<class UFortDifficultyOptionCategoryEncounter*> InjectedOverrideCategories;                               // 0x0048(0x0010) (ZeroConstructor, Transient)
};

// ScriptStruct FortniteGame.FortSpawnAIRequest
// 0x0050
struct FFortSpawnAIRequest
{
	struct FGuid                                       SpawnGroupInstanceGuid;                                   // 0x0000(0x0010) (IsPlainOldData)
	int                                                EnemyIndex;                                               // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     SpawnLocation;                                            // 0x0014(0x000C) (IsPlainOldData)
	struct FRotator                                    SpawnRotation;                                            // 0x0020(0x000C) (IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	class AActor*                                      SpawnPoint;                                               // 0x0030(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<class UFortAbilitySet*>                     AbilitySetsToGrantOnSpawn;                                // 0x0038(0x0010) (ZeroConstructor)
	bool                                               bIgnoreCollisionWhenSpawning;                             // 0x0048(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0049(0x0007) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAISpawnerData
// 0x0060
struct FFortAISpawnerData
{
	struct FGuid                                       SpawnGroupInstanceGuid;                                   // 0x0000(0x0010) (IsPlainOldData)
	struct FFortSpawnAIRequest                         ReservedSpawnRequest;                                     // 0x0010(0x0050)
};

// ScriptStruct FortniteGame.FortAIEncounterTimedModifierTags
// 0x0028
struct FFortAIEncounterTimedModifierTags
{
	float                                              TimeSeconds;                                              // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FGameplayTagContainer                       GameplayTags;                                             // 0x0008(0x0020) (Edit, DisableEditOnInstance)
};

// ScriptStruct FortniteGame.EncounterEnvironmentQueryInstance
// 0x0048
struct FEncounterEnvironmentQueryInstance
{
	struct FEncounterEnvironmentQueryInfo              EnvironmentQueryInfo;                                     // 0x0000(0x0028)
	int                                                QueryID;                                                  // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsWaitingForQueryResults;                                // 0x002C(0x0001) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EFortEncounterDirection>               ChosenDirection;                                          // 0x002D(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x002E(0x0002) MISSED OFFSET
	TArray<struct FVector>                             QueryLocations;                                           // 0x0030(0x0010) (ZeroConstructor)
	int                                                NumTimesUsed;                                             // 0x0040(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAIEncounterRift
// 0x0018
struct FFortAIEncounterRift
{
	int                                                QueryID;                                                  // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     RiftLocation;                                             // 0x0004(0x000C) (IsPlainOldData)
	class ABuildingRift*                               RiftActor;                                                // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.FortAIEncounterSpawnArea
// 0x0048
struct FFortAIEncounterSpawnArea
{
	TArray<struct FEncounterEnvironmentQueryInstance>  QueryInstances;                                           // 0x0000(0x0010) (ZeroConstructor)
	TArray<struct FFortAIEncounterRift>                PendingRifts;                                             // 0x0010(0x0010) (ZeroConstructor)
	TArray<struct FFortAIEncounterRift>                Rifts;                                                    // 0x0020(0x0010) (ZeroConstructor)
	TArray<class UFortPathCostEstimator*>              PathEstimators;                                           // 0x0030(0x0010) (ZeroConstructor)
	bool                                               bIsActive;                                                // 0x0040(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bUsingFallbackQuery;                                      // 0x0041(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0042(0x0006) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAIEncounterQueryDirectionTracker
// 0x0048
struct FFortAIEncounterQueryDirectionTracker
{
	bool                                               bHasTriedPreviousDirections;                              // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	TArray<TEnumAsByte<EFortEncounterDirection>>       PreviousQueryDirections;                                  // 0x0008(0x0010) (ZeroConstructor)
	TArray<TEnumAsByte<EFortEncounterDirection>>       ChosenDirections;                                         // 0x0018(0x0010) (ZeroConstructor)
	TArray<TEnumAsByte<EFortEncounterDirection>>       FailedDirections;                                         // 0x0028(0x0010) (ZeroConstructor)
	TArray<TEnumAsByte<EFortEncounterDirection>>       AvailableDirections;                                      // 0x0038(0x0010) (ZeroConstructor)
};

// ScriptStruct FortniteGame.FortEncounterTransitionSettings
// 0x0001
struct FFortEncounterTransitionSettings
{
	unsigned char                                      UnknownData00[0x1];                                       // 0x0000(0x0001) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortGeneratedEncounterSequence
// 0x0030
struct FFortGeneratedEncounterSequence
{
	struct FFortEncounterTransitionSettings            TransitionSettings;                                       // 0x0000(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                StartingGeneratedEncounterProfileIndex;                   // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                NumEncountersInSequence;                                  // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	struct FGameplayTagContainer                       EncounterSequenceTags;                                    // 0x0010(0x0020)
};

// ScriptStruct FortniteGame.GoalSelectionCriteria
// 0x0008
struct FGoalSelectionCriteria
{
	class UEnvQuery*                                   GoalSelectionQuery;                                       // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct FortniteGame.PawnGoalSelectionCriteria
// 0x0050
struct FPawnGoalSelectionCriteria
{
	struct FGameplayTagContainer                       IncludeEnemiesWithTags;                                   // 0x0000(0x0020) (Edit)
	struct FGameplayTagContainer                       ExcludeEnemiesWithTags;                                   // 0x0020(0x0020) (Edit)
	TArray<struct FGoalSelectionCriteria>              GoalSelectionCriteria;                                    // 0x0040(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct FortniteGame.PawnGoalSelectionTableEntry
// 0x0070
struct FPawnGoalSelectionTableEntry
{
	struct FGameplayTagContainer                       RequiredGameplayTags;                                     // 0x0000(0x0020) (Edit)
	struct FPawnGoalSelectionCriteria                  PawnGoalSelectionCriteria;                                // 0x0020(0x0050) (Edit)
};

// ScriptStruct FortniteGame.EncounterGoalSelectionTableEntry
// 0x0028
struct FEncounterGoalSelectionTableEntry
{
	struct FGameplayTagContainer                       RequiredGameplayTags;                                     // 0x0000(0x0020) (Edit)
	struct FGoalSelectionCriteria                      GoalSelectionCriteria;                                    // 0x0020(0x0008) (Edit, IsPlainOldData)
};

// ScriptStruct FortniteGame.AutoAcquireSlot
// 0x0010 (0x0020 - 0x0010)
struct FAutoAcquireSlot : public FAIHotSpotSlotInfo
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0010(0x0010) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortPickupEntryData
// 0x0030
struct FFortPickupEntryData
{
	struct FInterpCurveFloat                           FloatCurve;                                               // 0x0000(0x0018)
	struct FGuid                                       PickupGuid;                                               // 0x0018(0x0010) (IsPlainOldData)
	float                                              StartTime;                                                // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.PawnDamageZones
// 0x0018
struct FPawnDamageZones
{
	bool                                               bActive;                                                  // 0x0000(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	TArray<struct FName>                               Bones;                                                    // 0x0008(0x0010) (Edit, ZeroConstructor)
};

// ScriptStruct FortniteGame.FortSpokenLine
// 0x0030
struct FFortSpokenLine
{
	class USoundBase*                                  Audio;                                                    // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	class UAnimMontage*                                AnimMontage;                                              // 0x0008(0x0008) (ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               AnimSequence;                                             // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
	class AFortPawn*                                   Addressee;                                                // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EFortFeedbackBroadcastFilter>          BroadcastFilter;                                          // 0x0020(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0021(0x0003) MISSED OFFSET
	float                                              Delay;                                                    // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bInterruptCurrentLine;                                    // 0x0028(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bCanBeInterrupted;                                        // 0x0029(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bCanQue;                                                  // 0x002A(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x5];                                       // 0x002B(0x0005) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortPawnVocalChord
// 0x00D8
struct FFortPawnVocalChord
{
	class UAudioComponent*                             FeedbackAudioComponent;                                   // 0x0000(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FFortSpokenLine                             ReplicatedSpokenLine;                                     // 0x0008(0x0030)
