#pragma once

// Fortnite (3.1) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "../SDK.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class FortniteUI.AthenaAccountContext
// 0x0000 (0x0028 - 0x0028)
class UAthenaAccountContext : public UBlueprintContextBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaAccountContext");
		return ptr;
	}


	void SimulateBattleBookPurchase(int NumLevelsToPurchase, int* BonusLevelsGranted, bool* bOverLimit);
	int GetCurrentSeasonNumber();
	struct FText GetCurrentSeasonName();
	class UAthenaSeasonItemDefinition* GetCurrentSeasonDefinition();
	void GetBattleBookPurchaseLimit(int* MaxNumLevelsPossibleToPurchase, int* BonusLevelsGranted);
};


// Class FortniteUI.AthenaAwardAlertBase
// 0x0008 (0x0218 - 0x0210)
class UAthenaAwardAlertBase : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                      PlayerVM;                                                 // 0x0210(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaAwardAlertBase");
		return ptr;
	}


	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);
	void OnAwardGranted(class UFortAwardItemDefinition* AwardDefinition);
};


// Class FortniteUI.FortChallengeBundleCategoryInfo
// 0x0030 (0x0058 - 0x0028)
class UFortChallengeBundleCategoryInfo : public UObject
{
public:
	class UFortChallengeBundleScheduleItem*            BundleSchedule;                                           // 0x0028(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<class UFortChallengeBundleScheduleDefinition*> BundleScheduleDefinitions;                                // 0x0030(0x0010) (ZeroConstructor, Transient)
	TArray<class UFortChallengeBundleInfo*>            BundleInfos;                                              // 0x0040(0x0010) (ZeroConstructor, Transient)
	class AFortPlayerController*                       FortPC;                                                   // 0x0050(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.FortChallengeBundleCategoryInfo");
		return ptr;
	}


	int GetNumberOfBundles();
	class UFortChallengeBundleScheduleDefinition* GetFirstScheduleDefinition();
	TArray<class UFortChallengeBundleInfo*> GetChallengeBundleInfos();
};


// Class FortniteUI.FortChallengeBundleInfo
// 0x0030 (0x0058 - 0x0028)
class UFortChallengeBundleInfo : public UObject
{
public:
	class UFortChallengeBundleItem*                    BundleItem;                                               // 0x0028(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UFortChallengeBundleItemDefinition*          BundleDefinition;                                         // 0x0030(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UFortChallengeBundleCategoryInfo*            BundleCategoryInfo;                                       // 0x0038(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UFortChallengeBundleScheduleDefinition*      BundleScheduleDefinition;                                 // 0x0040(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	EChallengeScheduleUnlockType                       BundleUnlockType;                                         // 0x0048(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0049(0x0003) MISSED OFFSET
	int                                                BundleUnlockValue;                                        // 0x004C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	class AFortPlayerController*                       FortPC;                                                   // 0x0050(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.FortChallengeBundleInfo");
		return ptr;
	}


	bool IsUnlocked(struct FText* LockedReason);
	bool IsRewardThresholdAchieved();
	bool IsCompleted();
	bool HasQuestReward(class UFortItemDefinition* ItemDef, int* OutRecievedCount, int* OutTotalCount);
	class UFortItem* GetRewardItem();
	class UFortChallengeBundleCategoryInfo* GetOwningBundleCategoryInfo();
	class UFortChallengeBundleItemDefinition* GetBundleDefinition();
	void GetAchievedCount(int* OutTotalAchievedCount, int* OutTotalRequiredCount, float* OutAchievedPercent, float* OutThresholdPercent);
};


// Class FortniteUI.FortChallengeBundleTreeItemWidget
// 0x0018 (0x0820 - 0x0808)
class UFortChallengeBundleTreeItemWidget : public UCommonButton
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0808(0x0008) MISSED OFFSET
	TWeakObjectPtr<class UObject>                      ScheduleOrBundle;                                         // 0x0810(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0818(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.FortChallengeBundleTreeItemWidget");
		return ptr;
	}


	void SetupAsChallengeBundleSchedule(class UFortChallengeBundleCategoryInfo* Schedule);
	void SetupAsChallengeBundle(class UFortChallengeBundleInfo* Bundle);
	void OnBundleUpdated();
	void HandleBundleUpdated();
	class UFortChallengeBundleInfo* GetChallengeBundleInfo();
	void ExpansionChanged(bool bExpanded);
};


// Class FortniteUI.FortChallengeBundleWidget
// 0x0010 (0x03D0 - 0x03C0)
class UFortChallengeBundleWidget : public UCommonActivatablePanel
{
public:
	class UFortChallengeBundleInfo*                    ChallengeBundleInfo;                                      // 0x03C0(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x03C8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.FortChallengeBundleWidget");
		return ptr;
	}


	void Setup(class UFortChallengeBundleInfo* Info);
	void OnSetup();
	void OnBundleUpdated();
	void MoveToPrevBundle();
	void MoveToNextBundle();
	bool HasSiblingBundles();
	void HandleBundleUpdated();
	class UFortChallengeBundleInfo* GetChallengeBundleInfo();
};


// Class FortniteUI.FortActivatablePanel
// 0x0030 (0x03F0 - 0x03C0)
class UFortActivatablePanel : public UCommonActivatablePanel
{
public:
	bool                                               bIsPushedOnToContentPanelStack;                           // 0x03C0(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsAlreadyOnContentPanelStack;                            // 0x03C1(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EInputPriority                                     InputPriority;                                            // 0x03C2(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x03C3(0x0005) MISSED OFFSET
	class UClass*                                      MoreInfoPopupMenuClass;                                   // 0x03C8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x20];                                      // 0x03D0(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.FortActivatablePanel");
		return ptr;
	}


	void RestoreScrollWidget(class UWidget* FallbackWidget);
	void RestoreCenterWidget(class UWidget* FallbackWidget);
};


// Class FortniteUI.AthenaChallengeBundleScheduleScreenBase
// 0x0070 (0x0460 - 0x03F0)
class UAthenaChallengeBundleScheduleScreenBase : public UFortActivatablePanel
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x03F0(0x0010) MISSED OFFSET
	TMap<struct FName, class UFortChallengeBundleCategoryInfo*> ScheduleCategoryCache;                                    // 0x0400(0x0050) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0450(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeBundleScheduleScreenBase");
		return ptr;
	}


	void OnChallengesChanged();
	void GetChallengeCategoryInfos(TArray<class UFortChallengeBundleCategoryInfo*>* OutCategoryInfos);
};


// Class FortniteUI.FortHUDElementWidget
// 0x0028 (0x0240 - 0x0218)
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	struct FGameplayTagContainer                       HUDElementTag;                                            // 0x0218(0x0020) (Edit)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0238(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.FortHUDElementWidget");
		return ptr;
	}


	void OnVisibilitySetEvent(ESlateVisibility InVisibility);
	void HandleOnHUDResetToDefaults();
	void HandleOnHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenHUDElementTags);
};


// Class FortniteUI.AthenaCompassBase
// 0x0128 (0x0368 - 0x0240)
class UAthenaCompassBase : public UFortHUDElementWidget
{
public:
	class UMaterialInstanceDynamic*                    CompassMaterial;                                          // 0x0240(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	TArray<struct FSlateBrush>                         MarkerBrushes;                                            // 0x0248(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FSlateBrush                                 HeadingIndicatorBrush;                                    // 0x0258(0x0088) (Edit, BlueprintVisible, DisableEditOnInstance)
	float                                              MarkerVerticalOffset;                                     // 0x02E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x02E4(0x0004) MISSED OFFSET
	class UAthenaPlayerViewModel*                      VM;                                                       // 0x02E8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FSlateFontInfo                              HeadingFont;                                              // 0x02F0(0x0058) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      UnknownData01[0x20];                                      // 0x0348(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaCompassBase");
		return ptr;
	}


	void BindToModel(class UAthenaPlayerViewModel* ViewModel);
};


// Class FortniteUI.FortItemPickerBase
// 0x0068 (0x0280 - 0x0218)
class UFortItemPickerBase : public UCommonUserWidget
{
public:
	struct FScriptMulticastDelegate                    OnSelectionChangedEvent;                                  // 0x0218(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnSelectionCommittedEvent;                                // 0x0228(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnItemHoveredEvent;                                       // 0x0238(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnItemUnhovered;                                          // 0x0248(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UFortItemTileView*                           PickerTileView;                                           // 0x0258(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	bool                                               bConfirmSelectionIfAlreadySelectedAfterOneClick;          // 0x0260(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0261(0x0007) MISSED OFFSET
	class UObject*                                     NewlySelectedItem;                                        // 0x0268(0x0008) (ZeroConstructor, IsPlainOldData)
	TScriptInterface<class UFortItemViewContextInterface> ItemViewContext;                                          // 0x0270(0x0010) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.FortItemPickerBase");
		return ptr;
	}


	bool TryCommitSelectedItem();
	void SetSelectedItem(class UFortItem* ItemToSelect);
	bool SetSelectedIndex(int Index);
	void OnItemSelectionEvent__DelegateSignature(class UFortItem* SelectedItem);
	void HandlePickerTileDestroyed(class UUserWidget* Widget);
	void HandlePickerTileCreated(class UUserWidget* Widget);
	void HandlePickerItemSelected(class UObject* ObjectWhoseSelectionChanged, bool bIsSelected);
	void HandlePickerItemHovered(class UObject* ObjectOfHoveredTile);
	void HandlePickerItemDoubleClicked(class UObject* ObjectOfClickedTile);
	void HandlePickerItemClicked(class UObject* ObjectOfClickedTile);
	class UFortItem* GetSelectedItem();
	int GetIndexForItem(class UObject* Item);
	void ClearSelection();
	void CenterSelectedItemTileWidget();
	bool CanItemBeComitted(class UFortItem* ItemToCommit);
};


// Class FortniteUI.AthenaCustomizationPicker
// 0x0050 (0x02D0 - 0x0280)
class UAthenaCustomizationPicker : public UFortItemPickerBase
{
public:
	struct FScriptMulticastDelegate                    OnCosmeticSelectionSaving;                                // 0x0280(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnCosmeticSelectionSaved;                                 // 0x0290(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0x10];                                      // 0x02A0(0x0010) MISSED OFFSET
	EAthenaCustomizationCategory                       CustomizeCategory;                                        // 0x02B0(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x02B1(0x0003) MISSED OFFSET
	int                                                SubslotIndex;                                             // 0x02B4(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bCommitingSelection;                                      // 0x02B8(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x17];                                      // 0x02B9(0x0017) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaCustomizationPicker");
		return ptr;
	}


	void OnCosmeticChangeSaveEvent__DelegateSignature();
	void EndCustomizationCategory();
	void BeginCustomizationCategory(EAthenaCustomizationCategory Category, int SubslotToEdit);
};


// Class FortniteUI.FortItemTileButton
// 0x0030 (0x0838 - 0x0808)
class UFortItemTileButton : public UCommonButton
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0808(0x0008) MISSED OFFSET
	class UFortMultiSizeItemCard*                      ItemWidget;                                               // 0x0810(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	TWeakObjectPtr<class UFortItem>                    Item;                                                     // 0x0818(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EFortItemCardSize                                  ItemCardSize;                                             // 0x0820(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsRewardCard;                                             // 0x0821(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x0822(0x0006) MISSED OFFSET
	TScriptInterface<class UFortItemViewContextInterface> ItemViewContext;                                          // 0x0828(0x0010) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.FortItemTileButton");
		return ptr;
	}

};


// Class FortniteUI.FortItemPickerButton
// 0x0000 (0x0838 - 0x0838)
class UFortItemPickerButton : public UFortItemTileButton
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.FortItemPickerButton");
		return ptr;
	}

};


// Class FortniteUI.AthenaCustomizationPickerTileButton
// 0x0008 (0x0840 - 0x0838)
class UAthenaCustomizationPickerTileButton : public UFortItemPickerButton
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0838(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaCustomizationPickerTileButton");
		return ptr;
	}

};


// Class FortniteUI.AthenaCustomizationScreenBase
// 0x0010 (0x0400 - 0x03F0)
class UAthenaCustomizationScreenBase : public UFortActivatablePanel
{
public:
	class UAthenaCustomizationPicker*                  SelectionPicker;                                          // 0x03F0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x03F8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaCustomizationScreenBase");
		return ptr;
	}


	class UFortItem* GetFavoriteItemForCategory(EAthenaCustomizationCategory CustomizationType, int SubslotIndex);
};


// Class FortniteUI.AthenaCustomizationSlotSelectorButton
// 0x0018 (0x0820 - 0x0808)
class UAthenaCustomizationSlotSelectorButton : public UCommonButton
{
public:
	EAthenaCustomizationCategory                       CustomizationType;                                        // 0x0808(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0809(0x0003) MISSED OFFSET
	int                                                SubslotIndex;                                             // 0x080C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UFortMultiSizeItemCard*                      ItemWidget;                                               // 0x0810(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0818(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaCustomizationSlotSelectorButton");
		return ptr;
	}


	void SetCustomizationType(EAthenaCustomizationCategory NewType, int InSubslotIndex);
};


// Class FortniteUI.BacchusHUDElement
// 0x0018 (0x0258 - 0x0240)
class UBacchusHUDElement : public UFortHUDElementWidget
{
public:
	bool                                               bAlwaysShow;                                              // 0x0240(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EBacchusHUDStateType                               OnInBuildMode;                                            // 0x0241(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EBacchusHUDStateType                               OnInCombatMode;                                           // 0x0242(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EBacchusHUDStateType                               OnInEditMode;                                             // 0x0243(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EBacchusHUDStateType                               IsFreeFalling;                                            // 0x0244(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EBacchusHUDStateType                               IsGliding;                                                // 0x0245(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EBacchusHUDStateType                               CanOpenChute;                                             // 0x0246(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EBacchusHUDStateType                               InLockedBus;                                              // 0x0247(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EBacchusHUDStateType                               InUnlockedBus;                                            // 0x0248(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EBacchusHUDStateType                               OnTargeting;                                              // 0x0249(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EBacchusHUDStateType                               OnUsingScopeTargeting;                                    // 0x024A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EBacchusHUDStateType                               OnCanTarget;                                              // 0x024B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EBacchusHUDStateType                               OnCanUseScopeTargeting;                                   // 0x024C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EBacchusHUDStateType                               OnCrouching;                                              // 0x024D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EBacchusHUDStateType                               OnCanUseSecondaryAbility;                                 // 0x024E(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EBacchusHUDStateType                               OnDBNO;                                                   // 0x024F(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EBacchusHUDStateType                               OnControllingRCPawn;                                      // 0x0250(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0251(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.BacchusHUDElement");
		return ptr;
	}


	void OnHUDStateUpdate(const struct FFortHUDState& NewState);
};


// Class FortniteUI.AthenaEquippedItemBase
// 0x0018 (0x0270 - 0x0258)
class UAthenaEquippedItemBase : public UBacchusHUDElement
{
public:
	EEquippedWeaponDisplay                             CurrentMode;                                              // 0x0258(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0259(0x0007) MISSED OFFSET
	class UAthenaPlayerViewModel*                      VM;                                                       // 0x0260(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0268(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaEquippedItemBase");
		return ptr;
	}


	void WeaponTypeChanged(EEquippedWeaponDisplay Mode);
	void UtilityItemTypeChanged(class AFortWeapon* Weapon, class UFortWeaponItemDefinition* Item);
	void UtilityItemCountChanged(int Remaining);
	void SetViewModel(class UAthenaPlayerViewModel* ViewModel);
	void ResourceTypeChanged(class UFortResourceItemDefinition* Item, int ResourceCount);
	void ResourceCountChanged(int ResourceCount);
	void OnWorldItemsChanged();
	void OnWeaponChanged(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon);
	void OnPawnChanged();
	void OnLocalAmmoChanged(int LocalCount, int LocalRemaining);
	void OnBuildingMaterialChanged();
	void HasAmmoChanged(bool bHasAmmo);
	void AmmoTypeChanged(class AFortWeaponRanged* RangedWeapon, class UFortWorldItemDefinition* Item);
	void AmmoChanged(int MagazineAmmoCount, int BackupAmmoCount, int TotalRemaining);
};


// Class FortniteUI.AthenaEventGamesBase
// 0x0000 (0x03F0 - 0x03F0)
class UAthenaEventGamesBase : public UFortActivatablePanel
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaEventGamesBase");
		return ptr;
	}

};


// Class FortniteUI.AthenaGamePhaseWidgetBase
// 0x0020 (0x0260 - 0x0240)
class UAthenaGamePhaseWidgetBase : public UFortHUDElementWidget
{
public:
	class UMaterialInterface*                          StormComingFontMaterial;                                  // 0x0240(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              StormComingWarningTime;                                   // 0x0248(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x024C(0x0004) MISSED OFFSET
	class UTextBlock*                                  TimeText;                                                 // 0x0250(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0258(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaGamePhaseWidgetBase");
		return ptr;
	}


	void OnGamePhaseStepChanged(EAthenaGamePhaseStep GamePhaseStep);
	void HandleGamePhaseStepChanged(EAthenaGamePhaseStep GamePhaseStep);
};


// Class FortniteUI.FortUIStateWidget_NUI
// 0x0020 (0x03E0 - 0x03C0)
class UFortUIStateWidget_NUI : public UCommonActivatablePanel
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x03C0(0x0008) MISSED OFFSET
	TArray<struct FContentPushState>                   StackStates;                                              // 0x03C8(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData01[0x8];                                       // 0x03D8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.FortUIStateWidget_NUI");
		return ptr;
	}


	void SetFrontEndVisibility(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void RequestOpenSocialMenu();
	void PushContentWidgetInternal(class UWidget* Widget, const struct FContentPushState& State);
	void PushContentWidgetAdvanced(class UWidget* Widget, bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void PushContentWidget(class UWidget* Widget);
	class UWidget* PopContentWidgetInternal(const struct FContentPushState& State);
	class UWidget* PopContentWidget();
	void PopAllContentWidgets();
	void OnFrontEndVisibilityUpdated(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void OnExitState(EFortUIState NextUIState);
	void OnEnterState(EFortUIState PreviousUIState);
};


// Class FortniteUI.AthenaHUDBase
// 0x0000 (0x03E0 - 0x03E0)
class UAthenaHUDBase : public UFortUIStateWidget_NUI
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaHUDBase");
		return ptr;
	}


	void ViewModelChanged(class UAthenaPlayerViewModel* ViewModel);
	void SetFullScreenMapVisibility(bool bIsVisible);
	void OnHUDScaleChanged(float HUDScale);
};


// Class FortniteUI.AthenaHUDContext
// 0x0190 (0x01B8 - 0x0028)
class UAthenaHUDContext : public UBlueprintContextBase
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnLocalPlayerWon;                                         // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnLocalTeamWon;                                           // 0x0040(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnLocalPlayerKilledPlayer;                                // 0x0050(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnLocalPlayerDBNOStateChanged;                            // 0x0060(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnUIGameplayCue;                                          // 0x0070(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnViewTargetHealthChanged;                                // 0x0080(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnViewTargetShieldChanged;                                // 0x0090(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnViewTargetDBNOChanged;                                  // 0x00A0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnLocalPlayerBeginSkydiving;                              // 0x00B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnSquadMembersChanged;                                    // 0x00C0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnSquadMemberKillsChanged;                                // 0x00D0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnAthenaAutoFireChanged;                                  // 0x00E0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnClientSettingsShowViewersChanged;                       // 0x00F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnAthenaGamePhaseChanged;                                 // 0x0100(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnPlayerFiredWeapon;                                      // 0x0110(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnLowPerformanceMode;                                     // 0x0120(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnPTTStateChange;                                         // 0x0130(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnCanPTTChange;                                           // 0x0140(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    ShowMobilePickerDelegate;                                 // 0x0150(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnInventoryItemSelected;                                  // 0x0160(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnInventorySwapStarted;                                   // 0x0170(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnInventorySwapComplete;                                  // 0x0180(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UWidget*                                     MoveButtonWidget;                                         // 0x0190(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	bool                                               bMoveButtonMode;                                          // 0x0198(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bPendingAttachToHUD;                                      // 0x0199(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x019A(0x0002) MISSED OFFSET
	TWeakObjectPtr<class UFortItem>                    LastSelectedInventoryItem;                                // 0x019C(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x14];                                      // 0x01A4(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaHUDContext");
		return ptr;
	}


	void UseOrRleoadFromHUDStop();
	void UseOrRleoadFromHUDStart();
	void UpdateSelectedWidgetMoveOffsetVector(const struct FVector2D& VectorOffset, float fMoveScale);
	void TakeMovementInputFromHUD(const struct FVector& MoveVector, bool bTrySprint);
	void TakeLookInputFromHUD(const struct FRotator& LookRotator);
	void TakeItemSelectionInputFromHUD(int SlotIdx, bool bReloadOrUseIfAlreadySelected);
	void StopTargettingFromHUD();
	void StartOrFinishSwap(int SlotIndex);
	void ShowMobilePicker();
	void SetTargetingToggleable(bool bNewValue);
	void SetSelectWidgetToMoveMode(bool bSet);
	void SetSelectedInventoryItem(class UFortItem* Item);
	void SetResourceMaterial(TEnumAsByte<EFortResourceType> NewMaterial);
	void SetPTTState(EPTTState NewPushToTalkState);
	void SetLockOnStickCoords(const struct FVector2D& LockOnCoords);
	bool SetAutoFireFromReticleMode(bool bAutoFireOn);
	void SelectWidgetToMove(class UWidget* Widget);
	void ReloadFromHUD();
	void OnHitMapLocation(const struct FVector2D& MapCoords);
	void OnClientSettingUpdatedShowViewers();
	void MapMoveFromHUD(const struct FVector2D& Delta);
	bool IsUsingScope();
	bool IsUsingAutoFire();
	bool IsTargeting();
	bool IsSwapping();
	bool IsShowViewerCountEnabled();
	bool IsMovingSelectedWidget();
	bool IsInSelectWidgetToMoveMode();
	bool IsInBuildMode();
	bool IsCurrentWeaponFiring();
	bool IsCrouching();
	bool IsAutoRunEnabled();
	bool IsAutoFireFromReticleModeEnabled();
	bool HasWifi();
	bool HasLockOnTarget();
	bool HasAutofireTarget();
	void HandleUIGameplayCue(const struct FName& CueName, TEnumAsByte<EGameplayCueEvent> EventType, const struct FGameplayCueParameters& Parameters);
	void HandleLocalPlayerDBNOStateChanged(bool bIsDBNO);
	void HandleLocalPlayerBeginSkydiving();
	void HandleGamePhaseChange(EAthenaGamePhaseStep NewGamePhase);
	class UFortItem* GetSelectedInventoryItem();
	EPTTState GetPTTState();
	void GetLocalTime(int* Hours, int* Minutes);
	bool GetInLowPerformanceMode();
	bool GetCanPTT();
	float GetBatteryLevel();
	void FireFromHUDStop();
	void FireFromHUDStart();
	void ExecuteActionNameFromHUDWithEventType(const struct FName& ActionName, TEnumAsByte<EInputEvent> KeyEvent);
	void ExecuteActionNameFromHUD(const struct FName& ActionName);
	void EndUseFromHUD();
	void EnableAutoRunFromHUD(bool bEnable);
	void CycleQuickbar();
	bool CanCurrentWeaponAutoFireFromReticle();
	void CancelSwap();
	bool CanAutoRun();
	void BeginUseFromHUD();
};


// Class FortniteUI.AthenaHUDGamePhaseChangingBase
// 0x0008 (0x0248 - 0x0240)
class UAthenaHUDGamePhaseChangingBase : public UFortHUDElementWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0240(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaHUDGamePhaseChangingBase");
		return ptr;
	}


	void UpdateMessaging(EAthenaGamePhaseStep Step, const struct FText& MESSAGE, const struct FText& TimeText);
	void HandleGamePhaseStepChanged(EAthenaGamePhaseStep Step);
	void GamePhaseStepChanged(EAthenaGamePhaseStep Step);
};


// Class FortniteUI.AthenaHUDInputWidget
// 0x0000 (0x0218 - 0x0218)
class UAthenaHUDInputWidget : public UCommonUserWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaHUDInputWidget");
		return ptr;
	}

};


// Class FortniteUI.AthenaHUDPlayerActionAlertBase
// 0x0020 (0x0260 - 0x0240)
class UAthenaHUDPlayerActionAlertBase : public UFortHUDElementWidget
{
public:
	class AFortPlayerPawnAthena*                       LastPlayerPawn;                                           // 0x0240(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bReadyForNextAlert;                                       // 0x0248(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x17];                                      // 0x0249(0x0017) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaHUDPlayerActionAlertBase");
		return ptr;
	}


	void RequestNextAlert();
	void AlertPlayer(EAthenaPlayerActionAlert Alert, const struct FText& DetailText);
};


// Class FortniteUI.AthenaIndicatorLayerBase
// 0x0020 (0x0230 - 0x0210)
class UAthenaIndicatorLayerBase : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                      PlayerVM;                                                 // 0x0210(0x0008) (ZeroConstructor, IsPlainOldData)
	class USlateVectorArtData*                         TeamIndicatorMesh;                                        // 0x0218(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0220(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaIndicatorLayerBase");
		return ptr;
	}


	void SquadIndicatorsChanged(TArray<class AFortPlayerStateAthena*> PlayerStates);
	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);
	TArray<class AFortPlayerStateAthena*> GetSquadMembers();
	class UAthenaPlayerViewModel* GetPlayerViewModel();
};


// Class FortniteUI.AthenaInventoryEquipButtonBase
// 0x0018 (0x0820 - 0x0808)
class UAthenaInventoryEquipButtonBase : public UCommonButton
{
public:
	class UFortMultiSizeItemCard*                      ItemWidget;                                               // 0x0808(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UWidget*                                     EmptyImage;                                               // 0x0810(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	int                                                SlotIndex;                                                // 0x0818(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x081C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaInventoryEquipButtonBase");
		return ptr;
	}

};


// Class FortniteUI.AthenaInventoryFortItemTileButtonBase
// 0x0000 (0x0838 - 0x0838)
class UAthenaInventoryFortItemTileButtonBase : public UFortItemTileButton
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaInventoryFortItemTileButtonBase");
		return ptr;
	}

};


// Class FortniteUI.AthenaInventoryPanelBase
// 0x0050 (0x0440 - 0x03F0)
class UAthenaInventoryPanelBase : public UFortActivatablePanel
{
public:
	class UFortItemTileView*                           ResourceView;                                             // 0x03F0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UFortItemTileView*                           AmmoView;                                                 // 0x03F8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonButtonGroup*                          EquipButtonGroup;                                         // 0x0400(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x38];                                      // 0x0408(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaInventoryPanelBase");
		return ptr;
	}


	void RequestEquip(class UFortItem* Item);
	void HandleTileViewItemSelected(class UObject* Item, bool bIsSelected);
	void HandleQuickBarChangedBP(EFortQuickBars QuickBarType);
	void HandleInventoryItemSelected(class UFortItem* Item);
	void HandleInventoryItemHovered(class UObject* Item);
	void HandleInventoryItemDoubleClicked(class UObject* Item);
	void HandleInventoryItemClicked(class UObject* Item);
	void HandleCursorModeChangedBP(bool bCursorModeEnabled, const struct FName& ActionName, class UUserWidget* CursorModeContentWidget);
	void HandleCursorModeChanged(bool bCursorModeEnabled, const struct FName& ActionName, class UUserWidget* CursorModeContentWidget);
	class UFortItemTileView* GetTileViewForItem(class UFortItem* Item);
	void FocusTileView(class UFortItemTileView* TileView);
	void AttemptToUpdateFocus();
	void AdvanceSelection(class UFortItemTileView* TileView);
};


// Class FortniteUI.AthenaLeaderboardScreenBase
// 0x0100 (0x04F0 - 0x03F0)
class UAthenaLeaderboardScreenBase : public UFortActivatablePanel
{
public:
	class UFortTabListWidgetBase*                      LeaderboardTabList;                                       // 0x03F0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonRotator*                              MatchRotator;                                             // 0x03F8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonRotator*                              LeaderboardTypeRotator;                                   // 0x0400(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonTextBlock*                            ResetTimeText;                                            // 0x0408(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonTextBlock*                            RefreshTimeText;                                          // 0x0410(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonBorder*                               BorderLocalUserFocus;                                     // 0x0418(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDataTable*                                  LeaderboardDisplayData;                                   // 0x0420(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TMap<struct FName, class UCommonButton*>           ActiveTabButtons;                                         // 0x0428(0x0050) (BlueprintVisible, ExportObject, ZeroConstructor, Transient)
	TArray<class UFortLeaderboardRowProxyInstance*>    RowProxies;                                               // 0x0478(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient)
	TArray<class UFortLeaderboardRowProxyInstance*>    RowProxiesFreeList;                                       // 0x0488(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient)
	class UFortLeaderboardRowProxyInstance*            LocalUserRowProxy;                                        // 0x0498(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	struct FLeaderboardFilter                          CurrentLeaderboardFilter;                                 // 0x04A0(0x0018) (Transient)
	unsigned char                                      UnknownData00[0x38];                                      // 0x04B8(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaLeaderboardScreenBase");
		return ptr;
	}


	void OnUpdateTabButtonText(class UCommonButton* Button, const struct FAthenaPlaylistLeaderboardData& PlaylistTabData);
	void OnUpdateListHeader(const struct FAthenaPlaylistLeaderboardData& PlaylistTabData);
	void OnUpdateLeaderboardListUI(bool bWasSuccessful, class UFortLeaderboardRowProxyInstance* LocalUserRow, const struct FText& QueryErrorStr);
	void OnQueryStarted();
	void OnQueryFinished();
	void OnMatchTypeChanged(int MatchTypeIndex);
	void OnFriendsFilterChanged(int FriendsFilterIndex);
	void OnActiveLeaderboardTabChanged(int ActiveWidgetIndex);
	bool CanShowFriendsOnlyLeaderboard();
};


// Class FortniteUI.FortActorIndicatorWidget
// 0x0038 (0x0278 - 0x0240)
class UFortActorIndicatorWidget : public UFortHUDElementWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0240(0x0008) MISSED OFFSET
	class AActor*                                      IndicatedActor;                                           // 0x0248(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	class UPrimitiveComponent*                         IndicatedActorComponent;                                  // 0x0250(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	struct FVector                                     RelativeLocation;                                         // 0x0258(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	float                                              MaxDistance;                                              // 0x0264(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bClampOnScreen;                                           // 0x0268(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bShowClampToScreenArrow;                                  // 0x0269(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseScreenSpacePosition;                                  // 0x026A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x026B(0x0001) MISSED OFFSET
	struct FVector2D                                   ScreenSpaceRelativeOffset;                                // 0x026C(0x0008) (Edit, BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0274(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.FortActorIndicatorWidget");
		return ptr;
	}

};


// Class FortniteUI.AthenaLevelBarBase
// 0x0000 (0x0278 - 0x0278)
class UAthenaLevelBarBase : public UFortActorIndicatorWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaLevelBarBase");
		return ptr;
	}

};


// Class FortniteUI.AthenaLobbyBase
// 0x0070 (0x0460 - 0x03F0)
class UAthenaLobbyBase : public UFortActivatablePanel
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x03F0(0x0040) MISSED OFFSET
	class UOverlay*                                    OverlayMain;                                              // 0x0430(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x20];                                      // 0x0438(0x0020) MISSED OFFSET
	class UFriendCodeShareButtonBase*                  FriendCodeFrontEndShareButton;                            // 0x0458(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaLobbyBase");
		return ptr;
	}


	void ShowHighlightSummary();
	void ShowDailyNews();
	void ShowAthenaStoreToast();
	void ShouldShowHeadlessReminder(bool bShouldShow);
	void OnUpdateSocialImportButtonText(const struct FText& NewText);
	void OnPlayerClicked(int PlayerIndex);
	void OnNavigationUp();
	void OnNavigationRight();
	void OnNavigationLeft();
	void OnEndCursorOverPlayer(int PlayerIndex);
	void OnBeginCursorOverPlayer(int PlayerIndex);
};


// Class FortniteUI.FortViewModel
// 0x0000 (0x0028 - 0x0028)
class UFortViewModel : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.FortViewModel");
		return ptr;
	}

};


// Class FortniteUI.FortPlayerViewModel
// 0x02C8 (0x02F0 - 0x0028)
class UFortPlayerViewModel : public UFortViewModel
{
public:
	unsigned char                                      UnknownData00[0x2C8];                                     // 0x0028(0x02C8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.FortPlayerViewModel");
		return ptr;
	}

};


// Class FortniteUI.AthenaPlayerViewModel
// 0x0160 (0x0450 - 0x02F0)
class UAthenaPlayerViewModel : public UFortPlayerViewModel
{
public:
	unsigned char                                      UnknownData00[0x160];                                     // 0x02F0(0x0160) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaPlayerViewModel");
		return ptr;
	}

};


// Class FortniteUI.AthenaLocalPlayerViewModel
// 0x0000 (0x0450 - 0x0450)
class UAthenaLocalPlayerViewModel : public UAthenaPlayerViewModel
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaLocalPlayerViewModel");
		return ptr;
	}

};


// Class FortniteUI.AthenaLootStoreScreenBase
// 0x0000 (0x03F0 - 0x03F0)
class UAthenaLootStoreScreenBase : public UFortActivatablePanel
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaLootStoreScreenBase");
		return ptr;
	}

};


// Class FortniteUI.AthenaMapLayer
// 0x0018 (0x0118 - 0x0100)
class UAthenaMapLayer : public UWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0100(0x0010) MISSED OFFSET
	class ULocalPlayer*                                LocalPlayer;                                              // 0x0110(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaMapLayer");
		return ptr;
	}


	void SetLocalPlayer(class ULocalPlayer* LocalPlayer);
	void FlashPlayerIcon();
};


// Class FortniteUI.AthenaMatchReadyDesktopPopup
// 0x0070 (0x0280 - 0x0210)
class UAthenaMatchReadyDesktopPopup : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x70];                                      // 0x0210(0x0070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaMatchReadyDesktopPopup");
		return ptr;
	}


	void UserDismissedDialog(bool bBringToFront);
};


// Class FortniteUI.AthenaPartyBar
// 0x0018 (0x0230 - 0x0218)
class UAthenaPartyBar : public UCommonUserWidget
{
public:
	struct FScriptMulticastDelegate                    OnHelperTextChanged;                                      // 0x0218(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UCommonDynamicEntryBox*                      EntryBox_PartyMembers;                                    // 0x0228(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaPartyBar");
		return ptr;
	}

};


// Class FortniteUI.AthenaPartyMemberBase
// 0x0168 (0x0970 - 0x0808)
class UAthenaPartyMemberBase : public UCommonButton
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0808(0x0008) MISSED OFFSET
	class UTexture2D*                                  MutedBrush;                                               // 0x0810(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UTexture2D*                                  TalkingBrush;                                             // 0x0818(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UTexture2D*                                  NotTalkingBrush;                                          // 0x0820(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class AFortPlayerStateAthena*                      AthenaPS;                                                 // 0x0828(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0830(0x0008) MISSED OFFSET
	struct FUniqueNetIdRepl                            MemberUniqueId;                                           // 0x0838(0x0028) (Transient)
	struct FUniqueNetIdRepl                            ConsoleUniqueId;                                          // 0x0860(0x0028) (Transient)
	struct FString                                     Platform;                                                 // 0x0888(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData02[0x88];                                      // 0x0898(0x0088) MISSED OFFSET
	class UImage*                                      Image_LeaderIcon;                                         // 0x0920(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      Image_Speaker;                                            // 0x0928(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonTextBlock*                            Text_PlayerName;                                          // 0x0930(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonTextBlock*                            Text_KillCount;                                           // 0x0938(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UVerticalBox*                                VBox_PartyManagement;                                     // 0x0940(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonButton*                               Button_PromoteToLeader;                                   // 0x0948(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonButton*                               Button_RemoveFromParty;                                   // 0x0950(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UHorizontalBox*                              HBox_KillCount;                                           // 0x0958(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UWidgetSwitcher*                             Switcher_MemberState;                                     // 0x0960(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      Image_Platform;                                           // 0x0968(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaPartyMemberBase");
		return ptr;
	}


	void SetBannerIconAndColor(const struct FString& IconId, const struct FString& ColorId);
	void OpenPartyFinder();
	void HandleRemoveFromPartyClicked(class UCommonButton* ClickedButton);
	void HandlePromoteClicked(class UCommonButton* ClickedButton);
};


// Class FortniteUI.AthenaPickingLayer
// 0x0000 (0x0218 - 0x0218)
class UAthenaPickingLayer : public UCommonUserWidget
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaPickingLayer");
		return ptr;
	}

};


// Class FortniteUI.AthenaPlayerHitPointBarBase
// 0x0020 (0x0230 - 0x0210)
class UAthenaPlayerHitPointBarBase : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                      PlayerVM;                                                 // 0x0210(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	EHealthBarType                                     BarType;                                                  // 0x0218(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
